{
  "memory_id": "Prisoner of Azkaban 66",
  "template_used": "HP Memory Template",
  "Tags": [
    "goodbye to friends",
    "returning home"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "The students return to London aboard the Hogwarts Express. Hermione mentions to Harry and Ron that she gave up the Time-Turner because it caused her too much stress. She has decided to drop Muggle Studies so she can have a normal schedule again. Ron announces that he is planning to invite Harry to the Quidditch World Cup, since his father can get them tickets from work. Ron also has a telephone that he can use to contact Harry now.\n\nA tiny owl from Black then arrives on the train with a letter. In the letter, Black reveals that he is travelling far away from Hogwarts to avoid causing further problems and admits he bought Harry the Firebolt with Crookshanks' help. A separate section of the letter provides Harry with permission to visit Hogsmeade; Harry knows Dumbledore will accept it. Sirius also mentions that the tiny owl is a gift for Ron (later named Pigwidgeon by Ginny), since it is Black's fault that Ron no longer has a rat.\n\nAfter arriving at King's Cross, Ron says he will contact Harry about the finals of the Quidditch World Cup, and Harry heads back to Little Whinging with Uncle Vernon. Harry is happy he now has a true family member to depend on and mentions to Uncle Vernon that he has a godfather who had escaped from wizard prison and likes to check up on him.",
  "Brief Summary": "On the train home, Hermione reveals she’s dropped Muggle Studies and returned the Time-Turner. Ron plans to invite Harry to the Quidditch World Cup. An owl from Sirius brings Harry a Hogsmeade permission slip and gifts Ron a new owl. Harry returns to Privet Drive.",
  "Location": [
    "Hogwarts Express"
  ],
  "Characters Present": [
    "Harry",
    "Ron",
    "Vernon"
  ],
  "Emotional State": [
    "happy",
    "relieved"
  ],
  "Chronological Placement": 66,
  "Created By": "Me",
  "Importance": "Medium"
}