{
  "memory_id": "Prisoner of Azkaban 56",
  "template_used": "HP Memory Template",
  "Tags": [
    "Christmas",
    "new firebolt broomstick",
    "friendship troubles"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Harry is depressed both about the truth about Sirius Black and that no one bothered to tell him before. Harry is also continuing to have nightmares about Dementors and his mother screaming. During the start of the holidays, Ron and Hermione try to console Harry but Harry chooses to go to Hagrid's house to ask him about Sirius Black despite Ron and Hermione's protests. When the trio arrives at his house, they find him distraught about Buckbeak's upcoming hearing before the Committee for the Disposal of Dangerous Creatures, and Harry decides it is better not to bring Sirius Black up.\nHagrid reveals that he had a horrible experience with the Dementors during his brief time in Azkaban. He can't set Buckbeak free without the risk of being sent back there. The trio then decides to help Hagrid prepare his defence for Buckbeak's case.\nFor Christmas, among his other presents, Harry receives the best model broomstick ever released: the Firebolt. Hermione is not happy when she learns that it came without a note, and is driven out of Harry and Ron's dormitory after Crookshanks attacks Scabbers again. During Christmas dinner, Hermione reports the mystery gift to McGonagall, who sends it away to have it tested for tampering. Both Hermione and McGonagall suspect Black might have sent the broomstick and that it could be jinxed. Harry ceases speaking with Hermione, even though he knew she had good intentions with reporting the Firebolt.",
  "Brief Summary": "Troubled by news about Black, Harry visits Hagrid but finds him upset over Buckbeak’s trial. The trio offers to help his defence. At Christmas, Harry receives a Firebolt without a note, alarming Hermione, who tells McGonagall. Suspecting it may be jinxed, she confiscates it for testing, upsetting Harry.",
  "Location": [
    "Hagrid's Hut",
    "Hogwarts"
  ],
  "Characters Present": [
    "Harry",
    "Ron",
    "Hagrid",
    "McGonagall"
  ],
  "Emotional State": [
    "depressed",
    "happy"
  ],
  "Chronological Placement": 56,
  "Created By": "Me",
  "Importance": "Medium"
}