{
  "memory_id": "Prisoner of Azkaban 54",
  "template_used": "HP Memory Template",
  "Tags": [
    "Quidditch match",
    "Nimbus 2000 destroyed",
    "Dementors"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Because of the attack on The Fat Lady, an annoyed Harry gets placed under surveillance: Teachers find excuses to go down the halls with him, Percy Weasley, acting on his mother's orders, follows him everywhere like a guard dog. Professor McGonagall decides to reveal the truth to Harry but Harry reveals he already knows Black's after him. McGonagall explains that's why she doesn't want him practising Quidditch in the evenings but Harry states he's got to train. Professor McGonagall agrees and decides to ask Madam Hooch to be present.\nGryffindor's first Quidditch match is coming up, but due to Malfoy's injury, Slytherin cannot play. Gryffindor plays Hufflepuff instead. On the day before the match, Lupin becomes ill and Snape teaches his classes for him. Oddly, he ignores Lupin's syllabus and instead gives a lesson on werewolves and assigns the class to write an essay on werewolves.\nDuring the quidditch match, it is raining badly and Harry sees a large black dog resembling the Grim in the topmost empty row of seats in the Quidditch stadium. Dementors enter the match causing Harry to faint and fall from his broomstick. Harry realises that the screaming he had been hearing during his Dementor-induced fainting spells is his mother in her last moments.\nDumbledore saves Harry, but his Nimbus 2000 broomstick flies into the Whomping Willow and is destroyed. Hufflepuff wins the match shortly afterward. After the match, Harry wakes up in the Hospital Wing and learns what happened, including that Oliver Wood has declined Hufflepuff captain Cedric Diggory's offer for a rematch.",
  "Brief Summary": "After Sirius’s attack, teachers and Percy closely monitor Harry. McGonagall allows Quidditch practice with Madam Hooch present. Gryffindor plays Hufflepuff, but during the rain-soaked match, Harry sees the black dog before Dementors make him faint, hearing his mother’s last screams. Dumbledore saves him, but his Nimbus 2000 is destroyed.",
  "Location": [
    "Hogwarts",
    "Quidditch Pitch"
  ],
  "Characters Present": [
    "Harry",
    "Snape",
    "Percy",
    "McGonagall",
    "Dumbledore"
  ],
  "Emotional State": [
    "startled",
    "disappointed",
    "sad"
  ],
  "Chronological Placement": 54,
  "Created By": "Me",
  "Importance": "Low"
}