{
  "memory_id": "Prisoner of Azkaban 59",
  "template_used": "HP Memory Template",
  "Tags": [
    "Buckbeak's trial",
    "Marauder's Map"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Hagrid sends a letter to Harry, telling him that he wants to meet them in his hut for tea. Other than learning that Buckbeak's trial is that week, Harry and Ron learn that Hagrid wants to talk to them on behalf of Hermione. Hagrid mentions their feud has been hurting Hermione more than they think, and that she is only concerned about protecting Harry from Sirius Black. Despite Hagrid's advice, Ron's anger reignites when Hermione threatens to tell McGonagall about the Marauder's Map, which Harry plans to use to sneak into Hogsmeade during the upcoming trip that Saturday.\nWhile on the trip that weekend, Harry uses his Invisibility Cloak to make a few stops with Ron before visiting the Shrieking Shack, a house that is supposedly filled with violent ghosts. Malfoy, Crabbe, and Goyle show up there and provoke Ron. Harry, using his cloak, attacks the trio and Malfoy catches a glimpse of Harry's head. Malfoy later reports the incident to Snape, who interrogates Harry after he returns from Hogsmeade. Snape finds the Marauder's Map, but is not able to discover what it does and is instead bombarded by insults from the map's makers. Lupin is summoned and claims ignorance about the map and Ron shows up and claims the map is a Zonko product that insults anyone who touches it. Afterwards, Lupin brings Harry and Ron to the entrance hall, where he confiscates the map and reprimands Harry for not handing in something that could aid in Black's capture. He also scolds him for risking his life to sneak into Hogsmeade, thus undervaluing his parent's sacrifice.\nOn their way back to Gryffindor Tower, Harry and Ron find Hermione, who informs them that the Ministry has decided to execute Buckbeak despite the help she provided for Buckbeak's defence.",
  "Brief Summary": "Hagrid urges Harry and Ron to reconcile with Hermione, but tensions flare when she threatens to tell McGonagall about Harry’s Hogsmeade trip. Using his Invisibility Cloak, Harry visits Hogsmeade, attacks Malfoy, and is caught by Snape, who confiscates the Marauder’s Map. Hermione later tells them Buckbeak is sentenced to execution.",
  "Location": [
    "Hogwarts",
    "Shrieking Shack"
  ],
  "Characters Present": [
    "Harry",
    "Ron",
    "Snape",
    "Lupin"
  ],
  "Emotional State": [
    "angry",
    "nervous",
    "sad"
  ],
  "Chronological Placement": 59,
  "Created By": "Me",
  "Importance": "Medium"
}