{
  "memory_id": "Prisoner of Azkaban 55",
  "template_used": "HP Memory Template",
  "Tags": [
    "Sirius Black's betrayal",
    "Marauder's Map"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Alarmed by the adverse effects the Dementors have on him, Madam Pomfrey insists that Harry stay in the hospital wing for the weekend. The following week, Lupin is back teaching. After class, Harry goes to Lupin wondering why the Dementors affect him so much. Lupin explains that Dementors are fear itself and they pull forth the horrors from a person's past, which is why just before he faints, Harry hears his mother screaming before she dies and why the Dementors affect him worse than anyone else. Harry asks Lupin if he can give him private lessons on the spell to drive off Dementors in case another one arrives at a Quidditch match. Lupin says he will, but after the Christmas holidays, citing his frequent illness.\n\nDuring the last weekend before the holidays, Harry is yet again not able to go to Hogsmeade. To bring some Christmas cheer to Harry, Fred and George give Harry the Marauder's Map. It shows Hogwarts' secret passages and corridors, as well as every person's location within the castle and the grounds.\nHarry uses the Marauder's Map to sneak into Hogsmeade. He then meets Ron and Hermione in Honeydukes, where they were discussing what kind of sweets to get Harry. They visit the Three Broomsticks, a pub run by Madam Rosmerta. When Cornelius Fudge, Minerva McGonagall, Filius Flitwick, and Rubeus Hagrid arrive, Harry hides underneath their table to avoid being seen. The trio overhears their conversation, as they discuss how Sirius Black was a close childhood friend of Harry's father, James, and that he is Harry's godfather. The group goes on to talk about how the Potters learned how Voldemort had marked them for death. Dumbledore had advised them to go into hiding. One week later, Black sold out the Potters to Lord Voldemort. Peter Pettigrew, another of James's friends, confronted Black for the betrayal and he and twelve Muggles were killed by Black. Black was taken to Azkaban afterwards. Harry is devastated.",
  "Brief Summary": "Lupin explains Dementors affect Harry strongly because they force him to relive his mother’s death. Fred and George give Harry the Marauder’s Map, letting him sneak to Hogsmeade. Hiding in the Three Broomsticks, he overhears that Sirius Black, his godfather, betrayed his parents to Voldemort.",
  "Location": [
    "Hogwarts",
    "Three Broomsticks",
    "Hogsmeade"
  ],
  "Characters Present": [
    "Harry",
    "Fred",
    "George",
    "Ron"
  ],
  "Emotional State": [
    "happy",
    "shocked",
    "devistated"
  ],
  "Chronological Placement": 55,
  "Created By": "Me",
  "Importance": "Low"
}