{
  "memory_id": "Goblet of Fire 80",
  "template_used": "HP Memory Template",
  "Tags": [
    "golden egg",
    "dragons",
    "Triwizard tournament",
    "accio"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "After Harry tells Hermione everything he learned recently, they try to research ways to get past a dragon in the library without success. On Monday, realising the other schools' champions know about the dragons, Harry tips off Cedric to make sure the contest is fair. Moody then appears and gives Harry some general advice on how to beat his Dragon: play to his strengths and use a simple spell to get what he needs. With Hermione's help, Harry manages to master the Summoning Charm after working on it until 2 a.m. On Tuesday, the day of the task, Mr Bagman reveals that their task is to get the Golden egg each dragon is guarding. The model dragons each champion would draw out of a small bag would determine the order they'll be going in and which dragon they'll face.\nHarry finds himself slated to go last. He gets the most violent of the four dragons, the Hungarian Horntail. Once his turn comes up, Harry manages to summon his Firebolt and fly. He uses the flying strategies he learned as a Quidditch player to lure the dragon off the eggs long enough for him to zoom in and snatch the golden egg, despite taking a minor shoulder injury during the task. Ron, realising the true danger of the Tournament, and realising that Harry was telling the truth about not putting his name in the Goblet of Fire, tries to apologise to Harry feeling terrible about how he treated him. Harry forgives him and they become best friends again, with most of Hogwarts (excluding Slytherin) backing him as well.\nAfter seeing his score, Harry learns that he is currently tied with Viktor Krum for first place. Mr Bagman reveals to the champions that the Second Task will take place on 24 February at 9:30am and that their Golden Eggs contain a clue as to what it will be.",
  "Brief Summary": "Harry tips off Cedric about the dragons, then trains with Hermione to master the Summoning Charm. Facing the Hungarian Horntail, Harry summons his Firebolt and retrieves the golden egg. Ron reconciles with Harry after seeing the danger firsthand. Harry ties with Krum, and the egg holds a clue for Task Two.",
  "Location": [
    "Hogwarts"
  ],
  "Characters Present": [
    "Harry",
    "Ron",
    "Cedric"
  ],
  "Emotional State": [
    "nervous",
    "determined",
    "victorious"
  ],
  "Chronological Placement": 80,
  "Created By": "Me",
  "Importance": "Medium"
}