{
  "memory_id": "Goblet of Fire 98",
  "template_used": "HP Memory Template",
  "Tags": [
    "Cedric's memorial",
    "Rita the unregistered animagus"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Harry meets with Cedric's parents. They do not blame him for what happened and are thankful to have his body, but decline Harry's offer of the winnings.\nDuring the Leaving Feast, a memorial feast for Cedric is held, where Dumbledore tells the school what has happened in the graveyard despite the Ministry's wishes that he keep it secret. Fleur and Krum both say good-bye to the trio before they take their carriage to the Hogwarts Express.\nHermione reveals that she has discovered that Rita Skeeter is an unregistered animagus who can turn into a beetle. Hermione caught Skeeter in a jar in the Hospital Wing after the third task. Hermione assures Harry and Ron that her stories will trouble them no longer, since she told Rita that if the stories continued, she would tell the Ministry about her secret.\nJust as Malfoy, Crabbe, and Goyle arrive and taunt Harry over Voldemort's return, they are rendered unconscious from hexes used by both the trio and Fred and George Weasley. Harry, Ron, and George then began kicking, rolling, and pushing the unconscious Malfoy, Crabbe, and Goyle into a spot where they will be out of the way. Soon another mystery is solved: The person that Fred and George were hinted to have been blackmailing was Ludo Bagman. When the twins won their bet, he paid them their winnings at the Quidditch World Cup in Leprechaun gold and wouldn't even return their original wager.\n\nThe twins reveal that Bagman has a long-time problem with gambling and he made a bet that Harry would win the tournament to get his money back, which is why he was trying to help Harry cheat. However, since Harry and Cedric actually \"tied\" for first place, Bagman has gone on the run. Harry gives the twins his Triwizard Winnings to help them with their dream of running a joke shop. Everyone then say their good-byes as Harry prepares to leave with Vernon Dursley.",
  "Brief Summary": "Harry meets Cedric’s parents, who thank him and refuse the Triwizard Tournament winnings. Dumbledore tells the students the truth about Voldemort’s return. Hermione reveals Rita Skeeter is an unregistered Animagus and has blackmailed her into silence. Harry gives Fred and George his winnings to start their joke shop.",
  "Location": [
    "Hogwarts",
    "Hogwarts Express"
  ],
  "Characters Present": [
    "Harry",
    "Ron",
    "Fred",
    "George",
    "Malfoy"
  ],
  "Emotional State": [
    "sad",
    "relaxed"
  ],
  "Chronological Placement": 98,
  "Created By": "Me",
  "Importance": "Medium"
}