{
  "memory_id": "Goblet of Fire 67",
  "template_used": "HP Memory Template",
  "Tags": [
    "killing curse",
    "nightmare"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Harry has a dream, in which the Riddles' maid went to work and discovered all three Riddles dead in the drawing room. The police found no evidence of murder or suicide, claiming to be in perfect health except for the fact that they were dead. They arrested the Riddles' gardener Frank Bryce for questioning, since the door and windows were not forced open or shattered on the night of the murder, and the Riddles' cook testified that he was the only one with a key to the house. Frank, however, said the only person he saw that night was a mysterious dark-haired boy, and was released due to lack of evidence, but many still believed he committed the murders.\nHalf a century later on the night of 16 August, 1994, an elderly Frank is still working as the groundskeeper at the Riddle house. He sees a fire flickering in one of the rooms and goes over to investigate. Inside, he overhears the same boy he saw on the night of the Riddles' murder, now grown up as Lord Voldemort, and his servant Peter Pettigrew planning to capture Harry Potter with the aid of a reliable servant. Voldemort, Frank learns, captured Bertha Jorkins, a Ministry of Magic employee who Voldemort extracted information from before killing. Frank is then discovered by Voldemort's snake Nagini, who reports his presence to her master via Parseltongue. When Pettigrew beckons him in as a guest, Frank stands up to Voldemort, who is unhappy that Muggles like the elderly gardener would be spying on him. Frank doesn't know what a Muggle is, and Voldemort explains that term means he's not a wizard. Frank is still determined to inform the police about the intruders' plot. Voldemort casts the Avada Kedavra curse, ending Frank's life. Harry wakes up from the nightmare at the Dursleys' house in Privet Drive.",
  "Brief Summary": "Harry dreams of Frank Bryce, a gardener once accused of the Riddle family’s mysterious deaths. Decades later, Frank overhears Voldemort and Wormtail plotting to capture Harry. Discovered and defiant, Frank is murdered by Voldemort. Harry wakes up at the Dursleys’, shaken by the nightmare.",
  "Location": [
    "Privet Drive"
  ],
  "Characters Present": [
    "Voldemort",
    "Pettigrew"
  ],
  "Emotional State": [
    "frightened"
  ],
  "Chronological Placement": 67,
  "Created By": "Me",
  "Importance": "Medium"
}