{
  "memory_id": "Goblet of Fire 77",
  "template_used": "HP Memory Template",
  "Tags": [
    "tournament champions selected",
    "Halloween",
    "goblet of fire"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "At the Welcoming Feast for Beauxbatons and Durmstrang. Hagrid, Ludo Bagman, and Barty Crouch all arrive late. After the feast, Dumbledore announces that the three champions will be chosen by the Goblet of Fire. Students must drop their names into the Goblet, and the Goblet chooses the most worthy entrants. Dumbledore finishes by stating the champions will be selected the following night during Halloween. The Goblet is placed in the Great Hall and an Age Line is drawn around the Goblet to prevent underage students from submitting their names.\nThe next day, Fred and George attempt to cross the line through the use of an Ageing Potion, but they are repelled by the line. The pair has to be sent to the Hospital Wing to have their long grey beards removed, much to everyone's amusement, while Dumbledore states that their beards are finer than those of the other students who tried to enter. That afternoon, Harry, Ron, and Hermione visit Hagrid at his cabin and find that he has gotten dressed up for Madame Maxime. He refuses Hermione's offer to join S.P.E.W., pointing out that the house-elves enjoy their work.\nThat night, during the Halloween feast, the champions are announced: Viktor Krum representing Durmstrang; Fleur Delacour, representing Beauxbatons; and Cedric Diggory of Hufflepuff representing Hogwarts. Unexpectedly, a fourth name is thrown from the Goblet of Fire: Harry Potter, much to the suprise of everyone and dismay of some.\n\nSince Harry neither submitted his name nor asked an older student to do so, the assembly is dumbfounded. Although protests issue from the heads of the other schools, it is decided that the Goblet of Fire has spoken and that changes must be made accordingly. While many think Harry has somehow circumvented Dumbledore's age-restricting barrier, Moody suggests that perhaps someone entered Harry's name under a fourth school to ensure he would be included in the competition, hoping he might not survive the perilous tasks.",
  "Brief Summary": "At the Welcoming Feast, Dumbledore explains the Goblet of Fire will choose three champions. Fred and George fail to bypass the Age Line. On Halloween, the Goblet selects Krum, Fleur, and Cedric—then unexpectedly names Harry as a fourth champion. Moody suspects someone entered him under a false school.",
  "Location": [
    "Hogwarts",
    "Great Hall"
  ],
  "Characters Present": [
    "Harry",
    "Dumbledore",
    "Fleur",
    "Cedric",
    "Krum"
  ],
  "Emotional State": [
    "surprise",
    "confusion"
  ],
  "Chronological Placement": 77,
  "Created By": "Me",
  "Importance": "High"
}