{
  "memory_id": "Goblet of Fire 82",
  "template_used": "HP Memory Template",
  "Tags": [
    "Yule Ball",
    "finding dates"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "After a Transfiguration class, McGonagall tells her students about the Yule Ball, a formal event that is scheduled for 25 December and is open to fourth years and above (though a younger student can still attend if invited by an older student as their date). She tells Harry privately that he and his dance partner will start off the event alongside the other champions and their dates as a traditional part of the Triwizard Tournament.\nOver the next few weeks, both Ron and Harry unsuccessfully attempt to find dates as they get through the final classes of the term. Fred and George are also acting suspiciously again; they want to borrow Pigwidgeon to deliver a letter to someone, but Pigwidgeon is not back yet (from delivering Sirius' letter). Harry later works up his courage and asks Cho to go to the dance with him, but learns that she had already agreed to go with Cedric. This information sours Harry's relationship with Cedric.\nAfter Harry returns to the Gryffindor common room, he sees Ginny comforting Ron and learns that Ron foolishly tried to ask Fleur out. Ron then tactlessly asks Hermione out. She is offended to be the last person he would ask, telling Ron she is going with someone else. Harry can't ask Ginny out either, since she is going with Neville. Finally, Harry manages to secure dates for both himself and Ron. Parvati for Harry, and Padma for Ron.",
  "Brief Summary": "McGonagall announces the Yule Ball and tells Harry he must open it with a partner. Harry and Ron struggle to find dates. Cho turns Harry down for Cedric, and Hermione rejects Ron, revealing she already has a date. Eventually, Harry asks Parvati, who finds a date—Padma—for Ron.",
  "Location": [
    "Hogwarts"
  ],
  "Characters Present": [
    "Harry",
    "Ron",
    "Parvati",
    "Padma"
  ],
  "Emotional State": [
    "worried",
    "nervous",
    "offended"
  ],
  "Chronological Placement": 82,
  "Created By": "Me",
  "Importance": "High"
}