{
  "memory_id": "Goblet of Fire 86",
  "template_used": "HP Memory Template",
  "Tags": [
    "Triwizard Tournament",
    "merpeople",
    "being an idiot",
    "brave"
  ],
  "__perspective__": "Second Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Harry explains what happened the previous night to Ron and Hermione. Even though Harry and Ron suspect Snape might have put Harry's name in the Goblet of Fire, Hermione doubts this. Harry also sends a school owl to Sirius to update him on what happened.\nOver the coming weeks, even with help from Hermione and Ron as well as the library's resources, Harry struggles to think of a way to breathe underwater for an hour. Two days before the second task is to start, Sirius's response comes in. Sirius wants to know when their next trip to Hogsmeade is.\n\nThe next morning, with a little help from Dobby, Harry discovers gillyweed, a plant that, when eaten, gives him fish-like qualities such as gills and fins. He quickly makes his way to the lake just as the task is about to start and finds that, once again, Percy is taking Mr Crouch's place. While swimming through the lake and fighting off a swarm of Grindylows, Moaning Myrtle points Harry in the right direction and Harry discovers a town of Merpeople, where Ron (the thing Harry would miss the most) is being held, along with Hermione (for Krum), Cho (for Cedric), and Fleur's sister.\nHarry frees Ron, but refuses to leave the others, despite the insistence of the Merpeople. Cedric and Krum appear and rescue their loved ones, but Fleur never arrives. With little other choice, Harry drags her sister to the surface as well, narrowly avoiding drowning as the gillyweed wears off. Although he was wrong to think the other hostages would be left to die (they would have simply returned to the surface unharmed), his bravery and valour earn him extra points from the judges. This puts both Harry and Cedric in first place in the overall points.",
  "Brief Summary": "Harry struggles to solve the second task until Dobby gives him gillyweed. In the lake, he rescues Ron and Fleur’s sister, refusing to leave her behind. Though misinformed about the task’s danger, his courage earns extra points, tying him with Cedric for first place. Sirius asks to meet in Hogsmeade.",
  "Location": [
    "Black Lake"
  ],
  "Characters Present": [
    "Harry",
    "Fleur",
    "Dobby",
    "Ron"
  ],
  "Emotional State": [
    "distressed",
    "relieved"
  ],
  "Chronological Placement": 86,
  "Created By": "Me",
  "Importance": "Medium"
}