{
  "memory_id": "Goblet of Fire 83",
  "template_used": "HP Memory Template",
  "Tags": [
    "golden egg clue",
    "Yule Ball",
    "Christmas"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "As the holidays begin, Hermione refuses to tell Ron who her date for the Yule Ball is, stating he'll make fun of her. Pigwidgeon returns with Sirius' reply. Sirius congratulates Harry for completing the first task and reminds him to stay on guard.\nOn Christmas Day, Dobby wakes Harry up and gives Harry his present: a pair of mismatched socks he made himself from wool he purchased with his wages. Harry then opens the presents he got from his other friends for Christmas, which include a hand-knit jumper with the image of a dragon from Mrs Weasley and a magical penknife from Sirius. Harry and his dorm mates get ready for the ball, then head to the Great Hall, where the event is to take place. At the start of the ball, it is revealed that Hermione is going with Viktor Krum.\nAfter the entire room has their meal, the Weird Sisters start their performance for the dance. Neither Harry nor Ron have any interest in dancing (though Harry does participate in the opening dance) and their dates, Pavarti and Padma, soon abandon them. Ron also gets into an embarrassing argument with Hermione; he claims that Viktor Krum is the enemy and that going to the ball with him is treason.\n\nHarry and Ron then decide to go for a walk on the grounds to get away from the ruckus. They encounter Hagrid and Maxime enjoying a tender moment. The moment is ruined when Hagrid insinuates Maxime is a Half-giant, like him. She is offended due to the nasty reputation giants have in the wizarding world. Shortly after the ball, Cedric gives Harry a hint about the egg: have a bath with it. He gives Harry the password to enter the Prefects' bathroom, and thanks him for warning him about the dragons.",
  "Brief Summary": "Hermione refuses to reveal her Yule Ball date, who is later revealed to be Krum. On Christmas, Harry receives socks from Dobby and gifts from friends. At the Ball, Harry and Ron sulk while their dates leave them. Ron argues with Hermione over Krum. Cedric later gives Harry a clue about the egg.",
  "Location": [
    "Hogwarts",
    "Great Hall"
  ],
  "Characters Present": [
    "Harry",
    "Ron",
    "Krum",
    "Cedric",
    "Padma",
    "Pavarti"
  ],
  "Emotional State": [
    "happy",
    "nervous",
    "surprised"
  ],
  "Chronological Placement": 83,
  "Created By": "Me",
  "Importance": "High"
}