{
  "memory_id": "Goblet of Fire 73",
  "template_used": "HP Memory Template",
  "Tags": [
    "Triwizard Tournament announced",
    "Hogwarts house elves",
    "Qudditch cancelled"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "After arriving at the castle the trio heads to the Gryffindor Table for the Sorting Ceremony. The Start-of-Term Feast then begins. After Nearly Headless Nick brings up the subject of Peeves causing problems in the kitchen, Hermione learns that house-elves work there. This makes her even more angry about the way house-elves are treated, especially since house-elves do not get any benefits (which the house-elves themselves do not want). She then refuses to eat any more food in protest.\n\nProfessor Dumbledore announces that instead of having Quidditch this year (which created lots of mayhem, especially from the Weasley twins), a very special event is going to take place at Hogwarts. Before he goes on, a mysterious man with a bizarre appearance appears in the Great Hall. Dumbledore identifies him as Mad-Eye Moody, the new Defence Against the Dark Arts teacher. Afterwards, Dumbledore states this event is the Triwizard Tournament, which will start at the end of October on Halloween. The Tournament calls for a single champion from each of the three largest wizarding schools in Europe to compete in a series of three trials for the prize of one thousand Galleons. Though it wasn't in play in the past due to the vast number of student deaths, Dumbledore reveals that both Crouch (Department of International Co-operation) and Bagman's (Department of Games and Sports) departments at the British Ministry of Magic have decided to reinstate the tournament under the condition that new safety rules are used, including that no student under the age of seventeen will submit their name for consideration. The students are then sent to bed, though Fred and George plot to find a way to bypass Dumbledore's safety measures so they can enter the tournament, to get fame and glory, as well as money.",
  "Brief Summary": "At the feast, Hermione learns house-elves work in the kitchens and boycotts food in protest. Dumbledore announces Quidditch is canceled for the Triwizard Tournament. Mad-Eye Moody is introduced as the new Defence teacher. The tournament will include strict safety rules—only students over seventeen may enter. Fred and George plot to cheat.",
  "Location": [
    "Hogwarts",
    "Great Hall"
  ],
  "Characters Present": [
    "Dumbledore",
    "Harry",
    "Moody Ron"
  ],
  "Emotional State": [
    "disappointed",
    "intrigued",
    "excited"
  ],
  "Chronological Placement": 73,
  "Created By": "Me",
  "Importance": "High"
}