{
  "memory_id": "Goblet of Fire 76",
  "template_used": "HP Memory Template",
  "Tags": [
    "Beauxbatons Academy",
    "Durmstrang Institute",
    "Imperius Curse resistence"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "In Defence Against the Dark Arts, Moody has his students practise resisting the Imperius Curse. Only Harry is able to resist it, despite slightly bruising his knees in the process; it takes him a couple more tries before he can completely resist it.\n\nFollowing Care of Magical Creatures, the group returns to the castle and sees a crowd of students looking at a sign posted to the wall. The sign reveals that in about a week, on 30 October, lessons will end early due to the delegations from the two other schools, the Beauxbatons Academy of Magic and the Durmstrang Institute, arriving that evening. The lesson cut off, for Gryffindors was Potions, and the Trio felt lucky, especially when Snape hinted of a poisoning, to find out if their antidotes work or not. Over the next week, Hogwarts Castle undergoes a major refit: the castle is redecorated and the nervous staff members prepare for the delegates to arrive.\nThe trio talk with the twins about the Triwizard Tournament, and Hermione brings up house-elves. Fred and George suggest she should visit the Hogwarts Kitchen just to see for herself how happy they are, despite Hermione's insistence that they are being brainwashed.\n\nThat night, each of the Houses are assembled in a line in the Great Hall while waiting for the delegates to arrive. The first comes by flying carriage, the second shortly afterwards via submerged ship, with their respective heads: Madame Maxime (Headmistress of Beauxbatons), a woman as big as Hagrid, and Igor Karkaroff (Headmaster of Durmstrang). Viktor Krum is revealed to be among the Durmstrang students, which makes Ron, a little excited.",
  "Brief Summary": "Harry practises resisting the Imperius Curse, succeeding after several tries. A notice announces that Beauxbatons and Durmstrang will arrive on October 30. Hogwarts prepares for their visit. Fred and George tease Hermione about house-elves. That evening, the schools arrive in dramatic fashion, with Krum among the Durmstrang students.",
  "Location": [
    "Hogwarts",
    "Great Hall"
  ],
  "Characters Present": [
    "Harry",
    "Ron",
    "Krum"
  ],
  "Emotional State": [
    "excited",
    "curious"
  ],
  "Chronological Placement": 76,
  "Created By": "Me",
  "Importance": "Medium"
}