{
  "memory_id": "Goblet of Fire 74",
  "template_used": "HP Memory Template",
  "Tags": [
    "Malfoy the ferret",
    "blast-ended screwts"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "On the morning of their first day back, Harry, Ron, and Hermione prepare to begin the classes in their school schedule, though Harry is concerned about why Hedwig had not returned with a reply from Sirius. Hermione has also ended her hunger strike, deciding to stand up for house-elf rights in a different manner. First the Gryffindor fourth-years have lessons for Herbology, then Care of Magical Creatures, where Hagrid teaches about monstrous creatures known as Blast-Ended Skrewts. At dinner, Draco Malfoy insults Ron by showing Ron a Daily Prophet article that casts Ron's father Arthur Weasley in a bad light by Rita Skeeter, who somehow found out about the attack on Alastor Moody's home, even after the Ministry of Magic tried to keep it secret. While Harry and Hermione restrain an angry Ron, Draco makes some rude comments about Mrs Weasley. After Harry counters this by making a rude comment about Draco's mother and starts walking away, an angry Draco attempts to curse Harry from behind. Moody quickly intervenes, transfiguring Draco into a white ferret and bouncing him around until Professor McGonagall appears. After seeing what he's doing and putting two and two together, McGonagall undoes the spell. She then proceeds to tell Moody off by stating they never punish the students by hexing them. Moody defends his actions by explaining he thought a good sharp shock would be sufficient. Professor McGonagall tells him they punish the students by giving them detentions or speaking with the offender's Head of House. With that, Moody takes Draco Malfoy to see Professor Snape. \nAfter Hermione leaves to do some extracurricular work (even with no homework given out to her).",
  "Brief Summary": "On their first day back, Hermione ends her hunger strike. Hagrid introduces Blast-Ended Skrewts. Malfoy insults Ron with a Skeeter article, prompting a fight. Moody catches Malfoy trying to hex Harry and turns him into a ferret. McGonagall intervenes and scolds Moody for using magic as punishment.",
  "Location": [
    "Hogwarts"
  ],
  "Characters Present": [
    "Harry",
    "Ron",
    "Malfoy",
    "Moody",
    "Hagrid"
  ],
  "Emotional State": [
    "angry"
  ],
  "Chronological Placement": 74,
  "Created By": "Me",
  "Importance": "Medium"
}