{
  "memory_id": "Philosopher's Stone 16",
  "template_used": "HP Memory Template",
  "__perspective__": "First Hand",
  "Created By": "Me",
  "Tags": [
    "breaking the rules",
    "Harry gets hexed",
    "Nicolas Flamel"
  ],
  "Importance": "Medium",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Harry borrows a book entitled Quidditch Through the Ages from Hermione. Professor Snape discovers Ron, Harry, and Hermione out with the book and confiscates it. Harry notices that Snape is limping. Going off to retrieve the book from Snape, Harry overhears Snape talking to Argus Filch about the fact that the three-headed dog has attacked him, leaving a cut on his leg, which makes Harry very suspicious.\n\nThe next morning, the Quidditch match begins. Harry spots the Golden Snitch early in the game and is flying toward it when the Slytherin Captain pushes him out of the way and is penalised. Later in the game, Harry's broom begins jerking uncontrollably. Hagrid comments that only Dark magic could make a broomstick so hard to manage. Hermione notices that Snape is staring at Harry and muttering to himself (Unaware Quirrell is the one hexing Harry), signs of casting a curse. Hermione rushes over to Snape in such a hurry that she knocks Quirrell over, sneaks behind Snape, and sets his robe on fire. Suddenly, the spell on Harry's broom is broken and Harry is once again in control. He starts speeding toward the ground and lands, catching the Snitch in his mouth and nearly swallowing it.\n\nHagrid takes Harry back to his hut with Hermione and Ron, who tells Harry that Snape was putting a curse on his broomstick. Hagrid does not believe this, asking why Snape would try to kill Harry. Harry tells Hagrid about Snape getting injured by the dog in the third-floor corridor. Hagrid involuntarily reveals that the three-headed dog, Fluffy, is his, and that what the dog is guarding is a secret known only to Albus Dumbledore and a man named Nicolas Flamel.",
  "Brief Summary": "During Harry's first Quidditch match his broom starts behaving erratically. suspecting his is being cursed by Snape, Hermione sneaks up behind him and secretly sets his robes on fire. Harry regains control of his broom, winning the match. Later, Hagrid reveals the three headed dog (Fluffy) is his, and its guarding something to do with Nicolas Flamel.",
  "Location": [
    "Hogwarts",
    "The Quidditch Pitch"
  ],
  "Characters Present": [
    "Harry",
    "Snape",
    "Quirrell",
    "Hagrid"
  ],
  "Emotional State": [
    "distressed",
    "triumphant",
    "intrigued"
  ],
  "Chronological Placement": 16
}