{
  "memory_id": "Philosopher's Stone 12",
  "template_used": "HP Memory Template",
  "__perspective__": "First Hand",
  "Created By": "Me",
  "Tags": [
    "joining the quidditch team",
    "first flying lesson"
  ],
  "Importance": "Low",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Harry has been at Hogwarts for around two weeks when he finds out that the Gryffindors will have flying lessons with the Slytherins, much to his disliking. Harry does not want to spend more time with Malfoy than he has to. However, Harry finds that he is quite a natural at flying. Madam Hooch leads the class, gently sending the new fliers off the ground. Neville has an accident when his broom runs amok and breaks his wrist. Madam Hooch takes him to the Hospital Wing telling everyone to stay on the ground while she is away. Malfoy notices a Remembrall belonging to Neville, picks it up, and begins to fly around with it. Harry goes after Malfoy, who throws the ball in the air. Harry catches it spectacularly and lands safely back on the ground. Just then, Professor McGonagall arrives, reprimanding Harry and ordering him to follow her. But instead of punishing him, McGonagall introduces him to Oliver Wood, captain of the Gryffindor Quidditch team, and makes him the Gryffindor team's new Seeker. At dinner, Harry excitedly tells Ron about joining the Quidditch team but tells him that Wood wants it to be a secret.",
  "Brief Summary": "Harry attends his first broom flying lesson, and after Neville is escorted to the hospital wing, Malfoy takes the opertunity to steal Nevilles rememberall, taunting Harry with it when he tries to take it back. Harry gets on his broom, breaking the rules to get the rememberall back. Instead of being punished, McGonagall recommends him to the Quidditch team.",
  "Location": [
    "Hogwarts",
    "Quidditch Pitch"
  ],
  "Characters Present": [
    "Harry",
    "Neville",
    "McGonagall",
    "Malfoy"
  ],
  "Emotional State": [
    "annoyed",
    "surprised"
  ],
  "Chronological Placement": 12
}