{
  "memory_id": "Order of the Phoenix 101",
  "template_used": "HP Memory Template",
  "Tags": [
    "Order of the Phoenix",
    "secret base",
    "rescue and escape"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "When Uncle Vernon, Aunt Petunia, and Dudley leave to attend an award ceremony for the best kept suburban lawn in England (which was a hoax set up by Tonks to lure the Dursleys away from their house), a number of witches and wizards come to rescue Harry from the Dursleys' home. They are members of the Order of the Phoenix, an elite group whose members fight Lord Voldemort and the Death Eaters. Among them were the real Mad-Eye Moody and Remus Lupin, along with some newcomers such as Nymphadora Tonks and Kingsley Shacklebolt. After flying through the cold night, they land at their destination, 12 Grimmauld Place (London). The Weasleys, Hermione Granger, and Harry’s godfather Sirius Black are there. While the Order of the Phoenix are having a meeting, Mrs Weasley takes Harry to the room where Ron and Hermione are before heading back. Harry converses with Hermione and Ron and learns to his ire that Dumbledore was the reason he had no contact from his friends all summer, though Ron and Hermione were uncomfortable with this, knowing how Harry would feel. Fred and George then appear magically through Apparition, revealing to Harry they passed their test. The Weasley children reveal that—besides Severus Snape who has joined the Order—Bill and Charlie have also joined. Charlie has been given the task of recruiting foreign wizards to their cause.\nAs for Percy, the Weasley children sadly reveal he has deserted their family after he and Arthur had a fight over Percy's recent promotion to Cornelius Fudge's Junior Assistant. Harry also learns that the Ministry has been using the Daily Prophet to build on what Rita Skeeter started and is portraying Harry as some \"attention-seeking liar\". While helping on closing the curtains, Sirius shows up and explains to Harry that Number 12, Grimmauld Place is the Black family's ancestral home and that he inherited it upon his mother's death.",
  "Brief Summary": "The Order of the Phoenix rescues Harry from Privet Drive and takes him to 12 Grimmauld Place, Sirius Black’s inherited home. Harry reunites with friends, learns Dumbledore kept them from writing, and hears of Percy’s rift with his family, Snape’s membership in the Order, and the Ministry’s smear campaign against him.",
  "Location": [
    "Grimmauld Place",
    "Privet Drive"
  ],
  "Characters Present": [
    "Harry",
    "Ron",
    "Sirius"
  ],
  "Emotional State": [
    "upset",
    "angry"
  ],
  "Chronological Placement": 101,
  "Created By": "Me",
  "Importance": "Low"
}