{
  "memory_id": "Order of the Phoenix 99",
  "template_used": "HP Memory Template",
  "Tags": [
    "Patronus",
    "Mundungus abandons watch",
    "Dementors"
  ],
  "__perspective__": "Second Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "On the hottest day of summer so far, Harry Potter remains at his house, 4 Privet Drive, living with his Muggle aunt, uncle and cousin and severely cut off from the rest of the wizarding world. The neighbourhood is suffering from an exhausting heat wave. Harry spends the majority of his summer out of the house, going on walks and avoiding his aunt and uncle. He doesn't want them to know why he is so interested in the news that summer. He is constantly rummaging through bins for old newspapers, searching for front-page news about the return of Lord Voldemort in the Daily Prophet. However, nothing unusual is reported, so Harry assumes that the Minister for Magic, Cornelius Fudge, is still as oblivious and in denial of Lord Voldemort's return as he was before.\n\nAfter running into his cousin Dudley Dursley and his street gang on a walk, Harry confronts Dudley after his gang leaves. This turns into an argument where Dudley mocks Harry about Cedric's death, having heard Harry use that name in his sleep. Harry immediately denies it, and when Harry takes out his wand and pretends to curse Dudley with it, a cold chill comes onto the duo and they are then attacked by Dementors. Harry attempts the Patronus Charm three times and is successful on the last try, and is surprised to find Mrs Figg, his old, cat-loving neighbour, storming up the road towards them. Harry tries to hide his wand, but Mrs Figg tells him to keep it out in case more of them show up. This comment makes Harry realise that Mrs Figg knows about the wizarding world. She is furious about Mundungus Fletcher, who was supposed to be watching Harry for the Order of the Phoenix, but had Disapparated from the front of 4 Privet Drive only moments earlier.",
  "Brief Summary": "In a sweltering summer, Harry obsessively checks the news for signs of Voldemort’s return but finds nothing. After Dudley taunts him about Cedric, Dementors attack. Harry drives them off with a Patronus, and Mrs Figg appears—revealing she knows about magic and is angry at Mundungus for abandoning his watch.",
  "Location": [
    "Privet Drive"
  ],
  "Characters Present": [
    "Harry",
    "Dudley",
    "Figg"
  ],
  "Emotional State": [
    "angry",
    "frightened",
    "surprised"
  ],
  "Chronological Placement": 99,
  "Created By": "Me",
  "Importance": "Low"
}