{
  "memory_id": "Order of the Phoenix 105",
  "template_used": "HP Memory Template",
  "Tags": [
    "aquittal party",
    "Hermione and Ron prefects",
    "Boggart"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Harry leaves the courtroom and tells Mr Weasley that he had been cleared of all charges. Arthur decides to take Harry back to Grimmauld Place before he heads out on an assignment. On their way they see Fudge meeting with Lucius Malfoy. While Harry believes that Fudge may have been put under the Imperius Curse, Mr Weasley states that Dumbledore doubts this. Back at Grimmauld Place, everybody celebrates Harry's acquittal.\nA few days later, on the last day of the holidays, the children receive their Hogwarts letters and Ron and Hermione are named prefects. Molly Weasley is so pleased with Ron's appointment as a prefect that she agrees to Ron's request to get a new broomstick (though an inexpensive one) when she goes to Diagon Alley to pick up their new books. Harry feels some resentment that Ron was chosen over him as prefect. Later that night, Mrs Weasley prepares a dinner party for the new prefects. During the party, Harry feels better when he learns from Sirius that he and Harry's father James were not made prefects either during their fifth year at Hogwarts, since Lupin was selected for that position instead.\nAfter the party, Mrs Weasley goes upstairs to get rid of the Boggart Alastor Moody identified for her earlier. Moody shows Harry an old photograph of the original Order of the Phoenix and identifies the people in the photograph, though hearing Moody describe the terrible fates of some of the members in the photograph makes Harry feel uncomfortable. After going upstairs, Harry finds that the sight of her worst fears (all her family members and Harry dead) was too much for Mrs Weasley; she started to cry before Lupin gets rid of the Boggart. As they help calm her down, Mrs Weasley wonders about the future of her loved ones.",
  "Brief Summary": "Harry is cleared of charges. At Grimmauld Place, Ron and Hermione become prefects, upsetting Harry until Sirius reassures him. Moody shows Harry a photo of the old Order, detailing grim fates. Later, a Boggart reveals Mrs Weasley’s worst fear—her loved ones dead—leaving her in tears until Lupin comforts her.",
  "Location": [
    "Grimmauld Place"
  ],
  "Characters Present": [
    "Harry",
    "Molly",
    "Sirius",
    "Moody",
    "Lupin"
  ],
  "Emotional State": [
    "resentful",
    "uncomfortable"
  ],
  "Chronological Placement": 105,
  "Created By": "Me",
  "Importance": "High"
}