{
  "memory_id": "Order of the Phoenix 106",
  "template_used": "HP Memory Template",
  "Tags": [
    "Heading to Hogwarts",
    "Havrid missing",
    "Thestral"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "On the day of departure to Platform Nine and Three-Quarters, the group is rushing to get ready as the children will be taken there under guard per Moody's recommendation. Mrs Weasley is angry with Fred and George for bewitching their trunks instead of trying to carry them downstairs and knocking Ginny off-balance. Harry is assigned to go with Molly and Tonks. Sirius accompanies them in his Animagus form. After the Hogwarts Express departs, with Ron and Hermione having to go to the prefects' carriage, Harry shares a compartment with Ginny, Neville Longbottom, and a girl from Ginny's year named Luna Lovegood, who is a Ravenclaw student. Later Ron and Hermione show up and tell them who the new prefects are for the other houses, including Draco Malfoy and Pansy Parkinson for Slytherin. Luna is reading a tabloid magazine called The Quibbler, of which, she tells them, her father is the editor, after Hermione makes an insensitive comment towards the magazine.\nAfter arriving at Hogsmeade station Harry notices that instead of Hagrid, Professor Grubbly-Plank, who previously substituted for Hagrid during their last school year, is there to direct the first years to their boats. When boarding their carriage Harry notices that the carriages are being pulled by some sort of winged horses (called a Thestral). He points them out to Ron and Hermione, but they cannot see them, and act worried when he insists that they are right there. Luna says that she can see them, and in fact could see them ever since she first came to Hogwarts. Harry is mystified, since he couldn't see them when he first came, but he can see them now.",
  "Brief Summary": "Escorted to the train under guard, Harry rides with Ginny, Neville, and Luna Lovegood, later joined by Ron and Hermione. Luna reads The Quibbler, her father’s magazine. At Hogsmeade, Hagrid is absent, replaced by Professor Grubbly-Plank. Harry sees winged horses pulling carriages—visible only to him and Luna.",
  "Location": [
    "Hogwarts"
  ],
  "Characters Present": [
    "Harry",
    "Luna",
    "Ginny",
    "Ron"
  ],
  "Emotional State": [
    "Nervous",
    "embarassed",
    "confused"
  ],
  "Chronological Placement": 106,
  "Created By": "Me",
  "Importance": "Medium"
}