{
  "memory_id": "Goblet of Fire 94",
  "template_used": "HP Memory Template",
  "Tags": [
    "death of Cedric",
    "Triwizard Tournament",
    "portkey"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "For the third and final task of the Triwizard Tournament, Mr Bagman takes the champions to the maze and Harry and Cedric, who are tied for first place, are sent in first.\n\nHarry successfully navigates the maze with the aid of the Four-Point Spell. He gets past both a Blast-Ended-Skrewt and a Boggart disguised as a Dementor. Along the way, he hears Fleur scream. Harry rescues Cedric, who has been attacked by a mind-controlled Krum; Harry manages to stun Krum and sends out a signal for Krum to be rescued before he and Cedric move on. Harry manages to pass a sphinx and, as he approaches the Cup, is attacked by an Acromantula. Aided by Cedric, he defeats it, though one of Harry's legs is injured in the process. After taking the monster out, they decide to grab the Cup simultaneously. Unbeknownst to them, the Cup is actually a Portkey that transports them to an old cemetery in the Muggle village of Little Hangleton. \n\nJust as Harry and Cedric are trying to figure out what happened, a hooded stranger appears and Harry's scar begins hurting again. A second voice orders the stranger to kill Cedric, which he does, leaving Harry frozen with shock and horror. Harry is then dragged to a large marble tombstone with the name Tom Riddle engraved upon it. The stranger then tightly binds Harry to it with thick black cords and stuffs black cloth in his mouth to muffle his cries for help. \nUnable to escape, Harry recognises the stranger as Peter Pettigrew. He also notes that Pettigrew is carrying what appears to be a deformed infant. Pettigrew takes some of Harry's blood, bone dust from Tom Riddle Snr's grave, and puts them in a cauldron. He then cuts off his own right hand, at the orders of the strange creature, and places it in a cauldron. The creature is revealed to be none other than Lord Voldemort himself, and the potion made by Pettigrew returns a physical form and restores his powers stronger than before.",
  "Brief Summary": "Harry and Cedric reach the Triwizard Cup together, unaware it’s a Portkey. They’re transported to a graveyard where Pettigrew kills Cedric. Harry is bound to Tom Riddle’s grave as Pettigrew performs a dark ritual using Harry’s blood. Voldemort emerges reborn, fully restored to power at last.",
  "Location": [
    "Hogwarts",
    "Little Hangleton"
  ],
  "Characters Present": [
    "Cedric",
    "Voldemort",
    "Pettigrew"
  ],
  "Emotional State": [
    "shock",
    "horror"
  ],
  "Chronological Placement": 94,
  "Created By": "Me",
  "Importance": "High"
}