{
  "memory_id": "Goblet of Fire 89",
  "template_used": "HP Memory Template",
  "Tags": [
    "Nifflers",
    "Leprechaun gold",
    "hate mail"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Hate mail soon starts popping up for Hermione in regard to Rita Skeeter's article. She has to go to the Hospital Wing due to a letter containing bubotuber pus, causing painful boils, and doesn't turn up until a Care of Magical Creatures lesson, where Hagrid is having them use Nifflers to find gold coins he buried (which is actually Leprechaun gold, which disappears in a few hours). Hagrid encourages Hermione to ignore the hate mail, citing the hate mail he received after Skeeter released the article about him. Hermione decides to discover how Skeeter has been getting her information when she is already banned from school grounds.\nIt is around Easter that Percy's response comes, along with Easter eggs from Mrs Weasley (Hermione's is smaller than Harry and Ron's because Mrs Weasley read Skeeter's article). His irradiated response doesn't help. On the night of 24 May, Harry and the other champions are called to the Quidditch pitch by Ludo Bagman and informed that a magical maze will be grown there and filled with magical obstacles. Their job is to head to the centre of the maze and touch the Triwizard Cup. Before Mr Bagman can offer Harry advice again, Krum takes Harry aside to the Forbidden Forest and questions him about his relationship with Hermione. Harry assures Krum that he and Hermione are just friends.\nMoments later, a rather crazy-looking Barty Crouch emerges from the forest asking for Dumbledore. He mentions that Voldemort is getting stronger and that he himself was responsible for something bad. He also mentions his son, as well as Bertha Jorkins, who is now dead. Harry goes to retrieve Dumbledore, but when he returns, they find that Krum has been stunned and Crouch has disappeared. Dumbledore has Hagrid take Harry back to Gryffindor Tower to rest.",
  "Brief Summary": "Hermione receives hate mail over Skeeter’s article and ends up in the Hospital Wing. She vows to uncover how Skeeter gathers info while banned from school. In May, Crouch appears in the forest ranting about Voldemort. When Dumbledore returns, Crouch is gone and Krum is stunned.",
  "Location": [
    "Hogwarts"
  ],
  "Characters Present": [
    "Krum",
    "Harry",
    "Hermione",
    "Hagrid",
    "Barty"
  ],
  "Emotional State": [
    "surprised",
    "upset"
  ],
  "Chronological Placement": 89,
  "Created By": "Me",
  "Importance": "Medium"
}