{
  "memory_id": "Goblet of Fire 68",
  "template_used": "HP Memory Template",
  "Tags": [
    "Quidditch world cup",
    "Bertha Jorkins missing"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "A letter from Molly Weasley addressed to the Dursleys arrives. She asks if Harry can join Hermione and the Weasley family to go to the Quidditch World Cup final between Ireland and Bulgaria. Unfortunately, the letter upsets Vernon Dursley because there are so many stamps on the envelope that the postman actually rang the doorbell to laugh about it. However, one mention of Sirius Black is enough to convince Vernon Dursley to let Harry go. Harry writes back to Ron confirming that they can come pick him up.\n\nOn Sunday afternoon, the Weasleys attempt to use Floo Powder to access the Dursley household, unaware that they have an electric fireplace. The Dursleys are shocked after Mr Weasley destroys half the sitting room. Harry exits for The Burrow as Uncle Vernon starts throwing china figurines at Mr Weasley.\n\nUpon arriving at The Burrow, Harry meets Ron's older brothers Bill and Charlie. Before they have a chance to talk, Mr Weasley arrives back home. Harry leaves the room and learns that Molly is upset about Weasleys' Wizard Wheezes, a business enterprise Ron's brothers Fred and George set up to sell their self-invented sweets and prank objects. Mrs Weasley forced them to stop, since she wanted them to have a more reputable career in the Ministry after graduation.\nAfter the spat, the Weasleys, Harry, and Hermione enjoy a lovely dinner in the garden. At the table a lot of topics are discussed: the upcoming Quidditch World Cup, Sirius Black's whereabouts (a private conversation by Harry, Ron, and Hermione), a missing Ministry Witch named Bertha Jorkins. Percy (who has joined the Ministry following his recent graduation) mentions a top-secret event that he is up to in the Ministry, which will take place after the Quidditch World Cup.",
  "Brief Summary": "Mrs. Weasley invites Harry to the Quidditch World Cup. The Weasleys botch their Floo Powder arrival, damaging the Dursleys’ home. At the Burrow, Harry learns of Molly’s disapproval of Fred and George’s prank business. They discuss the World Cup, Sirius, missing witch Bertha Jorkins, and Percy’s mysterious Ministry assignment.",
  "Location": [
    "Privet Drive",
    "The Burrow"
  ],
  "Characters Present": [
    "Fred",
    "George",
    "Molly",
    "Vernon"
  ],
  "Emotional State": [
    "happy",
    "excited"
  ],
  "Chronological Placement": 68,
  "Created By": "Me",
  "Importance": "Low"
}