{
  "memory_id": "Goblet of Fire 95",
  "template_used": "HP Memory Template",
  "Tags": [
    "duel with Voldemort",
    "deatheaters",
    "Imperius Curse",
    "Priori Incantatem"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Voldemort forces Wormtail to take out his bleeding arm to activate the Dark Mark and summon the Death Eaters. After his Death Eaters arrive, Voldemort spends time criticising them for failing to seek him out during these last thirteen years, even though they knew that he had found a way to escape mortal death. He believes they feared a power greater than his, like that of Albus Dumbledore, which is why they slipped back into normal wizarding society and claimed they were never loyal to Voldemort. Voldemort then rewards Wormtail for aiding with his rebirth by creating a new silver hand for him.\nVoldemort identifies more Death Eaters, including Lucius Malfoy, and announces his plans for rebuilding his army and punish the Death Eaters that have deserted him. Voldemort explains that now that they share the same blood, Voldemort is free to touch Harry. \n\nWith Wormtail's help, Voldemort was able to regain a body of his own and some of his powers and return to Britain. There, he plotted Harry's kidnapping, knowing that Harry's blood would remove his own mother's protection. Voldemort reveals that this servant who is at Hogwarts has ensured that Harry would win the tournament and be brought to the graveyard. Voldemort then frees the injured and weakened Harry and orders him to face him in a duel, wishing to prove who among the two is stronger in front of his minions. After Harry refuses to bow to the Dark Lord, Voldemort uses the Imperius Curse on Harry to force him to. Though Harry gives in the first time, the second time he manages to shake the curse off, much to the astonishment of the Death Eaters present.\nWhen the duel begins, something miraculous happens. Voldemort and Harry's wands are \"brothers\", due to the fact that their wands' cores are both feathers from the same phoenix. As the wands spells meet in the air and interlock, a Priori Incantatem effect occurs. This causes the spirit echoes of Voldemort's victims, including Harry's parents, to spill out from his wand. The echoes momentarily protect Harry, allowing him to grab the Portkey and escape to Hogwarts with Cedric's body.",
  "Brief Summary": "Voldemort summons his Death Eaters, rebukes them for abandoning him, and rewards Wormtail with a silver hand. He reveals his plan to use Harry’s blood to bypass Lily’s protection and forces Harry into a duel. Their wands connect, triggering Priori Incantatem. Spirit echoes shield Harry, letting him escape with Cedric’s body.",
  "Location": [
    "Little Hangleton"
  ],
  "Characters Present": [
    "Voldemort",
    "Pettigrew",
    "Lucius"
  ],
  "Emotional State": [
    "scared",
    "angry"
  ],
  "Chronological Placement": 95,
  "Created By": "Me",
  "Importance": "High"
}