{
  "memory_id": "Goblet of Fire 97",
  "template_used": "HP Memory Template",
  "Tags": [
    "sleeping potion",
    "Snape's Dark Mark",
    "Dementor's kiss"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Dumbledore takes Harry to his office to meet Sirius, but not before placing McGonagall in charge of Crouch Jnr. He also sends Snape to take Moody to the Hospital Wing and bring Cornelius Fudge up to Moody's office.\nOnce in Dumbledore's office, Harry tells Dumbledore and Sirius everything. Dumbledore explains the Priori Incantatem effect and says that the spirits that appeared were echoes of Voldemort's most recent victims. After Sirius transforms back into a dog they head to the Hospital Wing, where Harry is given a Sleeping Potion to help him relax.\nUpon waking up, he, along with Molly and Bill Weasley, hear a large argument. Fudge summoned a Dementor as protection when he went to confront Crouch Jnr, which sucked out Crouch Jnr's soul before he, McGonagall, Snape, and Dumbledore entered the Hospital Wing. Dumbledore is upset that they lost a key piece of evidence on Voldemort's return, while Fudge believes the man was a lunatic and that his testimony would not have been useful.\nDue to reading Rita Skeeter's last article about Harry being dangerous, Fudge does not accept Harry's testimony. Harry gets up and tries to identify the Death Eaters whose names he heard earlier, but Fudge points out they were cleared long ago. Even after Snape reveals his Dark Mark and explains that Voldemort had summoned him, Fudge thinks it is some kind of a ploy. He then exits the room, but not before he gives Harry his winnings from the Tournament.\nDumbledore has Sirius revert to his true form. Both Mrs Weasley and Snape are surprised by his presence, but are quickly convinced of his innocence. Dumbledore dispatches Sirius to reinstate the Order of the Phoenix by gathering known wizards and witches who would support their side. Harry then regrets asking Cedric to grab the Triwizard cup with him, and then uses the last of the potion to return to sleep.",
  "Brief Summary": "Dumbledore brings Harry to Sirius, and Harry recounts everything. Dumbledore explains Priori Incantatem. Later, Fudge has a Dementor kiss Crouch Jr., destroying vital evidence. He dismisses Harry’s testimony and ignores Snape’s Dark Mark. Dumbledore tasks Sirius with reforming the Order of the Phoenix. Harry falls asleep, grieving Cedric’s death.",
  "Location": [
    "Hogwarts",
    "Medical Wing"
  ],
  "Characters Present": [
    "Harry",
    "Dumbledore",
    "Fudge",
    "Snape"
  ],
  "Emotional State": [
    "grief",
    "guilt"
  ],
  "Chronological Placement": 97,
  "Created By": "Me",
  "Importance": "Medium"
}