{
  "memory_id": "Goblet of Fire 69",
  "template_used": "HP Memory Template",
  "Tags": [
    "Quidditch World Cup",
    "Ireland vs Bulgaria"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Harry, Hermione, and the Weasleys (excluding Bill, Charlie, and Percy, who would apparate later, and Mrs Weasley, who would not be attending) travel early the next morning to the site of the Quidditch World Cup Final via a Portkey, an enchanted object that can transport large groups of people across large distances in a short time. Mr Weasley explains that two hundred Portkeys have been placed around Britain to transport thousands of wizards and that they will be using the one at Stoatshead Hill. There they meet Cedric Diggory, captain of the Hufflepuff Quidditch team, and his father, Amos. Fred and George are not too keen to see Cedric due to his team beating Gryffindor last year, and Mr Diggory makes a big deal of it despite Cedric himself stating it was a fluke. They then gather around and use Portkey on Mr Weasley's signal, transporting to the Quidditch World Cup Final.\n\nAfter arriving and setting up their tents, Harry, Ron, and Hermione witness international members of the wizarding community. As the older Weasley children arrive and the group makes lunch, they meet Ludo Bagman, the match commentator and head of the Department of Magical Games and Sports and the man who got them their tickets. During their talk, against their father's wishes, Fred and George make a bet with Ludo: their entire life savings and a fake wand that Ireland will win, but the Bulgarian Seeker Viktor Krum will catch the Golden Snitch.\n\nPercy's boss, Barty Crouch, head of the Department of International Magical Co-operation then arrives looking for Bagman, though he has to shush Bagman when he starts to talk about a big event coming up at Hogwarts. Later that night, after getting some souvenirs, the group heads to the match.",
  "Brief Summary": "Harry, Hermione, and the Weasleys travel to the Quidditch World Cup via Portkey. At the campsite, they see witches and wizards from around the world. Fred and George bet their savings with Ludo Bagman on an unusual match outcome. That evening, the group heads to the stadium.",
  "Location": [
    "Campsite"
  ],
  "Characters Present": [
    "Harry",
    "Arthur",
    "Barty"
  ],
  "Emotional State": [
    "happy",
    "excited"
  ],
  "Chronological Placement": 69,
  "Created By": "Me",
  "Importance": "Low"
}