{
  "memory_id": "Goblet of Fire 92",
  "template_used": "HP Memory Template",
  "Tags": [
    "Cruciatus Curse",
    "Pensieve",
    "Neville's parents"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Harry is alone in Dumbledore's office. While looking around, notices Dumbledore's Pensieve, a device that stores memories. Through curiosity, Harry peers in and ends up looking into three of Dumbledore's memories. The first is the trial of Igor Karkaroff, in which he renounces his support of the Death Eaters and gives the names of existing Death Eaters, including Snape. Dumbledore (in the memory) states that Snape is a spy against Voldemort and is no longer a threat. The second memory shows the trial of Ludo Bagman. The third is a trial for the Lestrange family, a group of three, and Crouch's son, Barty Crouch Jnr, for the use of the Cruciatus Curse on Alice and Frank Longbottom. Crouch sentences them all to a lifetime in Azkaban. By then Dumbledore (from the present) arrives and brings Harry back.\nAfter Dumbledore explains what happened and shows Harry another of his memories regarding a teenage Bertha Jorkins during her Hogwarts years, Harry explains what happened in Divination. Dumbledore finds Harry's scar pains to be an odd concept and brings up that this is the second time it has hurt, the first being during the summer.\nDumbledore suspects that the reason why Harry's scar hurts is due to the connection that Voldemort's failed curse had created with him. He believes the scar would only hurt when Voldemort were close or was feeling a strong emotion. Dumbledore also explains to Harry that, unlike the Ministry, he believes that the disappearances of Bertha Jorkins, Barty Crouch, and a Muggle by the name of Frank Bryce may be connected to Voldemort.\nDumbledore also explains that Frank and Alice Longbottom are Neville's parents and they went insane due to the Lestranges' attack and that this is the reason why Neville was brought up by his grandmother and why he has such an aversion to the Cruciatus Curse.",
  "Brief Summary": "In Dumbledore’s office, Harry accidentally views Pensieve memories: trials of Karkaroff, Bagman, and the Lestranges—plus Barty Crouch Jr.—for torturing Neville’s parents. Dumbledore explains the scar pain may signal Harry’s link to Voldemort. He suspects the disappearances of Jorkins, Crouch, and Frank Bryce are all connected.",
  "Location": [
    "Hogwarts",
    "Headmasters office"
  ],
  "Characters Present": [
    "Dumbledore",
    "Harry",
    "Bertha"
  ],
  "Emotional State": [
    "curious"
  ],
  "Chronological Placement": 92,
  "Created By": "Me",
  "Importance": "Medium"
}