{
  "memory_id": "Goblet of Fire 84",
  "template_used": "HP Memory Template",
  "Tags": [
    "hagrid the half giant",
    "mean article"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Ron and Hermione decide to put last night's argument behind them. Hermione isn't too surprised when she learns that Hagrid is a half-giant, as she suspected this all along. Meanwhile, Harry is reluctant to take Cedric's advice to take the golden egg into the bath due to his jealousy about Cho.\n\nA substitute teacher, Professor Grubbly-Plank, teaches the first Care of Magical Creatures of the year. Draco Malfoy shows Harry that Rita Skeeter had published a nasty story about Hagrid and his giant heritage, this has apparently driven Hagrid into hiding. This raises some questions between the trio as to how she knew this.\nSeveral weeks pass and during another Hogsmeade visit, while hoping to find Hagrid at the Three Broomsticks Inn, the trio instead finds Ludo Bagman meeting with some goblins. During a private conversation with Mr Bagman, Harry learns that Barty Crouch has stopped coming to work and is sending Percy instructions by owl. Also, after a search, they still haven't found Bertha Jorkins. Bagman then again offers his help for the tournament, which Harry immediately declines. Hermione then questions why Mr Bagman is trying to help Harry cheat, along with why he was meeting with goblins. Rita Skeeter, then shows up to investigate. Harry and Hermione start an argument with her about her article on Hagrid.\nThe trio go to Hagrid's cabin and, along with Dumbledore, try to persuade him to return. They point out that not everyone has abandoned Hagrid, and that everyone has secrets in their pasts. After Dumbledore leaves, Hagrid remembers his late father telling him never to be ashamed of what he is and gets over his depression.",
  "Brief Summary": "Hagrid goes into hiding after Rita Skeeter exposes his giant heritage. Harry, jealous of Cedric, avoids solving the egg clue. In Hogsmeade, the trio spots Bagman with goblins and learns Crouch is missing. They later convince Hagrid to return, reminding him he’s not alone and should be proud of who he is.",
  "Location": [
    "Hogwarts",
    "Hagrid's Hut"
  ],
  "Characters Present": [
    "Hagrid",
    "Harry",
    "Dumbledore",
    "Bagman",
    "Rita"
  ],
  "Emotional State": [
    "jealous",
    "offended",
    "sympathetic"
  ],
  "Chronological Placement": 84,
  "Created By": "Me",
  "Importance": "Low"
}