{
  "memory_id": "Goblet of Fire 71",
  "template_used": "HP Memory Template",
  "Tags": [
    "Quidditch world cup",
    "death eaters",
    "the dark mark"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "The wizards around the campsite celebrate Ireland winning the Quidditch World Cup before going to sleep, that night, a group of masked wizards attack the camp and torment some local Muggles. While Mr Weasley heads out with his older children to face them, the rest of the group hides in the woods. When Ron trips on a tree branch, he, Harry, and Hermione, lose Fred, George, and Ginny. They run into Draco Malfoy, who goads them about the riot and tells them to keep Hermione, the \"mudblood\", safe. Shortly afterwards, Harry realises his wand is missing, and they find Winky behaving strangely, as if she were to trying to restrain something. After finding a place to hide, they hear someone nearby incant \"Morsmordre\", and they watch the Dark Mark float into the sky.\nThe Ministry is quickly at the scene, stunning anything that moves. After determining that Harry, Ron, and Hermione had nothing to do with the Dark Mark, they search nearby to find Winky holding Harry's wand. A quick spell proves that Harry's wand conjured the Dark Mark. Even though no one thinks Winky did it, Barty Crouch publicly fires her, leaving Hermione incensed.\n\nAfter the attack, Mr Weasley mentions that the Dark Mark is the sign that Voldemort's supporters leave whenever they murder someone. The group also learns that the hooded wizards were Death Eaters, followers of Voldemort. Bill mentions that the ones from tonight strangely fled the scene when the Dark Mark was cast in the sky, likely because they were afraid Voldemort would punish them for failing to stay loyal to him after his downfall. Mr Weasley then insists they go back to bed, since they would be leaving by Portkey in a few hours. Harry can't sleep due to taking this as a sign that Voldemort's making another plan to get his powers back.",
  "Brief Summary": "After the match, Death Eaters attack the campsite and torment Muggles. While hiding, Harry loses his wand, and the Dark Mark is cast. Winky is found with Harry’s wand and dismissed by Crouch, angering Hermione. Mr Weasley explains the Death Eaters’ history, and Harry fears Voldemort is regaining power.",
  "Location": [],
  "Characters Present": [
    "Harry",
    "Malfoy",
    "Winky"
  ],
  "Emotional State": [
    "happy",
    "surprised",
    "afraid"
  ],
  "Chronological Placement": 71,
  "Created By": "Me",
  "Importance": "High"
}