{
  "memory_id": "Goblet of Fire 81",
  "template_used": "HP Memory Template",
  "Tags": [
    "house elves",
    "elf",
    "slavery"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "After Ron is brought up to speed on what Harry has learned, he allows Harry to borrow Pigwidgeon to send Sirius a new letter updating him on the completion of the first task. Gryffindor celebrates Harry's success that night, but when Harry opens up his golden egg during the party, a horrible screech comes out. Meanwhile, Hermione learns from Fred Weasley how to get into the kitchen where the house-elves are.\n\nIn December, Rita Skeeter arrives at Hagrid's during a Care of Magical Creatures lesson with the fourth years to try to get an interview with Hagrid. Hagrid is surprised to see her there, as Dumbledore had banned her from Hogwarts Castle.\n\nThat night, Hermione does not show up to dinner. She surprises Harry and Ron as they are about to enter Gryffindor Tower and takes them to the kitchens. There they see a lot of domestic elves, and Harry is reunited with Dobby and learns that Winky is there too. Dobby reveals that it is difficult for a free house-elf to find actual work. After he spent two years failing to find work and found Winky, Dobby came to Hogwarts and had been there for a week so far; Dumbledore even agreed to pay Dobby a small wage. Winky is very sad and ashamed about being fired by her old master. Hermione tries to cheer her up, with no luck, though Winky does become slightly happier when she learns that Mr Crouch has been at Hogwarts.",
  "Brief Summary": "Harry sends Sirius an update after the first task. That night, his golden egg emits a terrible screech when opened. Hermione visits the kitchens with Harry and Ron, where they see Dobby working and meet the depressed Winky. Hermione tries to comfort her, learning Crouch has been at Hogwarts recently.",
  "Location": [
    "Hogwarts",
    "Kitchen"
  ],
  "Characters Present": [
    "Harry",
    "Ron",
    "Hermione",
    "Dobby",
    "Winky"
  ],
  "Emotional State": [
    "celebratory",
    "sympathetic"
  ],
  "Chronological Placement": 81,
  "Created By": "Me",
  "Importance": "Medium"
}