{
  "memory_id": "Goblet of Fire 79",
  "template_used": "HP Memory Template",
  "Tags": [
    "Triwizard Tournament",
    "dragons",
    "crush on Cho"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Harry's impending talk with Sirius helps him through his embarrassment about Rita Skeeter's news article, which told a highly inaccurate version of his life story. This further deepens the rift with Ron, who thinks Harry is trying to get attention. Ravenclaw Cho Chang is the only person outside of Gryffindor who wishes Harry good luck with the first task that is coming up on that Tuesday. Harry finds himself infatuated with her.\n\nHagrid asks Harry to meet him at midnight, one hour before his meeting with Sirius.\nThe Gamekeeper sneaks Harry into a meeting with Maxime; she does not know Harry, who is again hidden under his cloak, is there. Hagrid leads Maxime and Harry to a spot in the woods where dragons are being kept for the first task. Charlie Weasley and other dragon keepers are working to get the dragons ready for the First Task and keep them under control. Harry leaves for the castle.\nJust as Harry returns to his common room, Sirius contacts Harry via the Floo Network. Harry starts by filling him in on what has happened. Sirius then speaks and warns him that Karkaroff was once a Death Eater; he was released only after identifying other Death Eaters, and could have put Harry's name in the Goblet of Fire. Sirius brings up Bertha Jorkins. Jorkins, he says, disappeared in Albania, where Voldemort was last reported to be, and she could have easily fallen into a trap. She also would have known about the Triwizard Tournament beforehand.\n\nSirius finishes by stating that Karkaroff betrayed the Death Eaters long ago and might not be the guilty party. Before he can give Harry any advice on getting past his dragon, he is interrupted by Ron and disappears from the fire. Ron demands to know whom he was talking to but Harry tells him it's none of his business and goes to bed.",
  "Brief Summary": "Sirius’s planned talk helps Harry cope with Skeeter’s article and Ron’s continued anger. At Hagrid’s request, Harry secretly sees the dragons for the First Task. Later, Sirius contacts Harry, warning him about Karkaroff’s Death Eater past and Jorkins’ disappearance. Ron interrupts, ending the conversation before Sirius can give advice.",
  "Location": [
    "Hogwarts",
    "Gryffindor Common Room"
  ],
  "Characters Present": [
    "Harry",
    "Hagrid",
    "Sirius",
    "Ron",
    "Cho"
  ],
  "Emotional State": [
    "annoyed",
    "nervous"
  ],
  "Chronological Placement": 79,
  "Created By": "Me",
  "Importance": "Medium"
}