{
  "memory_id": "Goblet of Fire 72",
  "template_used": "HP Memory Template",
  "Tags": [
    "leaving for Hogwarts",
    "helping Mad-Eye"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "At The Burrow, a worried Mrs Weasley shows them the Daily Prophet article covering last night's attack, which is filled with some inaccurate details penned by Rita Skeeter, a journalist well known for her heavily negative stories. This forces Mr Weasley to head to the Ministry with Percy to straighten things out.\nHarry tells Ron and Hermione about his scar hurting, as well as his dream. The three remark on how strange it is that Harry's scar hurt so soon before the Dark Mark appeared for the first time in thirteen years. \nOn the final day before they are to return to Hogwarts, Harry hears that the Ministry of Magic has come under heavy fire for failing to stop the riot at the Quidditch World Cup or arrest any of the culprits. Mr Weasley mentions that Rita is also attacking the Ministry because of the disappearance of Bertha Jorkins. Meanwhile, Ron is dismayed by his hideous hand-me-down dress robes, which he will need to wear at Hogwarts for a formal occasion later in the year.\n\nThe next morning, Harry overhears a conversation between Mr Weasley and Amos Diggory (who is communicating through the Floo Network) about an ex-Auror named Alastor \"Mad-Eye\" Moody, who was attacked the previous night. Amos needs Mr Weasley's help in clearing things up before the situation gets worse. Charlie informs Harry that an Auror is basically an evil wizard catcher.\nAfter Mr Weasley leaves, the rest of the adults take the children to King's Cross Station. At the station, the kids say good-bye to Mrs Weasley, Bill, and Charlie, and the adults suggest that the year ahead would be an exciting one for all of the Hogwarts students.\nIn the Hogwarts Express, after chatting about other wizarding schools across Europe and the Quidditch World Cup, Draco Malfoy also speaks about the mysterious upcoming event, that Mrs Weasley, Charlie and Bill were talking about earlier and says that there's glory and money involved.",
  "Brief Summary": "At The Burrow, Rita Skeeter’s article spreads false claims. Harry shares his dream and scar pain with Ron and Hermione. Mr Weasley is called to help Mad-Eye Moody. At King’s Cross, the students leave for Hogwarts. On the train, Malfoy hints at a secret event involving fame and fortune.",
  "Location": [
    "The Burrow",
    "Hogwarts Express"
  ],
  "Characters Present": [
    "Rita",
    "Arthur",
    "Ron",
    "Hermione",
    "Molly"
  ],
  "Emotional State": [
    "curious"
  ],
  "Chronological Placement": 72,
  "Created By": "Me",
  "Importance": "Low"
}