{
  "memory_id": "Goblet of Fire 93",
  "template_used": "HP Memory Template",
  "Tags": [
    "training for Triwizard Tournament",
    "meeting the Weasleys",
    "mean article"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "As the third task approaches, Ron and Hermione find time when they are not studying for their final exams to help Harry. Even McGonagall helps by allowing him to practise in her empty classroom during lunchtime. During one practice session, Ron notices Malfoy outside the castle sitting by a tree and doing something odd. Harry and Hermione also see him before they return to practice. Sirius sends Harry messages by owl each day, reminding Harry to focus on what is ahead.\n\nOn the day of the third task, Rita Skeeter releases an article claiming Harry is demented and dangerous. She uses a quote from Draco Malfoy in the article. This raises some questions between the trio, since the article mentions Harry's scar hurting during Divination, and Skeeter is not allowed inside Hogwarts, so she shouldn't have had that information. Hermione finally figures out how Skeeter may be getting her information and leaves to put her theory to the test.\nMcGonagall tells the champions that their families have come to watch them complete. Harry doesn't want to meet them, expecting the Dursleys, but instead finds Molly and Bill Weasley. They mention to Harry that Percy will not be coming this time. After the Barty Crouch incident, which is being kept secret, Percy was hauled in for questioning regarding that the instructions he was receiving, which may not have actually been sent by Barty Crouch. Instead, Cornelius Fudge will be serving as the fifth Triwizard judge in his place.\nAfter the rest of the Weasley children and Hermione show up, Harry tells Mrs Weasley that everything Skeeter wrote on Hermione was a lie.",
  "Brief Summary": "As the third task nears, Ron, Hermione, and even McGonagall help Harry practise. A new Skeeter article claims Harry is unstable, using info she shouldn’t know. Hermione leaves to confirm her theory. On task day, Harry is relieved to see Molly and Bill instead of the Dursleys.",
  "Location": [
    "Hogwarts"
  ],
  "Characters Present": [
    "Molly",
    "Hermione",
    "Rita"
  ],
  "Emotional State": [
    "nervous",
    "angry",
    "happy"
  ],
  "Chronological Placement": 93,
  "Created By": "Me",
  "Importance": "Medium"
}