{
  "memory_id": "Goblet of Fire 90",
  "template_used": "HP Memory Template",
  "Tags": [
    "blackmail",
    "joke shop"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "The trio debate last night's events the following morning. Harry thinks the strange things Mr Crouch said were important, especially if Voldemort is getting stronger. The group go to the Owlery to send a letter to Sirius Black, and overhear Fred and George, who are talking about blackmailing someone that they've tried to reason with. Ron asks whom they are blackmailing, but they make it look like they are joking. After they leave, Ron points out that it is obvious Fred and George are serious about starting a Joke Shop. They are close to graduating, with only one full year left, and they have to make enough money on their own to start one. Hermione suggests telling Percy, but Ron refuses, both because of what Sirius said about Barty Crouch Snr and Percy's similarities to him. Later, they meet up with Moody. Moody reveals that he couldn't find him. He also tells them that there's nothing they can do about Crouch and that the Ministry is investigating the matter, and urges Harry to instead prepare for the final task.\nSirius's response arrives the following day: he scolds Harry for being out with Krum alone and late at night and says he is lucky he wasn't attacked, since it is clear to him that someone did not want Barty Crouch to reach Dumbledore, and he was probably feet away from them in the dark. He instructs Harry to stay safe and practise defensive spells for the Third Task, and demands that Harry give him his word that he won't go out of bounds again, especially not after hours. At Hermione's urging, he sends an owl back doing so.",
  "Brief Summary": "The trio discuss Crouch’s disappearance and send a letter to Sirius. They overhear Fred and George hinting at blackmail, likely to fund their future joke shop. Moody says Crouch can’t be found. Sirius replies, warning Harry not to wander at night again and urges him to train for the final task.",
  "Location": [
    "Hogwarts",
    "Great Hall"
  ],
  "Characters Present": [
    "Harry",
    "Rob",
    "Hermione",
    "Fred",
    "George"
  ],
  "Emotional State": [
    "uncertain"
  ],
  "Chronological Placement": 90,
  "Created By": "Me",
  "Importance": "Low"
}