{
  "memory_id": "Goblet of Fire 96",
  "template_used": "HP Memory Template",
  "Tags": [
    "polyjuice potion",
    "Imperius Curse",
    "Veritaserum"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "After Harry returns to Hogwarts with Cedric’s body, chaos erupts. While Dumbledore and Fudge tend to Cedric’s parents, a shaken Harry is taken away by “Moody,” who questions him about the graveyard. Harry suspects Karkaroff is Voldemort’s servant, but “Moody” reveals Karkaroff fled and wasn’t loyal. He then confesses he was behind Harry’s entry into the Triwizard Tournament and secretly helped him throughout each task—from tipping off Hagrid about the dragons, to arranging for Dobby to supply the gillyweed, to interfering in the third task by removing obstacles and disabling the other champions. His true goal was to get Harry to the graveyard.\n\nWhen he prepares to kill Harry, Dumbledore, Snape, and McGonagall intervene just in time. Dumbledore reveals this man isn’t the real Alastor Moody, whom he finds imprisoned in a trunk. The imposter had been using Polyjuice Potion all year and forgot his latest dose. When the potion wears off, he is revealed to be Barty Crouch Jr.\n\nUnder Veritaserum, Crouch Jr. confesses that he escaped Azkaban with help from his dying mother, who swapped places with him using Polyjuice Potion. His father kept him under the Imperius Curse until Bertha Jorkins stumbled upon the secret. Crouch Sr. erased her memory, causing lasting damage. Winky convinced Crouch Sr. to let his son attend the Quidditch World Cup under an Invisibility Cloak. There, Barty stole Harry’s wand and later used it to cast the Dark Mark.\n\nVoldemort, informed by Bertha, found and freed Barty Jr. They captured the real Moody, and Barty Jr. assumed his identity, using knowledge of Moody’s habits and behavior to deceive everyone. While impersonating Moody, Barty Jr. learned about the tasks, manipulated events, and turned the Triwizard Cup into a Portkey to send Harry to Voldemort.\n\nBarty Crouch Sr. eventually tried to warn Dumbledore but was intercepted and killed by his son, who transfigured the body and buried it in Hagrid’s yard. All of this had been part of Voldemort’s plan to return to power.",
  "Brief Summary": "After returning with Cedric’s body, Harry is taken by “Moody,” who reveals he rigged the Tournament to deliver Harry to Voldemort. Dumbledore intervenes just in time, exposing the imposter as Barty Crouch Jr. Under Veritaserum, Crouch confesses everything—his escape, impersonation, and role in Voldemort’s return.",
  "Location": [
    "Hogwarts"
  ],
  "Characters Present": [
    "Crouch Jr.",
    "Harry",
    "Dumbledore",
    "Moody"
  ],
  "Emotional State": [
    "confused",
    "distressed",
    "shock"
  ],
  "Chronological Placement": 96,
  "Created By": "Me",
  "Importance": "High"
}