{
  "memory_id": "Goblet of Fire 78",
  "template_used": "HP Memory Template",
  "Tags": [
    "Harry's interview",
    "wand weighing ceremony"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Hermione explains to Harry that his entry into the Triwizard Tournament strained his relationship with Ron, who feels once again left in the shadow of his friend. Harry reluctantly accepts Hermione's advice to send a letter to Sirius to update him on what happened. Ron is not alone in shunning Harry; a great many of the students from all three schools assume he somehow cheated his way into the tournament. This makes Harry's life miserable, even though his fellow Gryffindors (excluding Ron) are proud that Harry will be in the tournament.\n\nIn Potions, the Slytherin students wear “Potter Stinks” badges that cause an angry Harry to attempt to curse Malfoy. Goyle and Hermione end up cursed instead, and both head to the Hospital Wing. During a Potions lesson with Snape, Colin Creevey arrives to pick up Harry, as Mr Bagman requires him for a photo session. Rita Skeeter interviews Harry in a closet for a piece she is writing on the Triwizard Tournament, before the much important Wand weighing ceremony begins. Harry tells her he doesn't know how he entered the tournament, but she manages to twist his words before Dumbledore interrupts, stating the ceremony is about to begin.\n\nHere Harry sees the Wand Creator Mr Ollivander. After examining the other champion's wands, he examines Harry's and deems it in perfect condition. After the champions and judges go through a long photoshoot, Harry goes to dinner and then returns to Gryffindor Tower. Ron tells Harry that he has an owl and that their detention starts later. Going to where the school barn owl is with Sirius's letter, Harry reads that Sirius thinks it is too risky to communicate by letter and that he will contact Harry on 22 November at 1:00 a.m.",
  "Brief Summary": "Harry faces hostility from students and Ron over his tournament entry. After a failed curse on Malfoy, he’s pulled from Potions for photos and an interview with Rita Skeeter, who twists his words. At the Wand Weighing, Ollivander inspects the champions’ wands. Sirius replies, promising to contact Harry directly.",
  "Location": [
    "Hogwarts"
  ],
  "Characters Present": [
    "Harry",
    "Ron",
    "Hermione",
    "Ollivander",
    "Rita"
  ],
  "Emotional State": [
    "upset",
    "angry"
  ],
  "Chronological Placement": 78,
  "Created By": "Me",
  "Importance": "Low"
}