{
  "memory_id": "Goblet of Fire 75",
  "template_used": "HP Memory Template",
  "Tags": [
    "house elf rights",
    "unforgivable curses",
    "SPEW"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "In their first lesson with Moody on Thursday, Moody, after revealing he will only be staying for the year, decides to show the fourth-year Gryffindors the Unforgivable Curses. Despite some fear amongst the students (especially Neville, who needs comfort from both the trio and Moody after the lesson; Moody later lends Neville a Herbology book to cheer him up), Moody shows the entire class the three curses using spiders as his test subjects: the Imperius Curse, a mind-control spell, the Cruciatus Curse, a pain-inflicting spell, and the Killing Curse, a spell that causes instant death to any living thing it hits. He also reveals the the use of these spells gain the user a one-way ticket to Azkaban.\nLater that night after dinner in their Common Room, Harry and Ron fake their Divination homework after finding it too difficult. Harry notices Fred and George plotting something, though he is unable to figure out what. Later on, Hermione shows up and reveals that she has started SPEW, a club for fighting for house-elf rights and has just spent time in the library researching house-elf history. She wants Harry and Ron to join, but before the conversation is carried out further, Hedwig returns with a letter from Sirius.\nSirius says there are rumours about Harry's scar hurting and he is returning to Britain. Harry feels worried about Sirius coming back and possibly getting caught by the Ministry, all because he hastily sent the letter. He goes to bed unsettled.",
  "Brief Summary": "In Moody’s first lesson, he demonstrates the three Unforgivable Curses on spiders, upsetting Neville. That night, Harry and Ron fake Divination homework while Hermione launches S.P.E.W. Hedwig brings a letter from Sirius, who’s returning to Britain due to Harry’s scar pain, leaving Harry anxious he’s put Sirius at risk.",
  "Location": [
    "Hogwarts"
  ],
  "Characters Present": [
    "Ron",
    "Hermione",
    "Moody",
    "Neville"
  ],
  "Emotional State": [
    "curious",
    "disturbed",
    "outrage"
  ],
  "Chronological Placement": 75,
  "Created By": "Me",
  "Importance": "Medium"
}