{
  "memory_id": "Goblet of Fire 87",
  "template_used": "HP Memory Template",
  "Tags": [
    "stealing potions supplies",
    "love life gossip"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "In March, Sirius' reply states that the trio are to meet up with him during their next Hogsmeade trip and asks them to bring food. Before Potions, Slytherin Pansy Parkinson gleefully gives Hermione a copy of Witch Weekly; Rita had published an article on Hermione Granger, saying that she is toying with both Harry and Krum's feelings. Pansy, who is quoted in the article, suggested Hermione was making illegal Love Potions. Hermione realises that Skeeter must have eavesdropped on her and Krum's conversation on the shores of the lake, and begins wondering how Rita is getting her information. After Snape gets a hold of the article, he reads it aloud, creating further laughter from the Slytherins. He then breaks the trio up and sends them to different tables. Snape also confronts Harry over the recent theft of boomslang skin and gillyweed from his office, who has no idea what he's talking about. He threatens Harry with Veritaserum, a potion that will cause Harry to tell the truth when consumed. Karkaroff then shows up to talk to Snape and sticks around until after class. Snape blows him off, but not before Harry, who purposely stayed behind, noticed that Karkaroff had tried to show Snape something on his arm.",
  "Brief Summary": "Sirius arranges to meet the trio in Hogsmeade. Hermione is furious when Witch Weekly prints lies about her love life, she suspects Rita is magically eavesdropping. In Potions, Snape mocks the article and accuses Harry of stealing ingredients. After class, Karkaroff tries to show Snape something on his arm.",
  "Location": [
    "Hogwarts",
    "Potions Classroom"
  ],
  "Characters Present": [
    "Harry",
    "Hermione",
    "Snape",
    "Karkaroff",
    "Rita"
  ],
  "Emotional State": [
    "offended",
    "suspicious"
  ],
  "Chronological Placement": 87,
  "Created By": "Me",
  "Importance": "Medium"
}