{
  "memory_id": "Goblet of Fire 85",
  "template_used": "HP Memory Template",
  "Tags": [
    "golden egg",
    "investigation"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Harry sneaks into the Prefect's bathroom at night so he could have all the time he will need to figure out the clue, taking only the golden egg, his Invisibility Cloak, and the Marauder's Map with him. Harry initially has trouble figuring out how to open the egg properly, but with a little help from Moaning Myrtle, who had been spying on him, Harry opens the egg under water. This time, Harry hears voices singing and can understand them when he puts his head underwater. Harry realises that he must save something he cares about from merpeople who live in the depths of the Black Lake.\nOn the way back to Gryffindor tower, Harry sees Barty Crouch in Snape's office on the Marauder's Map and goes to investigate. When he falls through a trick stair and traps his leg, he accidentally drops the egg and map, attracting the attention of Filch. Filch finds the egg, and Snape soon arrives and demands Filch's help in catching someone who broke into his office. Moody then shows up, angering Snape by suggesting Snape had something to hide in his office. Moody then saves Harry from detection by claiming that the Marauder's Map is his own (after an invisible Harry warns him not to give it to Snape). Snape suspects Harry's involvement.\nAs Moody frees Harry's leg, Harry tells Moody about how the map works and that he saw Mr Crouch on it. After Moody spends time looking over the Marauder's Map, Harry asks what Crouch was doing in Snape's office, and Moody suggests that Crouch was trying to find evidence of Snape being a Dark wizard. Moody then asks to borrow the map, and after learning what Harry was up to that night, says that Harry might consider becoming an Auror for a career.",
  "Brief Summary": "Harry solves the egg clue in the Prefect’s bathroom with help from Moaning Myrtle: he must rescue something from merpeople. On his way back, he sees Crouch on the Marauder’s Map and investigates. Caught by Filch and Snape, Moody intervenes, covers for him, and asks to borrow the map.",
  "Location": [
    "Hogwarts",
    "Prefect Bathroom"
  ],
  "Characters Present": [
    "Harry",
    "Moody",
    "Myrtle",
    "Filch",
    "Snape"
  ],
  "Emotional State": [
    "confused",
    "nervous",
    "proud"
  ],
  "Chronological Placement": 85,
  "Created By": "Me",
  "Importance": "Medium"
}