{
  "memory_id": "Order of the Phoenix 102",
  "template_used": "HP Memory Template",
  "Tags": [
    "Voldemort's secret weapon",
    "Fudge's lies",
    "Order of the Phoenix"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "While they are setting up for dinner, Sirius reveals he has been confined in the house for a month since he is still a wanted criminal and that Voldemort and the Death Eaters would know he is an Animagus by now due to Wormtail informing them, which makes him almost useless to the Order. They then have dinner, and numerous conversations go around. After dinner, Sirius tries to tell Harry about the latest events and about their plans, but Molly keeps saying that Harry is too young and that Dumbledore told them not to tell Harry \"more than he needs to know\". After the two argue about it, Molly reluctantly allows Harry and everyone else but Ginny to stay and listen.\nHarry learns that Voldemort is keeping a low profile and is building an army. Though Harry managed to escape during Voldemort's rebirth, allowing Dumbledore to reactivate the Order of the Phoenix, it is difficult for them to convince as many people what has happened because of the Ministry and Fudge's position, since Fudge believes that Dumbledore is after his job. Another reason the Order is having trouble with finding allies is the issue of their credibility. Sirius is a wanted murderer, Lupin is a werewolf, and the members that work for the Ministry would lose their jobs since Fudge is willing to sack anyone just for disagreeing with him. Fudge has also been trying to discredit Dumbledore's reputation to prevent him from spreading the information, and is having the Daily Prophet cover up any news related to this. Sirius attempts to mention that Voldemort is trying to retrieve a \"weapon...something he didn't have last time\", before Molly and Lupin ask him to stop, and they then send the kids off to bed.",
  "Brief Summary": "Sirius, confined to Grimmauld Place, argues with Molly over telling Harry about Voldemort. Harry learns Voldemort is secretly building an army while the Ministry discredits Dumbledore and covers up the truth. Sirius hints Voldemort seeks a weapon he lacked before but is stopped from revealing more.",
  "Location": [
    "Grimmauld Place"
  ],
  "Characters Present": [
    "Harry",
    "Sirius",
    "Molly"
  ],
  "Emotional State": [
    "intrigued"
  ],
  "Chronological Placement": 102,
  "Created By": "Me",
  "Importance": "Medium"
}