{
  "memory_id": "Order of the Phoenix 104",
  "template_used": "HP Memory Template",
  "Tags": [
    "Harry's trial",
    "Wizengamot",
    "underage magic"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Harry heads down to breakfast and learns that Amelia Bones will be in charge of his hearing. Harry is nervous over the possibility of being expelled from Hogwarts, but Lupin assures Harry that underage wizards are allowed to use magic in life-threatening situations. Arthur Weasley then escorts Harry to the Ministry for his disciplinary hearing using the train in the London Underground. Just outside the courtroom, Mr Weasley stops, telling Harry that he must face the hearing alone.\n\nCornelius Fudge is acting as the head of the Wizengamot. After Dumbledore arrives, Fudge starts the trial without giving Harry a chance to defend himself. Once Harry gets the chance to explain about the Dementors, Fudge labels his statement a convenient lie, but Dumbledore is able to produce a reliable witness: Mrs Figg. Mrs Figg is able to describe the attack and confirms that the Dementors attacked Harry and Dudley.\nWhen Fudge points out the unlikelihood of Dementors in Little Whinging, Dumbledore suggests that someone within the Ministry ordered them there. Fudge refuses to accept any of this as evidence and while Dumbledore reminds him that magic can be used in these extraordinary circumstances. Fudge dismisses this, given Harry's past issues, reminding them of the fact that Harry inflated his aunt in the past, even though no charges were pressed.\nFudge also tries to bring up Harry's rule-breaking at Hogwarts, but Dumbledore reminds Fudge that the Ministry does not have the authority to punish students for what they do at school. He points out the irregularity of the hastiness for this trial and attempt to destroy Harry's wand without successfully proving these charges, and also the use of the full Wizengamot for a simple case of under-age magic. When the Wizengamot takes a vote, Harry is cleared of all charges with more than half of the Wizengamot raising their hands to clear him.",
  "Brief Summary": "At his Ministry hearing, Harry faces Fudge’s accusations of lying about Dementors. Dumbledore brings Mrs Figg as a witness, proving the attack happened. Fudge refuses to believe it but is overruled. Dumbledore points out irregularities in the trial, and the Wizengamot votes to clear Harry of all charges.",
  "Location": [
    "Ministry of Magic"
  ],
  "Characters Present": [
    "Harry",
    "Fudge",
    "Arthur",
    "Figg",
    "Dumbledore"
  ],
  "Emotional State": [
    "stressed",
    "worried",
    "relief"
  ],
  "Chronological Placement": 104,
  "Created By": "Me",
  "Importance": "High"
}