{
  "memory_id": "Order of the Phoenix 103",
  "template_used": "HP Memory Template",
  "Tags": [
    "Black family history",
    "mean house elf"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "After Harry and Ron head into their room, Fred and George Apparate inside, where the four briefly discuss their speculation on what Voldemort might be seeking before their mother's footsteps convince the twins they have to get back to their own room. While Molly is busy arguing with Mundungus Fletcher in another room, Harry meets Kreacher, the domestic-elf of the House of Black. He is always cursing and muttering bad words, on occasion calling Hermione a mudblood and then insulting Sirius for betraying his mother's trust after Sirius arrives before Kreacher heads to another room. Harry notices an old tapestry, that Sirius sarcastically explains is the family tree of the \"Noble and Most Ancient House of Black\". Sirius reveals that he was disowned by his family at the age of sixteen and lived with Harry's father James and his parents before his uncle, who was disowned as well, left Sirius some money to live on his own.\nSirius explains that his family was all for the purification of the wizarding race, getting rid of Muggle-borns and having pure-bloods in charge, and while not all of them were Death Eaters, they agreed with Voldemort's ideals. Sirius mentions that his brother was killed, presumably for attempting to abandon the Death Eaters. Harry is then surprised to learn that Sirius is related to the Malfoys through Lucius's wife Narcissa. He also learns that Tonks' mother Andromeda is Sirius's cousin, and that she was also disowned. Both she and Narcissa had a sister, Bellatrix, who was sent to Azkaban. She is the woman Harry saw in Dumbledore's Pensieve during Barty Crouch Jnr's trial.\nSirius then mentions his parents' home is only being used as the Order of the Phoenix's headquarters due to the protective enchantments his father put on it years ago and the additional security measures that Dumbledore set up.",
  "Brief Summary": "After discussing Voldemort’s possible goal, Harry meets Kreacher, the Black family’s foul-mouthed house-elf, who insults Hermione and Sirius before leaving. Sirius shows Harry the Black family tree, revealing his disownment at sixteen, his ties to the Malfoys, and explains the house is used as headquarters due to old and new enchantments.",
  "Location": [
    "12 Grimmauld Place"
  ],
  "Characters Present": [
    "Harry",
    "Sirius",
    "Kreacher"
  ],
  "Emotional State": [
    "intrigued"
  ],
  "Chronological Placement": 103,
  "Created By": "Me",
  "Importance": "Low"
}