{
  "memory_id": "Order of the Phoenix 100",
  "template_used": "HP Memory Template",
  "Tags": [
    "expelled from Hogwarts",
    "underage magic",
    "Howler for Petunia"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Mrs Figg explains to a surprised Harry she is actually a Squib, mentions she was sent by Dumbledore to watch over Harry and also kept his visits to her house boring so the Dursleys would not send Harry elsewhere if he were happy. After Mundungus Fletcher shows up, Mrs Figg scolds him for his foolish actions before sending him to inform Dumbledore of this situation so he can act quickly. Just before they part, Harry learns that Dumbledore has been keeping him under observation in order to protect him after what had happened with Voldemort last month. When Aunt Petunia and Uncle Vernon notice Dudley in his sickly state they fawn over him and Harry attempts to slip away, but Dudley speaks and assumes that Harry attacked him with some sort of spell since Muggles cannot see Dementors.\nBefore Harry can explain himself, the Ministry of Magic sends Harry a letter telling him that he's been expelled from Hogwarts for underage magic. Another letter from Arthur Weasley arrives telling Harry that Dumbledore is trying to sort this out and to stay put in his house, not surrender his wand, and not to perform any more magic. As Harry is explaining that the Dementors are responsible, Petunia surprisingly shows she has some knowledge of the Dementors. A second letter from the Ministry arrives stating that Dumbledore has convinced them to set up a hearing on 12 August to decide whether or not to break Harry's wand and Harry is being placed on suspension instead of being expelled.\nVernon is ready to throw Harry out, as he has always yearned to do so since receiving Harry, when Petunia receives a Howler. Before she has an opportunity to open the letter, it bursts into flames and a menacing voice says, \"Remember my last, Petunia\". Petunia then immediately convinces her husband to let Harry remain at Privet Drive.",
  "Brief Summary": "Mrs Figg reveals she’s a Squib sent by Dumbledore to watch Harry. After scolding Mundungus for leaving, she sends him to alert Dumbledore. The Ministry expels Harry for underage magic, but Dumbledore arranges a hearing instead. A Howler to Petunia prompts her to insist Harry stay at Privet Drive.",
  "Location": [
    "Privet Drive"
  ],
  "Characters Present": [
    "Figg",
    "Petunia",
    "Vernon",
    "Harry"
  ],
  "Emotional State": [
    "confused",
    "panicked"
  ],
  "Chronological Placement": 100,
  "Created By": "Me",
  "Importance": "Medium"
}