[
  {
    "memory_id": "Pizza!",
    "prompt_text": "[PERSPECTIVE: Second Hand]\nHarry goes out with Hermione and Ron to a Pizza Place that lets you pick any toppings you can image. Hermione and Ron are both horrified when Harry orders his with blue cheese and cockroaches. He indignantly defends his decision, saying that eating insects is far more humane than eating meat from intelligent animals, and how they are actually very clean insects. Ron hand Hermione then clarify that it is the blue cheese they find disgusting, not the cockroaches.\nPizza Place\n\ndisgust\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.",
    "search_text": "Second Hand\nHarry shares his favourite food preferences with his friends.\nPizza Place\n\ndisgust\n999",
    "tags": [
      "Pizza Place",
      "disgust"
    ],
    "importance": "Medium",
    "token_count": 194
  },
  {
    "memory_id": "TESTING",
    "prompt_text": "[PERSPECTIVE: Second Hand]\ntests\nhere\n\nannoyed",
    "search_text": "Second Hand\ntest2\nhere\n\nannoyed\n84",
    "tags": [
      "here",
      "annoyed"
    ],
    "importance": "Medium",
    "token_count": 18
  },
  {
    "memory_id": "Chamber of Secrets 26",
    "prompt_text": "[PERSPECTIVE: First Hand]\nHarry Potter is living with the Dursleys for the summer holiday in mid-1992, and things are very bad for him. The Dursleys have become so fearful of Harry's new-found magical abilities that they have locked away all of Harry's magical supplies. They have also banned Harry from saying words such as \"magic\" in the house. The Dursleys have let him keep his pet snowy owl Hedwig, but have put a lock on her cage to keep her inside day and night to avoid suspicion from the neighbours. Naturally, this does not go well for the bird. Every time she gets bored, her screech rings throughout the house, causing an irritated Vernon to warn Harry that if he cannot control her, she will have to go.\n\nOn July 31 (Harry's twelfth birthday), Harry has never felt so lonely, for he misses Hogwarts and his best friends there, Ron Weasley and Hermione Granger. Neither of them have written to him all summer, not even to send birthday wishes. The Dursleys seem to have also forgotten his birthday, as they are busy preparing for a dinner party for one of Uncle Vernon's clients, Mr Mason, from whom Vernon is hoping to get a huge order. The only thing that the Dursleys care about is that Harry has to stay in his room for the night, making no noise and \"pretending he doesn't exist\". Later, Dudley comes waddling over and starts mocking Harry for not receiving a party on his birthday, Harry gets annoyed and scares him away by pretending to think out loud of a spell. Unfortunately, Petunia comes out when Dudley calls for her and beats her nephew with a soapy frying pan. She then gives Harry some chores to do, and once he is finished, Harry goes up to his room without making a sound.\nPrivet Drive\nVernon, Dudley, Petunia\nlonely\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\nvernon also goes by the names vernon dursley, mr. dursley.\npetunia also goes by the names petunia dursley, mrs. dursley, ms. dursley.",
    "search_text": "First Hand\nHarry is spending the summer with the Dursleys, who lock up his magic supplies and ban him from speaking about magic. They have an important dinner planned, and send Harry to his room. Harry is sad he hasn't heard from Ron or Hermione since they parted ways at Hogwarts.\nPrivet Drive\nVernon, Dudley, Petunia\nlonely\n26",
    "tags": [
      "Privet Drive",
      "Vernon",
      "Dudley",
      "Petunia",
      "lonely"
    ],
    "importance": "Medium",
    "token_count": 568
  },
  {
    "memory_id": "Chamber of Secrets 27",
    "prompt_text": "[PERSPECTIVE: First Hand]\nAs Harry enters his bedroom he finds a strange creature on his bed, a house elf named Dobby, who tells Harry that he must not go back to Hogwarts, as it will be dangerous because terrible things are going to happen there. The elf, however, can't tell him what things, and continues to be vague because every time he gets close to letting something slip he starts hurting himself. In the process, he makes a lot of noise, which is noticed by the group downstairs. When he hears Uncle Vernon coming upstairs, Harry hides the elf in his closet right before Vernon comes in and scolds his nephew for making such a racket. Harry lets Dobby out as soon as his uncle leaves, and insists that he has to go back to Hogwarts since that's where he has friends despite them not writing to him. But to his surprise, Dobby then reveals that he has stopped letters being sent to Harry, and offers them to him if Harry will stay away from Hogwarts. Harry refuses and, making a frustrated Dobby run downstairs and use a Hover Charm to smash the dinner party's pudding.\nHarry is blamed for the incident once Dobby disappears. The evening is almost saved until an owl from the Ministry of Magic is promptly received (scaring away Mrs Mason, who is mortally afraid of birds) with a warning saying that Harry has violated the Decree for the Reasonable Restriction of Underage Sorcery, though he is not actually punished (possibly because it is only his first offence). After realising that Harry is not allowed to do magic outside of Hogwarts grounds, Uncle Vernon locks Harry in his room. Vernon reasons that if Harry uses magic to get himself out, he will be expelled anyway.\nPrivet Drive\nDobby, Vernon\ndefiant, upset, annoyed\n\n\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nvernon also goes by the names vernon dursley, mr. dursley.",
    "search_text": "First Hand\nDobby the house elf warns Harry not to return to Hogwarts, as it is very dangerous. Dobby reveals he's been intersepting letters from Hermione and Ron, and says he will give them to Harry if he agrees not to return to Hogwarts. When Harry refuses, Dobby gets him in trouble.\nPrivet Drive\nDobby, Vernon\ndefiant, upset, annoyed\n27",
    "tags": [
      "Privet Drive",
      "Dobby",
      "Vernon",
      "defiant",
      "upset",
      "annoyed"
    ],
    "importance": "Medium",
    "token_count": 464
  },
  {
    "memory_id": "Chamber of Secrets 28",
    "prompt_text": "[PERSPECTIVE: First Hand]\nThe Dursleys' punishment for Harry ruining the Dursley’s dinner lasts for three days, until Ron, Fred, and George Weasley, worried about not hearing from Harry all summer, borrow their father's flying Ford Anglia and come to the rescue. They break the metal bars off Harry's window and help him to pick the lock to his door so he can get his Nimbus 2000 and trunk. The Dursleys discover his escape attempt, but by the time they can intervene, Fred, George, Ron and Harry have got everything of Harry's and have flown away. On the flight to The Burrow, Harry explains Dobby's warning. They all agree that it is very fishy and speculate that Dobby most likely belongs to the Malfoys who sent Dobby to Harry as a joke, since the Malfoys are an old wizarding family of great wealth. Fred and George tell Harry that Lucius Malfoy formerly worked for Voldemort but claimed that the Dark Lord bewitched him after Voldemort lost his powers. Harry is taken to The Burrow, the Weasleys' home, and he finds the house truly amazing. Since Ron, Fred and George took the car without permission, they are yelled at by Molly Weasley, who was waiting in the kitchen. After their scolding, she makes them breakfast and has the three Weasley boys (and Harry who volunteered) de-gnome the garden, refusing to use a technique from Gilderoy Lockhart's Guide to Household Pests, and do it their own way. Arthur Weasley soon comes home and is honoured to meet Harry after they are introduced to each other. Molly, his wife, yells at him for enchanting the car. Ginny Weasley, who was enrolling at Hogwarts that year, is very obviously enamoured with Harry and spends most of her time hiding from him.\nPrivet Drive, The Burrow\nFred, George, Ginny, Ron\nexcited, happy\n\n\nvoldemort also goes by the names tom riddle, he-who-must-not-be-named, dark lord.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\nmolly also goes by the names molly weasley, mrs. weasley, ms. weasley.\nfred also goes by the names fred weasley.\ngeorge also goes by the names george weasley.\nginny also goes by the names ginny weasley.",
    "search_text": "First Hand\nThe Weasley's, concerned over not having heard from him in a long time, come to rescue Harry in a flying car. They take him back home, where he meets the rest of the members of the Weasley family, including Ginny, who is particularly shy.\nPrivet Drive, The Burrow\nFred, George, Ginny, Ron\nexcited, happy\n28",
    "tags": [
      "Privet Drive",
      "The Burrow",
      "Fred",
      "George",
      "Ginny",
      "Ron",
      "excited",
      "happy"
    ],
    "importance": "Medium",
    "token_count": 604
  },
  {
    "memory_id": "Chamber of Secrets 29",
    "prompt_text": "[PERSPECTIVE: First Hand]\nHarry stays at The Burrow until his departure for Hogwarts. The Weasleys make it clear that they all like Harry. During that period, he and the Weasleys travel to Diagon Alley with Floo Powder to get their school supplies. Harry has difficulty with the smoke around him and says \"Diagon Alley\" unclearly, and thus he accidentally lands in a shop in the ill-reputed Knockturn Alley instead. The shop is Borgin and Burkes, specialising in objects related to Dark magic. There he sees Lucius Malfoy, father of Draco Malfoy, selling items imbued with Dark magic to a dark arts salesman, Mr Borgin. Lucius Malfoy explains that the Ministry has been conducting raids on wizard houses to uncover illegal artefacts, so he is selling his more problematic possessions. He also expresses his disdain for a rumoured Muggle Protection Act, which he (rightly) assumes Arthur Weasley is behind.\n\nHarry leaves the shop and is found by Hagrid and taken back to Diagon Alley to reunite with the Weasleys and Hermione Granger, who is also there with her parents. In Flourish and Blotts, he and the Weasleys meet the famous wizard/author Gilderoy Lockhart, who announces that he will be taking over as Hogwarts's new Defence Against the Dark Arts teacher. He then forces Harry to have his picture taken with him for the front page of the Daily Prophet. They also meet Draco and Lucius Malfoy there. The elder Malfoy continuously taunts and insults Arthur and his family and eventually Arthur lunges at him. During the fight, Malfoy grabs one of the Weasleys' second-hand books and, after Hagrid breaks the fight up, throws the book back at Ginny in contempt.\nDiagon Alley, Knockturn Alley, Borgin and Burkes\nLucius, Arthur, Lockheart\nsuspicious, angry\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\nginny also goes by the names ginny weasley.",
    "search_text": "First Hand\nHarry accidently ends up in Borgin and Burkes, where he sees Lucius Malfoy selling illegal dark magic items. Harry meets Lockheart, who says he will be teaching at Hogwarts. Later, after Harry reunites with the Weasleys, Lucius insults the Weasleys, starting a fight with Arthur.\nDiagon Alley, Knockturn Alley, Borgin and Burkes\nLucius, Arthur, Lockheart\nsuspicious, angry\n29",
    "tags": [
      "Diagon Alley",
      "Knockturn Alley",
      "Borgin and Burkes",
      "Lucius",
      "Arthur",
      "Lockheart",
      "suspicious",
      "angry"
    ],
    "importance": "Medium",
    "token_count": 552
  },
  {
    "memory_id": "Chamber of Secrets 30",
    "prompt_text": "[PERSPECTIVE: First Hand]\nIt is time to return to Hogwarts, Harry and the Weasleys arrives at King's Cross Station on the Ford Anglia, after several delays (Fred and George forgetting their broomsticks, and Ginny forgetting her diary.) On the way to the Hogwarts Express, when Harry and Ron try to go through the barrier to Platform Nine and Three-Quarters after everyone else went through, the barrier is mysteriously sealed against them. Having missed the train, Harry and Ron thus decide to fly Mr Weasley's flying Ford Anglia to Hogwarts. They end up getting spotted by many Muggles and crash into the Whomping Willow, the impact breaking Ron's wand. The giant tree starts pounding the car. The battered car manages to escape, ejecting Harry, Ron, and their luggage, before quickly driving off into the Forbidden Forest.\n\nAfter they make it to the castle, Professor Snape catches the boys and attempts to have them expelled for being sighted and breaking wizard law to get to the castle. Albus Dumbledore, however, says he will send a letter to Harry and Ron's families. Still, Professor McGonagall gives a warning and separate detentions to both boys, and pointed out that they hadn't thought things through as they could have just sent a letter to Hogwarts with Hedwig. She also tells them that Ginny had been sorted into Gryffindor.\nPlatform Nine and Three Quarters, Hogwarts\nRon, Snape, McGonagall\ndistressed, afraid, disappointed\n\n\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\ndumbledore also goes by the names albus dumbledore, albus.\nfred also goes by the names fred weasley.\ngeorge also goes by the names george weasley.\nginny also goes by the names ginny weasley.",
    "search_text": "First Hand\nWhen Harry and Ron attempt to cross into platform nine and three quarters, they find they are blocked. In desperation they fly the flying car to Hogwarts, crashing into the Whomping Willow and getting in trouble.\nPlatform Nine and Three Quarters, Hogwarts\nRon, Snape, McGonagall\ndistressed, afraid, disappointed\n30",
    "tags": [
      "Platform Nine and Three Quarters",
      "Hogwarts",
      "Ron",
      "Snape",
      "McGonagall",
      "distressed",
      "afraid",
      "disappointed"
    ],
    "importance": "Medium",
    "token_count": 473
  },
  {
    "memory_id": "Chamber of Secrets 31",
    "prompt_text": "[PERSPECTIVE: First Hand]\nRon receives a Howler from his mother during breakfast in the Great Hall. Then, Minerva McGonagall hands out timetables and the first class is Herbology with the Hufflepuffs. In the class, Professor Sprout teaches how to transplant Mandrake seedlings, which have restorative properties when mature. When pulled from their pots, the Mandrakes let out a terrible screeching sound. The next class is Transfiguration, where Ron has problems with his broken wand, even when he repaired it with some Spellotape. \n\nLater, the trio have their first lesson with Gilderoy Lockhart, appointed as the new Defence Against the Dark Arts teacher. His way of teaching is a complete disaster. He releases a bunch of Cornish Pixies into the classroom, expecting the students to subdue them. When it is clear things aren’t going as planned, Lockhart slips out of the classroom, leaving his students to handle the chaos he unleashed on their own. \n\nMuch to Harry's chagrin, he receives constant attention from Lockhart and Colin Creevey, a first year student. Both constantly interact with him on the base of his fame (Colin treats Harry as a celebrity and Lockhart hopes to actually bring him to that state).\nHogwarts, Great Hall\nRon, McGonagall, Lockhart\nashamed, annoyed\n\n\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.",
    "search_text": "First Hand\nRon receives a Howler from his mother during breakfast in the Great Hall. In transfiguration class, Ron has problems with his broken wand. Later, Harry's first lesson with Gilderoy Lockhart in Defence Against the Dark Arts is a complete disaster.\nHogwarts, Great Hall\nRon, McGonagall, Lockhart\nashamed, annoyed\n31",
    "tags": [
      "Hogwarts",
      "Great Hall",
      "Ron",
      "McGonagall",
      "Lockhart",
      "ashamed",
      "annoyed"
    ],
    "importance": "Medium",
    "token_count": 372
  },
  {
    "memory_id": "Chamber of Secrets 32",
    "prompt_text": "[PERSPECTIVE: First Hand]\nThe Gryffindor Quidditch team has a very early practice on Saturday morning, where they are treated to an hour-long introduction to a new training programme Oliver Wood spent the summer working on. Soon after the actual practice starts, the Slytherin Quidditch team, with new Nimbus 2001 broomsticks, arrives, and an argument over field time ensues. During the confrontation, Malfoy is revealed to be the new Slytherin seeker, and the one responsible for getting the Slytherin team new brooms. Hermione says that nobody on the Gryffindor team had to buy their way in, they made it on pure talent. to which Malfoy calls Hermione a Mudblood, for which the Gryffindor team react angrily and Ron tries to curse him. However, his damaged wand causes the curse to backfire and he is rushed to Hagrid's cabin when he starts vomiting slugs. Ron and Hagrid both explain to Harry that Mudblood is a very insulting name for Muggle-Borns like Hermione. They also explain that there are some wizards like the Malfoys who think they are better than everyone else because they are Purebloods. After they return to the castle, Professor McGonagall assigns Harry and Ron their detentions. Harry is made to help Lockhart answer his fan mail, while Ron polishes the school's prizes and trophies. During his detention, Harry hears a disembodied sinister voice which Lockhart cannot hear.\nHogwarts, Quidditch Pitch\nHermione, Malfoy\noutrage, unease\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.",
    "search_text": "First Hand\nIt is revealed that Malfoy bought the entire Slytherin Quidditch team new brooms, and they made Malfoy their new seeker. Hermione says he bought his way onto the team, to which he responds by calling her a mudblood. Later, in detention, Harry hears sinister voices.\nHogwarts, Quidditch Pitch\nHermione, Malfoy\noutrage, unease\n32",
    "tags": [
      "Hogwarts",
      "Quidditch Pitch",
      "Hermione",
      "Malfoy",
      "outrage",
      "unease"
    ],
    "importance": "Medium",
    "token_count": 453
  },
  {
    "memory_id": "Chamber of Secrets 33",
    "prompt_text": "[PERSPECTIVE: First Hand]\nIn return for distracting Argus Filch just when he is about to give Harry severe punishment, Harry promises he will come to Nearly Headless Nick's Deathday Party on Halloween. He brings Ron and Hermione along as well. While there, they meet Moaning Myrtle. There are trays holding piles of rotting food, and no other living guests are present. The three of them quickly get sickened by the ghostly party and return to the Great Hall.\nHogwarts\nRon, Hermione\ndisturbed\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.",
    "search_text": "First Hand\nOn Halloween Harry, Ron, and Hermione attend Nearly Headless Nick's death day party, but are soon grossed out and leave.\nHogwarts\nRon, Hermione\ndisturbed\n33",
    "tags": [
      "Hogwarts",
      "Ron",
      "Hermione",
      "disturbed"
    ],
    "importance": "Medium",
    "token_count": 192
  },
  {
    "memory_id": "Chamber of Secrets 34",
    "prompt_text": "[PERSPECTIVE: First Hand]\nBefore they get to the Halloween feast, Harry hears the disembodied voice again (which Ron and Hermione cannot hear) and follows it to the second floor, where he finds  Mrs Norris, Filch's cat, hanging from a torch bracket, petrified and next to her, a threatening message is written on the wall, reading \"THE CHAMBER OF SECRETS HAS BEEN OPENED. ENEMIES OF THE HEIR, BEWARE\". Then, students leaving the Hallowe'en Feast surround them. And Malfoy yells: \"Enemies of the Heir, beware! You'll be next, Mudbloods!\"\n\nFilch and Snape try to get Harry in trouble for what happened, but Dumbledore says that it is powerful dark magic that no second year student could perform. They decide that Professor Sprout's mandrakes will be used, once they are mature enough, to create a draught that can revive Mrs Norris. Hermione wants to research the Chamber, so she persuades Professor Binns (the History of Magic teacher) into telling the class about it. He explains that one of the founders of Hogwarts, Salazar Slytherin, got into an argument with the others about whether Muggle-borns should be admitted. When the rift grew too large, he left the school. According to legend, as a going-away present to the school, he built a secret chamber that could only be opened by his true heir. This \"Chamber of Secrets\" contains a monster that only the Heir of Slytherin can control and that, once released, would purge the school of all Muggle-borns. Binns unsuccessfully tries to assure the class that the Chamber does not actually exist and that the school has been searched many times in vain.\nHogwarts\nRon, Hermione, Binns\ndisturbed, frightened\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\ndumbledore also goes by the names albus dumbledore, albus.",
    "search_text": "First Hand\nHarry hears a sinister disembodied voice, but Hermione and Ron don't hear it. The three discover Ms. Norris the cat, petrified, hanging next to a sinister message. Later, a teacher tells them the legend of the chamber of secrets, but insists it's just a legend.\nHogwarts\nRon, Hermione, Binns\ndisturbed, frightened\n34",
    "tags": [
      "Hogwarts",
      "Ron",
      "Hermione",
      "Binns",
      "disturbed",
      "frightened"
    ],
    "importance": "Medium",
    "token_count": 524
  },
  {
    "memory_id": "Chamber of Secrets 35",
    "prompt_text": "[PERSPECTIVE: First Hand]\nHarry, Ron and Hermione decide that Slytherin’s heir is probably Draco Malfoy, since he is a Pureblood supremacist, and because his father worked for Voldemort. To try to confirm it, Hermione proposes to use Polyjuice Potion, which can change a person into somebody else for an hour. After getting Lockhart's signature to check out the book Moste Potente Potions from the Restricted Section that has the recipe, Hermione warns them that the potion will take a month to brew, supposing they gather all the necessary ingredients. Since no one comes into Moaning Myrtle's bathroom, the three of them decide it is the best place to brew the potion unnoticed.\n\nDuring the month that it takes the Polyjuice Potion to brew, a Quidditch match between Gryffindor and Slytherin takes place. During the match, one of the Bludgers stakes after Harry and focuses completely on him, indicating the Bludger has been tampered with. Harry still manages to catch the Golden Snitch and allow for Gryffindor to win thanks to the Slytherin Seeker Draco Malfoy wasting his time insulting Harry and not paying attention. However, before Harry could catch the Snitch, the Bludger broke Harry's arm, and Lockhart, attempting to fix it, gets rid of all the bones in his arm instead. Madam Pomfrey gives Harry Skele-Gro potion to counter this and Harry is forced to stay in the Hospital Wing overnight.\n\nDuring that night, Dobby visits Harry and reveals that it was he who made the Bludger chase after Harry, and was also responsible for the barrier of Platform Nine and Three-Quarters not letting him in for in hopes of Harry leaving or never arriving at Hogwarts. He also reveals that the Chamber of Secrets has been opened before and immediately punishes himself, as he is not supposed to reveal anything. After Dobby disappears, Dumbledore, McGonagall, and Madam Pomfrey enter with Colin Creevey, who has been petrified.\nHogwarts, Hospital Wing\nHermione, Lockhart, Dobby\nsuspicion, anger\n\n\nvoldemort also goes by the names tom riddle, he-who-must-not-be-named, dark lord.\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\ndumbledore also goes by the names albus dumbledore, albus.",
    "search_text": "First Hand\nHarry, Ron, and Hermione believe Malfoy to be the heir of Slytherin, so they begin work on a polyjuice potion. A Bludger breaks Harry's arm during Quidditch, and Lockhart removes the bones in his arm. Dobby reveals he is responsible for the Bludger and Harry not being able to get on platform nine and three quarters.\nHogwarts, Hospital Wing\nHermione, Lockhart, Dobby\nsuspicion, anger\n35",
    "tags": [
      "Hogwarts",
      "Hospital Wing",
      "Hermione",
      "Lockhart",
      "Dobby",
      "suspicion",
      "anger"
    ],
    "importance": "Medium",
    "token_count": 630
  },
  {
    "memory_id": "Chamber of Secrets 36",
    "prompt_text": "[PERSPECTIVE: First Hand]\nHermione comes up with a plan of Harry and Ron providing a distraction in Potions so she can steal the remaining ingredients for the Polyjuice Potion from Snape's private stores. Shortly afterwards, when McGonagall comes around with the sign-up list for the students who will remain in the school during Christmas, learning that Malfoy, Crabbe, and Goyle have signed up, Harry, Ron, and Hermione do this as well, since this gives them the perfect opportunity to use their Polyjuice Potion. With Harry providing a distraction during Potions class by throwing a firework into Goyle's cauldron, it creates the necessary disturbance allowing Hermione to succeed without trouble. Harry later signs up for a Duelling Club which, to Harry's great displeasure, is taught by his two least favourite teachers, Lockhart and Snape. During a practice battle in the first meeting, Draco Malfoy conjures a snake to attack Harry. Lockhart tries to banish it, but all he manages is to set it loose on the students. Harry sees that the snake is advancing on a Hufflepuff student named Justin Finch-Fletchley and instinctively tells it to stop, which-to Harry's great surprise-it does. He expects Justin to be grateful, but all they saw was Harry speaking Parseltongue, the language of snakes, and since they cannot understand it, it seemed to them that he was egging the snake on. Harry learns that Parseltongue is a very rare gift that is closely associated with Salazar Slytherin. Due to this, Harry becomes the number one suspect among students for being the heir of Slytherin. Seconds after leaving Hagrid, Harry runs into a petrified Justin Finch-Fletchley and a black, also petrified, Nearly-Headless Nick. Peeves alerts the whole school, and a Hufflepuff student called Ernie Macmillan claims that Harry has been caught red-handed.\nHogwarts\nMalfoy, Hermione, Fletchley, Macmillan\nconfused, shocked\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.",
    "search_text": "First Hand\nHermione steals potion ingredients from Snape with help from Harry and Ron. Harry unknowingly reveals he speaks Parseltongue during a Dueling Club, alarming students. This, plus being found near two petrified victims, causes many to suspect he’s the Heir of Slytherin.\nHogwarts\nMalfoy, Hermione, Fletchley, Macmillan\nconfused, shocked\n36",
    "tags": [
      "Hogwarts",
      "Malfoy",
      "Hermione",
      "Fletchley",
      "Macmillan",
      "confused",
      "shocked"
    ],
    "importance": "Medium",
    "token_count": 546
  },
  {
    "memory_id": "Chamber of Secrets 37",
    "prompt_text": "[PERSPECTIVE: First Hand]\nFor the first time, Harry is taken to Dumbledore's office, and there he witnesses Fawkes—Dumbledore's phoenix—bursting into flames and then being reborn from the ashes. Dumbledore says that he does not believe Harry to be behind the attacks, a belief reinforced by Hagrid backing Harry's alibi, but a large portion of the school is now sure that Harry is Slytherin's heir. When Christmas arrives (Harry's gifts: a toothpick, fudge in a tin, a copy of Flying with the Cannons, a new quill, a jumper and plum cake), with the Polyjuice Potion ready and Hermione having acquired some spare Slytherin robes to use, they give to Crabbe and Goyle two chocolate cakes containing \"sleeping pills\" that made Crabbe and Goyle fall asleep after eating the cakes. Harry and Ron take their hairs (and shoes, because Crabbe and Goyle have larger feet) and assume their form. Hermione tries to use a hair she thought belongs to Millicent Bulstrode, but it is actually her cat's hair and Hermione is transformed into a cat/human hybrid. Hermione is forced to spend a few weeks in the Hospital Wing. As Crabbe and Goyle, once Draco leads them to the Slytherin common room, Harry and Ron interrogate an unsuspecting Malfoy and discover that even though he wishes he were, Draco is not the Heir of Slytherin. They also hear that Lucius Malfoy mentioned that the last time the chamber was opened, fifty years ago, a Muggle-born student died and whoever was responsible was expelled. Malfoy also mentions his father's secret stash of illegal artefacts.\nHogwarts, Slytherin Common Room\nRon, Hermione, Crabbe, Goyle, Malfoy\nshocked\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\ndumbledore also goes by the names albus dumbledore, albus.",
    "search_text": "First Hand\nHarry visits Dumbledore and meets Fawkes, the phoenix. At Christmas, the trio uses Polyjuice Potion to question Malfoy. Hermione’s dose goes wrong, turning her part-cat. Disguised as Crabbe and Goyle, Harry and Ron learn Malfoy isn’t the Heir, but hear clues about Lucius Malfoy’s secrets.\nHogwarts, Slytherin Common Room\nRon, Hermione, Crabbe, Goyle, Malfoy\nshocked\n37",
    "tags": [
      "Hogwarts",
      "Slytherin Common Room",
      "Ron",
      "Hermione",
      "Crabbe",
      "Goyle",
      "Malfoy",
      "shocked"
    ],
    "importance": "Medium",
    "token_count": 529
  },
  {
    "memory_id": "Chamber of Secrets 38",
    "prompt_text": "[PERSPECTIVE: First Hand]\nRon and Harry arrive at Moaning Myrtle's bathroom to find it flooded. Myrtle, a sulking ghost, explains that she had flooded it because somebody flushed a diary down the toilet and onto her. Harry picks it up; he discovers that it once belonged to somebody called T.M. Riddle, but the diary is completely blank. Ron remembers from his detention that Riddle had won an award for special service to the school fifty years before. Hermione deduces that since this coincides with the last time the Chamber was opened, Tom Riddle might have received his prize for catching whoever was responsible for the attacks back then. Even though all attempts to extract information from the diary fail, Harry feels a strange compulsion to keep it. On Valentine's Day, Ron and Harry are dismayed to find out Lockhart has spread dwarves dressed as cupids throughout the school to receive and deliver Valentines as a morale booster due to believing that he made the attacks stop. One cupid-dwarf manages to deliver one (a singing valentine from Ginny) to Harry. While struggling to avoid him, the embarrassed Harry trips and falls, having ink spilled all over the contents of his bag. Ginny notices the diary and assumes a horrified expression. Draco Malfoy also tries to steal the diary as Harry is picking up his stuff, but an angered Harry casts Expelliarmus on him, ignoring that Percy Weasley was also there trying to handle the situation, which results in Percy reprimanding Harry.\nHogwarts, Girls Bathroom\nMalfoy, Ginny\ncurious, angry, embarrassed\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\nginny also goes by the names ginny weasley.",
    "search_text": "First Hand\nHarry finds a blank diary belonging to T.M. Riddle, suspected to be linked to the last Chamber attacks. Despite no visible writing, Harry feels drawn to it. On Valentine’s Day, Ginny panics upon seeing the diary, and Harry casts a spell at Malfoy after he tries to steal it.\nHogwarts, Girls Bathroom\nMalfoy, Ginny\ncurious, angry, embarrassed\n38",
    "tags": [
      "Hogwarts",
      "Girls Bathroom",
      "Malfoy",
      "Ginny",
      "curious",
      "angry",
      "embarrassed"
    ],
    "importance": "Medium",
    "token_count": 457
  },
  {
    "memory_id": "Chamber of Secrets 39",
    "prompt_text": "[PERSPECTIVE: First Hand]\nHarry realises that even if ink is spilled all over the diary, it is not stained at all. He tries writing to the diary and, to his surprise, Riddle writes back. He explains that he was the one who caught the person who opened the Chamber of Secrets the last time, and he can show Harry what happened. Harry agrees and gets sucked into a \"recording\" of Riddle's memory. Transported back to 13 June 1943, he witnesses the school's previous headmaster, Armando Dippet, informing Riddle that the school will be closed, since now a Muggle-born girl has died. Riddle is apprehensive of this, since it would mean getting sent back to the Muggle orphanage he grew up in and grown to hate. Dippet guesses that Riddle is Muggle-born as well, but Riddle corrects him by revealing that he's actually half-blood, having been left at the orphanage after his witch mother died, but not before requesting her son's first name to be Tom, after his Muggle father, and his middle name to be Marvolo, after his wizard grandfather. When dismissed by Dippet and a 50-years-younger Dumbledore, Harry follows Riddle down into the dungeons, where Riddle catches a 50-years-younger Hagrid fiddling with a young Acromantula (giant spider) in a cupboard. Accusing the giant of harbouring the monster behind the death of the Muggle-born girl in question, Riddle reports Hagrid to Dippet, despite Hagrid protesting that that his Acromantula, who he has seemingly named Aragog, has never killed anyone. Having seen this, Harry now believes that Hagrid was the one who opened the Chamber fifty years before and he is responsible this time.\nHogwarts\nHagrid, Voldemort\nsurprised, intrigued\n\n\nvoldemort also goes by the names tom riddle, he-who-must-not-be-named, dark lord.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\ndumbledore also goes by the names albus dumbledore, albus.",
    "search_text": "First Hand\nHarry writes in the diary and is shown Tom Riddle’s memory from 1943. Riddle blames Hagrid for the Chamber attacks, claiming Hagrid kept a deadly spider named Aragog. Harry, convinced by the scene, now suspects Hagrid was behind both the past and current attacks.\nHogwarts\nHagrid, Voldemort\nsurprised, intrigued\n39",
    "tags": [
      "Hogwarts",
      "Hagrid",
      "Voldemort",
      "surprised",
      "intrigued"
    ],
    "importance": "Medium",
    "token_count": 528
  },
  {
    "memory_id": "Chamber of Secrets 40",
    "prompt_text": "[PERSPECTIVE: First Hand]\nHarry, Ron and Hermione hope that the mysterious petrification attacks have stopped-and indeed, almost four months after the attack on Justin and Nearly-Headless Nick, the disembodied voice keeps quiet and the attacks seem to have ceased. Harry returns to his dormitory one day to find it a mess, and Harry eventually notices that Tom Riddle's Diary is gone. This greatly befuddles him, knowing that only a Gryffindor student or a staff member could know the password to enter the dormitory. The next day, there is another attack and Harry hears the voice again. McGonagall calls for Harry and Ron personally, and leads them to the Hospital Wing, where they see Hermione petrified. She was found near the library with a Ravenclaw prefect, holding a small circular mirror. This proves that Harry is not the Heir of Slytherin, since he would never attack one of his friends. Harry and Ron decide they now must talk to Hagrid. They sneak out using Harry's invisibility cloak. When they reach Rubeus Hagrid's cabin Harry and Ron manage to hide just before Cornelius Fudge, who is the Minister for Magic, and Dumbledore arrive at the scene. Fudge announces that Hagrid, who he believes opened the Chamber of Secrets the last time, will be sent to Azkaban prison as a precaution. They are shortly joined by Lucius Malfoy, who declares that he and the other governors of Hogwarts have unanimously voted to suspend Dumbledore, despite the obvious logic that this would only worsen the situation. Both Hagrid and Dumbledore give last words to Harry and Ron: Hagrid says that if anybody wants the truth they should \"follow the spiders\" and Dumbledore says that he will only truly have left the school when none there remain loyal to him, and he will always be there for those who need help.\nHogwarts, Hagrid's Hut\nHermione, Hagrid, Lucius, Dumbledore\nconfused, suspicious, outraged\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\ndumbledore also goes by the names albus dumbledore, albus.",
    "search_text": "First Hand\nFour months pass without attacks until Hermione is found petrified, clutching a mirror. Riddle’s diary vanishes, and suspicion shifts. Harry and Ron visit Hagrid, but Fudge arrests him and Lucius has Dumbledore suspended. Before leaving, Hagrid cryptically says to “follow the spiders,”.\nHogwarts, Hagrid's Hut\nHermione, Hagrid, Lucius, Dumbledore\nconfused, suspicious, outraged\n40",
    "tags": [
      "Hogwarts",
      "Hagrid's Hut",
      "Hermione",
      "Hagrid",
      "Lucius",
      "Dumbledore",
      "confused",
      "suspicious",
      "outraged"
    ],
    "importance": "Medium",
    "token_count": 562
  },
  {
    "memory_id": "Chamber of Secrets 41",
    "prompt_text": "[PERSPECTIVE: First Hand]\nHarry and Ron decide to follow the spiders as per Hagrid's advice, walking with Fang as their guide along the trails of spiders, which are strangely all fleeing Hogwarts. This takes them into the Forbidden Forest. Even though Ron is deeply arachnophobic, Hermione having been petrified and that they may be able to help through this investigation gives him the willpower to go along anyway. The two boys follow the spiders deeper into the forest all the way into a webbed lair. There, they are met by a now adult but ageing Aragog, who reveals that Hagrid is innocent and explains his past from being given to Hagrid as an egg by a distant traveller to his accusation as the Chamber's resident monster until his transfer to the Forbidden Forest and his founding of his colony with Mosag. When Harry asks of the monster that killed the girl in 1943, Aragog remarks it is an ancient creature that all spiders as well as giant ones fear and that they never mention its name nor speak about it, even when Hagrid asked many times, and adds that the dead girl was found in a bathroom. Harry and Ron thank him and turn to leave, but Aragog halts them, deciding to leave them as dinner for his children. Mr Weasley's Ford Anglia comes blasting through the layers of spiders, however, and enables the boys and Fang to escape. After this, Harry and Ron feel that they have reached dead ends everywhere, until one possible last hope occurs to them. Recalling Aragog's remarks of the dead girl in the bathroom Harry suggests that Moaning Myrtle might have been that victim.\nHogwarts, Forbidden Forest\nRon\ntense, terrified\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.",
    "search_text": "First Hand\nHarry and Ron follow the spiders into the Forbidden Forest, where Aragog confirms Hagrid’s innocence and reveals the monster killed a girl in a bathroom. As his children attack, the boys escape thanks to the enchanted car. They realize the dead girl might be Moaning Myrtle.\nHogwarts, Forbidden Forest\nRon\ntense, terrified\n41",
    "tags": [
      "Hogwarts",
      "Forbidden Forest",
      "Ron",
      "tense",
      "terrified"
    ],
    "importance": "Medium",
    "token_count": 460
  },
  {
    "memory_id": "Chamber of Secrets 42",
    "prompt_text": "[PERSPECTIVE: First Hand]\nHarry and Ron manage to trick Lockhart - who is leading them to their next class - into letting them go by stroking his ego. Just as they pat themselves on the back, they get caught by Professor McGonagall, and Harry has to make up an excuse - they were going to see Hermione in the Hospital Wing, where visitors were now prohibited. They now have to go along to make their story appear convincing, but rather than simply hanging around Hermione's petrified form, this time Harry finds a piece of paper tightly clutched in her hand, which reveals what Hermione discovered before she was attacked. She had discovered, based on strong circumstantial evidence, that the monster in the Chamber of Secrets is a Basilisk, one of the giant \"Kings of all Serpents\", thus explaining the mysterious voice that only Harry could hear, since he could speak Parseltongue. The Basilisk kills people by looking them in the eye, but no one died since they only looked indirectly at its deadly gaze: Colin Creevey saw it through his camera, Justin Finch-Fletchley saw it through Nearly-Headless Nick (since he was already dead and could not die \"again\", he was only petrified), Mrs Norris saw a reflection of it in the water from the flooded bathroom, and Hermione and Penelope Clearwater both used a mirror to look around corners after Hermione has figured things out. Harry discovers in the paper that spiders flee from it and how a rooster's crowing is potentially fatal to the Basilisk (which explains Hagrid's roosters having been killed during the year). On the note is also scribbled a single word, \"pipes\", implying that the serpent manoeuvres through the plumbing (which helps them to realise that the entrance to the Chamber of Secrets is in Moaning Myrtle's bathroom).\nHogwarts\nRon, Hermione\n\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.",
    "search_text": "First Hand\nHarry and Ron trick Lockhart and visit Hermione, discovering a note in her hand revealing the monster is a Basilisk. It kills with direct eye contact, and travels through pipes. This explains the attacks’ odd details and points to the Chamber’s entrance being in Moaning Myrtle’s bathroom.\nHogwarts\nRon, Hermione\n\n42",
    "tags": [
      "Hogwarts",
      "Ron",
      "Hermione"
    ],
    "importance": "Medium",
    "token_count": 504
  },
  {
    "memory_id": "Chamber of Secrets 43",
    "prompt_text": "[PERSPECTIVE: First Hand]\nWhen Harry and Ron go to the staff room, they overhear the teachers talking about another attack having occurred. Harry and Ron decide to hide to hear more details and discover that Ginny has been kidnapped by the Basilisk, and the heir of Slytherin has left another message under the previous one: \"HER SKELETON WILL LIE IN THE CHAMBER FOREVER\". Harry and Ron also discover that Hogwarts will be closed tomorrow. The teachers then force Lockhart to deal with the monster, as he has been claiming he could handle whatever is behind the attacks. Looking very crestfallen, he leaves for his room. Harry and Ron decide that if Lockhart is going to deal with the monster they might as well tell him what they know. They go to his room, only to find him frantically planning to run away. When questioned on why such a talented wizard as himself is leaving, Lockhart admits that he is a fraud who put Memory Charms on the people who really did the things that he claimed to have done in his books. He then attempts to put a Memory Charm on the two boys as well, but they manage to disarm him and, under wand threats, take him to Moaning Myrtle's bathroom.\nHogwarts\nRon, Lockhart\nshocked, appalled\n\n\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\nginny also goes by the names ginny weasley.",
    "search_text": "First Hand\nHarry and Ron learn Ginny’s been taken to the Chamber and Hogwarts will close. The staff force Lockhart to act, but he plans to flee. He admits he’s a fraud who stole others’ achievements and tries to erase their memories. The boys disarm him and drag him to Myrtle’s bathroom.\nHogwarts\nRon, Lockhart\nshocked, appalled\n43",
    "tags": [
      "Hogwarts",
      "Ron",
      "Lockhart",
      "shocked",
      "appalled"
    ],
    "importance": "Medium",
    "token_count": 363
  },
  {
    "memory_id": "Chamber of Secrets 44",
    "prompt_text": "[PERSPECTIVE: First Hand]\nMoaning Myrtle explains her death, remarking the last thing she saw was a pair of enormous eyes by one of the sinks, whose tap has never worked. Harry finds a snake engraved on the tap and then opens the entrance to the Chamber of Secrets by speaking Parseltongue to it. Harry, Ron and Lockhart slide down a large pipe and find themselves in maze-like tunnels far below the school. Down there, they encounter a snakeskin left by the Basilisk. Just then, Lockhart feigns fainting and steals Ron's wand. Victoriously declaring that he will erase Harry and Ron's memories and tell everybody they lost their sanity at the sight of Ginny's mangled body, Lockhart casts the Memory Charm. However, Ron's broken wand causes the charm to backfire, erasing Lockhart's memory and causing a portion of the ceiling to cave in, trapping Harry in the direction of the chamber and Ron and Lockhart in the direction of the castle. Ron must then stay behind and clear a path through the rocks while Harry continues in search of Ginny. Harry then encounters a wall with stone snakes on it, opens it by speaking Parseltongue, and enters the Chamber.\nHogwarts\nRon, Lockhart, Myrtle\ndetermined, surprized, apprehensive\n\n\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\nginny also goes by the names ginny weasley.",
    "search_text": "First Hand\nMyrtle reveals she died seeing giant eyes by a sink, leading Harry to open the Chamber using Parseltongue. He, Ron, and Lockhart descend into the tunnels, where Lockhart tries to erase their memories, but backfires. Separated by debris, Harry ventures alone into the Chamber to find Ginny.\nHogwarts\nRon, Lockhart, Myrtle\ndetermined, surprized, apprehensive\n44",
    "tags": [
      "Hogwarts",
      "Ron",
      "Lockhart",
      "Myrtle",
      "determined",
      "surprized",
      "apprehensive"
    ],
    "importance": "Medium",
    "token_count": 380
  },
  {
    "memory_id": "Chamber of Secrets 45",
    "prompt_text": "[PERSPECTIVE: First Hand]\nHarry finds himself standing in the chamber of secrets. At the far end by the foot of Slytherin's statue, he finds Ginny lying on the ground, pale and cold. He drops his wand and runs to her. Tom Riddle approaches them, holding Harry's wand, and remarks that his presence in the present is because he is a memory, preserved in his own diary for 50 years. He then reveals what has happened: Riddle had opened the Chamber of Secrets fifty years earlier and intended to purge the school of Muggle-borns; however, when he discovered that the school was going to close down because of the attacks and that Dumbledore was keeping a closer watch on him, he was left to abandon the attacks and frame Hagrid for doing it. He left behind a diary containing the memory of his 16-year-old self in hopes that it would fall into the hands of an unsuspecting victim.\n\nThe diary ended up in Ginny's possession. Riddle had written back sympathetically, and Ginny grew to confess her fears. He gradually grew more powerful and eventually managed to pour some of his soul into her, possessing her and using to open the Chamber of Secrets, releasing the Basilisk. However, Ginny became suspicious of the diary and tried to dispose of it by flushing it down a toilet. This is when Harry found it, and when Ginny saw Harry with the diary on Valentine's Day, she panicked and worried that Riddle had told Harry about her role in the attacks, so she stole it from his dormitory. It began taking control of her again, with the intention of killing Harry. He had Ginny write her own farewell on the wall and come down to wait, luring Harry to his doom. Riddle remarks that \"Voldemort is his past, present and future.\" He then writes the air with Harry's wand his full name, TOM MARVOLO RIDDLE, then waves the wand and the letters form an anagram: I AM LORD VOLDEMORT.\nHogwarts, Chamber of Secrets\nVoldemort, Ginny\nconcerned, determined\n\n\nvoldemort also goes by the names tom riddle, he-who-must-not-be-named, dark lord.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\ndumbledore also goes by the names albus dumbledore, albus.\nginny also goes by the names ginny weasley.",
    "search_text": "First Hand\nIn the Chamber, Harry finds Ginny unconscious and meets Tom Riddle, who reveals he is a memory preserved in the diary. Riddle confesses to opening the Chamber 50 years ago, framing Hagrid, and possessing Ginny to do it again. He reveals his true identity: Tom Marvolo Riddle—Lord Voldemort.\nHogwarts, Chamber of Secrets\nVoldemort, Ginny\nconcerned, determined\n45",
    "tags": [
      "Hogwarts",
      "Chamber of Secrets",
      "Voldemort",
      "Ginny",
      "concerned",
      "determined"
    ],
    "importance": "Medium",
    "token_count": 578
  },
  {
    "memory_id": "Chamber of Secrets 46",
    "prompt_text": "[PERSPECTIVE: First Hand]\nRiddle remarks that he couldn't bear to use the name of a Muggle father who abandoned him when he found out that his wife was a witch. Instead he scrambled that name to create a new one which he knew people would fear when he became the \"greatest sorcerer in the world\". Harry remarks that he must be mistaken, because, as everybody knows, Albus Dumbledore is the greatest sorcerer in the world. Riddle replies that Dumbledore has been driven out the castle by the mere memory of him. Harry declares that Dumbledore is not as gone as Riddle seems to think. In this display of loyalty, he summons Fawkes the phoenix to him, who also brings with it the Sorting Hat, both assets that Riddle claims to be extremely useless.\n\nRiddle then summons the Basilisk and commands it to kill Harry. However, Fawkes is not defenceless, and pecks out the Basilisk's eyes, preventing its gaze from killing. The basilisk is still able to hear and smell Harry, however, and remains very dangerous, so Harry, in desperation, puts on the Sorting Hat, wishing against hope for help. Instead of an answer, a heavy sword with a hilt embedded with rubies falls on Harry's head from inside the hat. After several missed strikes from the blinded Basilisk, it strikes again, right at him this time, but Harry thrusts the sword into the roof of the Basilisk's mouth, killing it. However, one of its poisonous fangs falls into his arm, injecting a deadly poison. While Riddle gloats over his \"win\", Harry takes Riddle's diary and thrusts the Basilisk fang into the diary. Ink begins pouring out of the book like blood as Riddle is destroyed. Ginny instantly stirs and wakes up as Harry is now moments from death, when Fawkes cries on the wound, and since phoenix tears have healing powers, Harry is instantly cured. Harry and Ginny travel back through the Chamber to find Ron and Lockhart; Lockhart has no idea of who or where he is. They return to Moaning Myrtle's bathroom, and head to McGonagall's office.\nHogwarts, Chamber of Secrets\nVoldemort, Ginny\ndetermined, distressed, victorious\n\n\nvoldemort also goes by the names tom riddle, he-who-must-not-be-named, dark lord.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\ndumbledore also goes by the names albus dumbledore, albus.\nginny also goes by the names ginny weasley.",
    "search_text": "First Hand\nRiddle reveals he renamed himself Voldemort to reject his Muggle heritage. Fawkes and the Sorting Hat arrive to aid Harry. Riddle summons the Basilisk, but Fawkes blinds it. Harry receives Gryffindor’s sword from the hat and kills the beast, though he’s poisoned. He destroys the diary, saving Ginny, and Fawkes heals him.\nHogwarts, Chamber of Secrets\nVoldemort, Ginny\ndetermined, distressed, victorious\n46",
    "tags": [
      "Hogwarts",
      "Chamber of Secrets",
      "Voldemort",
      "Ginny",
      "determined",
      "distressed",
      "victorious"
    ],
    "importance": "Medium",
    "token_count": 643
  },
  {
    "memory_id": "Chamber of Secrets 47",
    "prompt_text": "[PERSPECTIVE: First Hand]\nAt McGonagall's office, Harry, Ron, and Ginny find Dumbledore, McGonagall, Arthur and Molly Weasley, who are delighted to see them alive. Harry worries that Ginny will get blamed for being the person behind the attacks, but to his great relief Dumbledore rightly deduces that Voldemort is the culprit and only used Ginny's body. Harry and Ron both receive two hundred house points each for Gryffindor and both get an Award for special services to the school, and then Dumbledore asks to speak with Harry alone. Dumbledore reveals that Voldemort transferred some of his powers to Harry when he gave him his scar, explaining his ability to speak Parseltongue.\n\nLucius Malfoy then barges into McGonagall's office, outraged that Dumbledore has returned to the school after being dismissed. Dumbledore calmly responds that the governors had asked him to return once they discovered that Arthur Weasley's daughter was attacked. Apparently, they had been blackmailed by Malfoy to vote for Dumbledore's dismissal in the first place under Malfoy's threat of cursing their families. Dobby follows Lucius into the room, thus showing that his masters are the Malfoys. Dumbledore and Malfoy have a calm but venomous interchange (respectively), during which Dumbledore and Harry(with the help of Dobby's unspoken hints) essentially expose Lucius for sneaking Riddle's diary (one of his illegal artefacts) into Ginny's school things during the fight with Arthur at Flourish and Blotts. Malfoy dares Dumbledore to prove his accusation.\n\nKnowing that a master can release his house-elf by giving them some clothes, Harry tricks Malfoy into freeing Dobby by giving Malfoy one of his own socks, which he promptly passes to Dobby as rubbish to get rid of him. Malfoy's retribution is thwarted by the now free Dobby, who then thanks Harry profusely and disappears.\nHogwarts\nDumbledore, Lucius, Dobby\nconcern, relief, satisfaction\n\n\nvoldemort also goes by the names tom riddle, he-who-must-not-be-named, dark lord.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\ndumbledore also goes by the names albus dumbledore, albus.\nmolly also goes by the names molly weasley, mrs. weasley, ms. weasley.\nginny also goes by the names ginny weasley.",
    "search_text": "First Hand\nDumbledore clears Ginny of blame, praising Harry and Ron with awards and house points. Dumbledore explains Voldemort transferred powers to Harry. Lucius Malfoy storms in, but is exposed for planting the diary. Harry tricks him into freeing Dobby, who stops Malfoy’s retaliation and gratefully thanks Harry.\nHogwarts\nDumbledore, Lucius, Dobby\nconcern, relief, satisfaction\n47",
    "tags": [
      "Hogwarts",
      "Dumbledore",
      "Lucius",
      "Dobby",
      "concern",
      "relief",
      "satisfaction"
    ],
    "importance": "Medium",
    "token_count": 645
  },
  {
    "memory_id": "Goblet of Fire 67",
    "prompt_text": "[PERSPECTIVE: First Hand]\nHarry has a dream, in which the Riddles' maid went to work and discovered all three Riddles dead in the drawing room. The police found no evidence of murder or suicide, claiming to be in perfect health except for the fact that they were dead. They arrested the Riddles' gardener Frank Bryce for questioning, since the door and windows were not forced open or shattered on the night of the murder, and the Riddles' cook testified that he was the only one with a key to the house. Frank, however, said the only person he saw that night was a mysterious dark-haired boy, and was released due to lack of evidence, but many still believed he committed the murders.\nHalf a century later on the night of 16 August, 1994, an elderly Frank is still working as the groundskeeper at the Riddle house. He sees a fire flickering in one of the rooms and goes over to investigate. Inside, he overhears the same boy he saw on the night of the Riddles' murder, now grown up as Lord Voldemort, and his servant Peter Pettigrew planning to capture Harry Potter with the aid of a reliable servant. Voldemort, Frank learns, captured Bertha Jorkins, a Ministry of Magic employee who Voldemort extracted information from before killing. Frank is then discovered by Voldemort's snake Nagini, who reports his presence to her master via Parseltongue. When Pettigrew beckons him in as a guest, Frank stands up to Voldemort, who is unhappy that Muggles like the elderly gardener would be spying on him. Frank doesn't know what a Muggle is, and Voldemort explains that term means he's not a wizard. Frank is still determined to inform the police about the intruders' plot. Voldemort casts the Avada Kedavra curse, ending Frank's life. Harry wakes up from the nightmare at the Dursleys' house in Privet Drive.\nPrivet Drive\nVoldemort, Pettigrew\nfrightened\n\n\nvoldemort also goes by the names tom riddle, he-who-must-not-be-named, dark lord.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\npettigrew also goes by the names peter, peter pettigrew, wormtail.",
    "search_text": "First Hand\nHarry dreams of Frank Bryce, a gardener once accused of the Riddle family’s mysterious deaths. Decades later, Frank overhears Voldemort and Wormtail plotting to capture Harry. Discovered and defiant, Frank is murdered by Voldemort. Harry wakes up at the Dursleys’, shaken by the nightmare.\nPrivet Drive\nVoldemort, Pettigrew\nfrightened\n67",
    "tags": [
      "Privet Drive",
      "Voldemort",
      "Pettigrew",
      "frightened"
    ],
    "importance": "Medium",
    "token_count": 554
  },
  {
    "memory_id": "Goblet of Fire 68",
    "prompt_text": "[PERSPECTIVE: First Hand]\nA letter from Molly Weasley addressed to the Dursleys arrives. She asks if Harry can join Hermione and the Weasley family to go to the Quidditch World Cup final between Ireland and Bulgaria. Unfortunately, the letter upsets Vernon Dursley because there are so many stamps on the envelope that the postman actually rang the doorbell to laugh about it. However, one mention of Sirius Black is enough to convince Vernon Dursley to let Harry go. Harry writes back to Ron confirming that they can come pick him up.\n\nOn Sunday afternoon, the Weasleys attempt to use Floo Powder to access the Dursley household, unaware that they have an electric fireplace. The Dursleys are shocked after Mr Weasley destroys half the sitting room. Harry exits for The Burrow as Uncle Vernon starts throwing china figurines at Mr Weasley.\n\nUpon arriving at The Burrow, Harry meets Ron's older brothers Bill and Charlie. Before they have a chance to talk, Mr Weasley arrives back home. Harry leaves the room and learns that Molly is upset about Weasleys' Wizard Wheezes, a business enterprise Ron's brothers Fred and George set up to sell their self-invented sweets and prank objects. Mrs Weasley forced them to stop, since she wanted them to have a more reputable career in the Ministry after graduation.\nAfter the spat, the Weasleys, Harry, and Hermione enjoy a lovely dinner in the garden. At the table a lot of topics are discussed: the upcoming Quidditch World Cup, Sirius Black's whereabouts (a private conversation by Harry, Ron, and Hermione), a missing Ministry Witch named Bertha Jorkins. Percy (who has joined the Ministry following his recent graduation) mentions a top-secret event that he is up to in the Ministry, which will take place after the Quidditch World Cup.\nPrivet Drive, The Burrow\nFred, George, Molly, Vernon\nhappy, excited\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\nmolly also goes by the names molly weasley, mrs. weasley, ms. weasley.\nfred also goes by the names fred weasley.\ngeorge also goes by the names george weasley.\nvernon also goes by the names vernon dursley, mr. dursley.\nsirius also goes by the names sirius black, padfoot, snuffles, stubby boardman.",
    "search_text": "First Hand\nMrs. Weasley invites Harry to the Quidditch World Cup. The Weasleys botch their Floo Powder arrival, damaging the Dursleys’ home. At the Burrow, Harry learns of Molly’s disapproval of Fred and George’s prank business. They discuss the World Cup, Sirius, missing witch Bertha Jorkins, and Percy’s mysterious Ministry assignment.\nPrivet Drive, The Burrow\nFred, George, Molly, Vernon\nhappy, excited\n68",
    "tags": [
      "Privet Drive",
      "The Burrow",
      "Fred",
      "George",
      "Molly",
      "Vernon",
      "happy",
      "excited"
    ],
    "importance": "Medium",
    "token_count": 629
  },
  {
    "memory_id": "Goblet of Fire 69",
    "prompt_text": "[PERSPECTIVE: First Hand]\nHarry, Hermione, and the Weasleys (excluding Bill, Charlie, and Percy, who would apparate later, and Mrs Weasley, who would not be attending) travel early the next morning to the site of the Quidditch World Cup Final via a Portkey, an enchanted object that can transport large groups of people across large distances in a short time. Mr Weasley explains that two hundred Portkeys have been placed around Britain to transport thousands of wizards and that they will be using the one at Stoatshead Hill. There they meet Cedric Diggory, captain of the Hufflepuff Quidditch team, and his father, Amos. Fred and George are not too keen to see Cedric due to his team beating Gryffindor last year, and Mr Diggory makes a big deal of it despite Cedric himself stating it was a fluke. They then gather around and use Portkey on Mr Weasley's signal, transporting to the Quidditch World Cup Final.\n\nAfter arriving and setting up their tents, Harry, Ron, and Hermione witness international members of the wizarding community. As the older Weasley children arrive and the group makes lunch, they meet Ludo Bagman, the match commentator and head of the Department of Magical Games and Sports and the man who got them their tickets. During their talk, against their father's wishes, Fred and George make a bet with Ludo: their entire life savings and a fake wand that Ireland will win, but the Bulgarian Seeker Viktor Krum will catch the Golden Snitch.\n\nPercy's boss, Barty Crouch, head of the Department of International Magical Co-operation then arrives looking for Bagman, though he has to shush Bagman when he starts to talk about a big event coming up at Hogwarts. Later that night, after getting some souvenirs, the group heads to the match.\nCampsite\nArthur, Barty\nhappy, excited\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\nfred also goes by the names fred weasley.\ngeorge also goes by the names george weasley.",
    "search_text": "First Hand\nHarry, Hermione, and the Weasleys travel to the Quidditch World Cup via Portkey. At the campsite, they see witches and wizards from around the world. Fred and George bet their savings with Ludo Bagman on an unusual match outcome. That evening, the group heads to the stadium.\nCampsite\nArthur, Barty\nhappy, excited\n69",
    "tags": [
      "Campsite",
      "Arthur",
      "Barty",
      "happy",
      "excited"
    ],
    "importance": "Medium",
    "token_count": 544
  },
  {
    "memory_id": "Goblet of Fire 70",
    "prompt_text": "[PERSPECTIVE: First Hand]\nWhile at the Top Box in the World Cup stadium, Harry meets Winky the house-elf, a friend of Dobby's, who is saving a seat for Mr Crouch (who never shows up). The Minister for Magic, Cornelius Fudge, as well as Lucius Malfoy with his wife and Draco (though both the Weasleys and Malfoys have to restrain themselves out of respect for Fudge), are also in the box. After Bagman introduces both teams' mascots, the match is intense and exciting, with amazing skill displayed on both sides, particularly from Krum. A fight breaks out between the two team's mascots after Ireland is awarded many penalty shots, which angers the Veela.\n\nIreland quickly gains a massive lead and wins the match, despite Krum catching the Golden Snitch. After the match, both teams head to the Top Box and Fudge awards Ireland the Quidditch World Cup, while Fred and George rejoice about winning their bet with Bagman.\n\nKrum, Fudge\nexcited, happy\n\n\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nfred also goes by the names fred weasley.\ngeorge also goes by the names george weasley.",
    "search_text": "First Hand\nIn the Top Box, Harry meets Winky the house-elf and sees Fudge, the Malfoys, and others. After an intense match, Ireland wins despite Krum catching the Snitch. A fight breaks out between team mascots, and Fudge presents Ireland the Cup. Fred and George celebrate winning their unusual bet with Bagman.\n\nKrum, Fudge\nexcited, happy\n70",
    "tags": [
      "Krum",
      "Fudge",
      "excited",
      "happy"
    ],
    "importance": "Medium",
    "token_count": 297
  },
  {
    "memory_id": "Goblet of Fire 71",
    "prompt_text": "[PERSPECTIVE: First Hand]\nThe wizards around the campsite celebrate Ireland winning the Quidditch World Cup before going to sleep, that night, a group of masked wizards attack the camp and torment some local Muggles. While Mr Weasley heads out with his older children to face them, the rest of the group hides in the woods. When Ron trips on a tree branch, he, Harry, and Hermione, lose Fred, George, and Ginny. They run into Draco Malfoy, who goads them about the riot and tells them to keep Hermione, the \"mudblood\", safe. Shortly afterwards, Harry realises his wand is missing, and they find Winky behaving strangely, as if she were to trying to restrain something. After finding a place to hide, they hear someone nearby incant \"Morsmordre\", and they watch the Dark Mark float into the sky.\nThe Ministry is quickly at the scene, stunning anything that moves. After determining that Harry, Ron, and Hermione had nothing to do with the Dark Mark, they search nearby to find Winky holding Harry's wand. A quick spell proves that Harry's wand conjured the Dark Mark. Even though no one thinks Winky did it, Barty Crouch publicly fires her, leaving Hermione incensed.\n\nAfter the attack, Mr Weasley mentions that the Dark Mark is the sign that Voldemort's supporters leave whenever they murder someone. The group also learns that the hooded wizards were Death Eaters, followers of Voldemort. Bill mentions that the ones from tonight strangely fled the scene when the Dark Mark was cast in the sky, likely because they were afraid Voldemort would punish them for failing to stay loyal to him after his downfall. Mr Weasley then insists they go back to bed, since they would be leaving by Portkey in a few hours. Harry can't sleep due to taking this as a sign that Voldemort's making another plan to get his powers back.\n\nMalfoy, Winky\nhappy, surprised, afraid\n\n\nvoldemort also goes by the names tom riddle, he-who-must-not-be-named, dark lord.\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\nfred also goes by the names fred weasley.\ngeorge also goes by the names george weasley.\nginny also goes by the names ginny weasley.",
    "search_text": "First Hand\nAfter the match, Death Eaters attack the campsite and torment Muggles. While hiding, Harry loses his wand, and the Dark Mark is cast. Winky is found with Harry’s wand and dismissed by Crouch, angering Hermione. Mr Weasley explains the Death Eaters’ history, and Harry fears Voldemort is regaining power.\n\nMalfoy, Winky\nhappy, surprised, afraid\n71",
    "tags": [
      "Malfoy",
      "Winky",
      "happy",
      "surprised",
      "afraid"
    ],
    "importance": "Medium",
    "token_count": 608
  },
  {
    "memory_id": "Goblet of Fire 72",
    "prompt_text": "[PERSPECTIVE: First Hand]\nAt The Burrow, a worried Mrs Weasley shows them the Daily Prophet article covering last night's attack, which is filled with some inaccurate details penned by Rita Skeeter, a journalist well known for her heavily negative stories. This forces Mr Weasley to head to the Ministry with Percy to straighten things out.\nHarry tells Ron and Hermione about his scar hurting, as well as his dream. The three remark on how strange it is that Harry's scar hurt so soon before the Dark Mark appeared for the first time in thirteen years. \nOn the final day before they are to return to Hogwarts, Harry hears that the Ministry of Magic has come under heavy fire for failing to stop the riot at the Quidditch World Cup or arrest any of the culprits. Mr Weasley mentions that Rita is also attacking the Ministry because of the disappearance of Bertha Jorkins. Meanwhile, Ron is dismayed by his hideous hand-me-down dress robes, which he will need to wear at Hogwarts for a formal occasion later in the year.\n\nThe next morning, Harry overhears a conversation between Mr Weasley and Amos Diggory (who is communicating through the Floo Network) about an ex-Auror named Alastor \"Mad-Eye\" Moody, who was attacked the previous night. Amos needs Mr Weasley's help in clearing things up before the situation gets worse. Charlie informs Harry that an Auror is basically an evil wizard catcher.\nAfter Mr Weasley leaves, the rest of the adults take the children to King's Cross Station. At the station, the kids say good-bye to Mrs Weasley, Bill, and Charlie, and the adults suggest that the year ahead would be an exciting one for all of the Hogwarts students.\nIn the Hogwarts Express, after chatting about other wizarding schools across Europe and the Quidditch World Cup, Draco Malfoy also speaks about the mysterious upcoming event, that Mrs Weasley, Charlie and Bill were talking about earlier and says that there's glory and money involved.\nThe Burrow, Hogwarts Express\nRita, Arthur, Ron, Hermione, Molly\ncurious\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\nmolly also goes by the names molly weasley, mrs. weasley, ms. weasley.",
    "search_text": "First Hand\nAt The Burrow, Rita Skeeter’s article spreads false claims. Harry shares his dream and scar pain with Ron and Hermione. Mr Weasley is called to help Mad-Eye Moody. At King’s Cross, the students leave for Hogwarts. On the train, Malfoy hints at a secret event involving fame and fortune.\nThe Burrow, Hogwarts Express\nRita, Arthur, Ron, Hermione, Molly\ncurious\n72",
    "tags": [
      "The Burrow",
      "Hogwarts Express",
      "Rita",
      "Arthur",
      "Ron",
      "Hermione",
      "Molly",
      "curious"
    ],
    "importance": "Medium",
    "token_count": 603
  },
  {
    "memory_id": "Goblet of Fire 73",
    "prompt_text": "[PERSPECTIVE: First Hand]\nAfter arriving at the castle the trio heads to the Gryffindor Table for the Sorting Ceremony. The Start-of-Term Feast then begins. After Nearly Headless Nick brings up the subject of Peeves causing problems in the kitchen, Hermione learns that house-elves work there. This makes her even more angry about the way house-elves are treated, especially since house-elves do not get any benefits (which the house-elves themselves do not want). She then refuses to eat any more food in protest.\n\nProfessor Dumbledore announces that instead of having Quidditch this year (which created lots of mayhem, especially from the Weasley twins), a very special event is going to take place at Hogwarts. Before he goes on, a mysterious man with a bizarre appearance appears in the Great Hall. Dumbledore identifies him as Mad-Eye Moody, the new Defence Against the Dark Arts teacher. Afterwards, Dumbledore states this event is the Triwizard Tournament, which will start at the end of October on Halloween. The Tournament calls for a single champion from each of the three largest wizarding schools in Europe to compete in a series of three trials for the prize of one thousand Galleons. Though it wasn't in play in the past due to the vast number of student deaths, Dumbledore reveals that both Crouch (Department of International Co-operation) and Bagman's (Department of Games and Sports) departments at the British Ministry of Magic have decided to reinstate the tournament under the condition that new safety rules are used, including that no student under the age of seventeen will submit their name for consideration. The students are then sent to bed, though Fred and George plot to find a way to bypass Dumbledore's safety measures so they can enter the tournament, to get fame and glory, as well as money.\nHogwarts, Great Hall\nDumbledore, Moody Ron, Hermione\ndisappointed, intrigued, excited\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nron also goes by the names ron weasley, ronald weasley.\ndumbledore also goes by the names albus dumbledore, albus.\nfred also goes by the names fred weasley.\ngeorge also goes by the names george weasley.",
    "search_text": "First Hand\nAt the feast, Hermione learns house-elves work in the kitchens and boycotts food in protest. Dumbledore announces Quidditch is canceled for the Triwizard Tournament. Mad-Eye Moody is introduced as the new Defence teacher. The tournament will include strict safety rules—only students over seventeen may enter. Fred and George plot to cheat.\nHogwarts, Great Hall\nDumbledore, Moody Ron, Hermione\ndisappointed, intrigued, excited\n73",
    "tags": [
      "Hogwarts",
      "Great Hall",
      "Dumbledore",
      "Moody Ron",
      "Hermione",
      "disappointed",
      "intrigued",
      "excited"
    ],
    "importance": "Medium",
    "token_count": 543
  },
  {
    "memory_id": "Goblet of Fire 74",
    "prompt_text": "[PERSPECTIVE: First Hand]\nOn the morning of their first day back, Harry, Ron, and Hermione prepare to begin the classes in their school schedule, though Harry is concerned about why Hedwig had not returned with a reply from Sirius. Hermione has also ended her hunger strike, deciding to stand up for house-elf rights in a different manner. First the Gryffindor fourth-years have lessons for Herbology, then Care of Magical Creatures, where Hagrid teaches about monstrous creatures known as Blast-Ended Skrewts. At dinner, Draco Malfoy insults Ron by showing Ron a Daily Prophet article that casts Ron's father Arthur Weasley in a bad light by Rita Skeeter, who somehow found out about the attack on Alastor Moody's home, even after the Ministry of Magic tried to keep it secret. While Harry and Hermione restrain an angry Ron, Draco makes some rude comments about Mrs Weasley. After Harry counters this by making a rude comment about Draco's mother and starts walking away, an angry Draco attempts to curse Harry from behind. Moody quickly intervenes, transfiguring Draco into a white ferret and bouncing him around until Professor McGonagall appears. After seeing what he's doing and putting two and two together, McGonagall undoes the spell. She then proceeds to tell Moody off by stating they never punish the students by hexing them. Moody defends his actions by explaining he thought a good sharp shock would be sufficient. Professor McGonagall tells him they punish the students by giving them detentions or speaking with the offender's Head of House. With that, Moody takes Draco Malfoy to see Professor Snape. \nAfter Hermione leaves to do some extracurricular work (even with no homework given out to her).\nHogwarts\nRon, Malfoy, Moody, Hagrid\nangry\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\nsirius also goes by the names sirius black, padfoot, snuffles, stubby boardman.",
    "search_text": "First Hand\nOn their first day back, Hermione ends her hunger strike. Hagrid introduces Blast-Ended Skrewts. Malfoy insults Ron with a Skeeter article, prompting a fight. Moody catches Malfoy trying to hex Harry and turns him into a ferret. McGonagall intervenes and scolds Moody for using magic as punishment.\nHogwarts\nRon, Malfoy, Moody, Hagrid\nangry\n74",
    "tags": [
      "Hogwarts",
      "Ron",
      "Malfoy",
      "Moody",
      "Hagrid",
      "angry"
    ],
    "importance": "Medium",
    "token_count": 536
  },
  {
    "memory_id": "Goblet of Fire 75",
    "prompt_text": "[PERSPECTIVE: First Hand]\nIn their first lesson with Moody on Thursday, Moody, after revealing he will only be staying for the year, decides to show the fourth-year Gryffindors the Unforgivable Curses. Despite some fear amongst the students (especially Neville, who needs comfort from both the trio and Moody after the lesson; Moody later lends Neville a Herbology book to cheer him up), Moody shows the entire class the three curses using spiders as his test subjects: the Imperius Curse, a mind-control spell, the Cruciatus Curse, a pain-inflicting spell, and the Killing Curse, a spell that causes instant death to any living thing it hits. He also reveals the the use of these spells gain the user a one-way ticket to Azkaban.\nLater that night after dinner in their Common Room, Harry and Ron fake their Divination homework after finding it too difficult. Harry notices Fred and George plotting something, though he is unable to figure out what. Later on, Hermione shows up and reveals that she has started SPEW, a club for fighting for house-elf rights and has just spent time in the library researching house-elf history. She wants Harry and Ron to join, but before the conversation is carried out further, Hedwig returns with a letter from Sirius.\nSirius says there are rumours about Harry's scar hurting and he is returning to Britain. Harry feels worried about Sirius coming back and possibly getting caught by the Ministry, all because he hastily sent the letter. He goes to bed unsettled.\nHogwarts\nRon, Hermione, Moody, Neville\ncurious, disturbed, outrage\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\nfred also goes by the names fred weasley.\ngeorge also goes by the names george weasley.\nsirius also goes by the names sirius black, padfoot, snuffles, stubby boardman.",
    "search_text": "First Hand\nIn Moody’s first lesson, he demonstrates the three Unforgivable Curses on spiders, upsetting Neville. That night, Harry and Ron fake Divination homework while Hermione launches S.P.E.W. Hedwig brings a letter from Sirius, who’s returning to Britain due to Harry’s scar pain, leaving Harry anxious he’s put Sirius at risk.\nHogwarts\nRon, Hermione, Moody, Neville\ncurious, disturbed, outrage\n75",
    "tags": [
      "Hogwarts",
      "Ron",
      "Hermione",
      "Moody",
      "Neville",
      "curious",
      "disturbed",
      "outrage"
    ],
    "importance": "Medium",
    "token_count": 506
  },
  {
    "memory_id": "Goblet of Fire 76",
    "prompt_text": "[PERSPECTIVE: First Hand]\nIn Defence Against the Dark Arts, Moody has his students practise resisting the Imperius Curse. Only Harry is able to resist it, despite slightly bruising his knees in the process; it takes him a couple more tries before he can completely resist it.\n\nFollowing Care of Magical Creatures, the group returns to the castle and sees a crowd of students looking at a sign posted to the wall. The sign reveals that in about a week, on 30 October, lessons will end early due to the delegations from the two other schools, the Beauxbatons Academy of Magic and the Durmstrang Institute, arriving that evening. The lesson cut off, for Gryffindors was Potions, and the Trio felt lucky, especially when Snape hinted of a poisoning, to find out if their antidotes work or not. Over the next week, Hogwarts Castle undergoes a major refit: the castle is redecorated and the nervous staff members prepare for the delegates to arrive.\nThe trio talk with the twins about the Triwizard Tournament, and Hermione brings up house-elves. Fred and George suggest she should visit the Hogwarts Kitchen just to see for herself how happy they are, despite Hermione's insistence that they are being brainwashed.\n\nThat night, each of the Houses are assembled in a line in the Great Hall while waiting for the delegates to arrive. The first comes by flying carriage, the second shortly afterwards via submerged ship, with their respective heads: Madame Maxime (Headmistress of Beauxbatons), a woman as big as Hagrid, and Igor Karkaroff (Headmaster of Durmstrang). Viktor Krum is revealed to be among the Durmstrang students, which makes Ron, a little excited.\nHogwarts, Great Hall\nRon, Hermione, Krum\nexcited, curious\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\nfred also goes by the names fred weasley.\ngeorge also goes by the names george weasley.",
    "search_text": "First Hand\nHarry practises resisting the Imperius Curse, succeeding after several tries. A notice announces that Beauxbatons and Durmstrang will arrive on October 30. Hogwarts prepares for their visit. Fred and George tease Hermione about house-elves. That evening, the schools arrive in dramatic fashion, with Krum among the Durmstrang students.\nHogwarts, Great Hall\nRon, Hermione, Krum\nexcited, curious\n76",
    "tags": [
      "Hogwarts",
      "Great Hall",
      "Ron",
      "Hermione",
      "Krum",
      "excited",
      "curious"
    ],
    "importance": "Medium",
    "token_count": 526
  },
  {
    "memory_id": "Goblet of Fire 77",
    "prompt_text": "[PERSPECTIVE: First Hand]\nAt the Welcoming Feast for Beauxbatons and Durmstrang. Hagrid, Ludo Bagman, and Barty Crouch all arrive late. After the feast, Dumbledore announces that the three champions will be chosen by the Goblet of Fire. Students must drop their names into the Goblet, and the Goblet chooses the most worthy entrants. Dumbledore finishes by stating the champions will be selected the following night during Halloween. The Goblet is placed in the Great Hall and an Age Line is drawn around the Goblet to prevent underage students from submitting their names.\nThe next day, Fred and George attempt to cross the line through the use of an Ageing Potion, but they are repelled by the line. The pair has to be sent to the Hospital Wing to have their long grey beards removed, much to everyone's amusement, while Dumbledore states that their beards are finer than those of the other students who tried to enter. That afternoon, Harry, Ron, and Hermione visit Hagrid at his cabin and find that he has gotten dressed up for Madame Maxime. He refuses Hermione's offer to join S.P.E.W., pointing out that the house-elves enjoy their work.\nThat night, during the Halloween feast, the champions are announced: Viktor Krum representing Durmstrang; Fleur Delacour, representing Beauxbatons; and Cedric Diggory of Hufflepuff representing Hogwarts. Unexpectedly, a fourth name is thrown from the Goblet of Fire: Harry Potter, much to the suprise of everyone and dismay of some.\n\nSince Harry neither submitted his name nor asked an older student to do so, the assembly is dumbfounded. Although protests issue from the heads of the other schools, it is decided that the Goblet of Fire has spoken and that changes must be made accordingly. While many think Harry has somehow circumvented Dumbledore's age-restricting barrier, Moody suggests that perhaps someone entered Harry's name under a fourth school to ensure he would be included in the competition, hoping he might not survive the perilous tasks.\nHogwarts, Great Hall\nDumbledore, Fleur, Cedric, Krum\nsurprise, confusion\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\ndumbledore also goes by the names albus dumbledore, albus.\nfred also goes by the names fred weasley.\ngeorge also goes by the names george weasley.",
    "search_text": "First Hand\nAt the Welcoming Feast, Dumbledore explains the Goblet of Fire will choose three champions. Fred and George fail to bypass the Age Line. On Halloween, the Goblet selects Krum, Fleur, and Cedric—then unexpectedly names Harry as a fourth champion. Moody suspects someone entered him under a false school.\nHogwarts, Great Hall\nDumbledore, Fleur, Cedric, Krum\nsurprise, confusion\n77",
    "tags": [
      "Hogwarts",
      "Great Hall",
      "Dumbledore",
      "Fleur",
      "Cedric",
      "Krum",
      "surprise",
      "confusion"
    ],
    "importance": "Medium",
    "token_count": 632
  },
  {
    "memory_id": "Goblet of Fire 78",
    "prompt_text": "[PERSPECTIVE: First Hand]\nHermione explains to Harry that his entry into the Triwizard Tournament strained his relationship with Ron, who feels once again left in the shadow of his friend. Harry reluctantly accepts Hermione's advice to send a letter to Sirius to update him on what happened. Ron is not alone in shunning Harry; a great many of the students from all three schools assume he somehow cheated his way into the tournament. This makes Harry's life miserable, even though his fellow Gryffindors (excluding Ron) are proud that Harry will be in the tournament.\n\nIn Potions, the Slytherin students wear “Potter Stinks” badges that cause an angry Harry to attempt to curse Malfoy. Goyle and Hermione end up cursed instead, and both head to the Hospital Wing. During a Potions lesson with Snape, Colin Creevey arrives to pick up Harry, as Mr Bagman requires him for a photo session. Rita Skeeter interviews Harry in a closet for a piece she is writing on the Triwizard Tournament, before the much important Wand weighing ceremony begins. Harry tells her he doesn't know how he entered the tournament, but she manages to twist his words before Dumbledore interrupts, stating the ceremony is about to begin.\n\nHere Harry sees the Wand Creator Mr Ollivander. After examining the other champion's wands, he examines Harry's and deems it in perfect condition. After the champions and judges go through a long photoshoot, Harry goes to dinner and then returns to Gryffindor Tower. Ron tells Harry that he has an owl and that their detention starts later. Going to where the school barn owl is with Sirius's letter, Harry reads that Sirius thinks it is too risky to communicate by letter and that he will contact Harry on 22 November at 1:00 a.m.\nHogwarts\nRon, Hermione, Ollivander, Rita\nupset, angry\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\ndumbledore also goes by the names albus dumbledore, albus.\nsirius also goes by the names sirius black, padfoot, snuffles, stubby boardman.",
    "search_text": "First Hand\nHarry faces hostility from students and Ron over his tournament entry. After a failed curse on Malfoy, he’s pulled from Potions for photos and an interview with Rita Skeeter, who twists his words. At the Wand Weighing, Ollivander inspects the champions’ wands. Sirius replies, promising to contact Harry directly.\nHogwarts\nRon, Hermione, Ollivander, Rita\nupset, angry\n78",
    "tags": [
      "Hogwarts",
      "Ron",
      "Hermione",
      "Ollivander",
      "Rita",
      "upset",
      "angry"
    ],
    "importance": "Medium",
    "token_count": 560
  },
  {
    "memory_id": "Goblet of Fire 79",
    "prompt_text": "[PERSPECTIVE: First Hand]\nHarry's impending talk with Sirius helps him through his embarrassment about Rita Skeeter's news article, which told a highly inaccurate version of his life story. This further deepens the rift with Ron, who thinks Harry is trying to get attention. Ravenclaw Cho Chang is the only person outside of Gryffindor who wishes Harry good luck with the first task that is coming up on that Tuesday. Harry finds himself infatuated with her.\n\nHagrid asks Harry to meet him at midnight, one hour before his meeting with Sirius.\nThe Gamekeeper sneaks Harry into a meeting with Maxime; she does not know Harry, who is again hidden under his cloak, is there. Hagrid leads Maxime and Harry to a spot in the woods where dragons are being kept for the first task. Charlie Weasley and other dragon keepers are working to get the dragons ready for the First Task and keep them under control. Harry leaves for the castle.\nJust as Harry returns to his common room, Sirius contacts Harry via the Floo Network. Harry starts by filling him in on what has happened. Sirius then speaks and warns him that Karkaroff was once a Death Eater; he was released only after identifying other Death Eaters, and could have put Harry's name in the Goblet of Fire. Sirius brings up Bertha Jorkins. Jorkins, he says, disappeared in Albania, where Voldemort was last reported to be, and she could have easily fallen into a trap. She also would have known about the Triwizard Tournament beforehand.\n\nSirius finishes by stating that Karkaroff betrayed the Death Eaters long ago and might not be the guilty party. Before he can give Harry any advice on getting past his dragon, he is interrupted by Ron and disappears from the fire. Ron demands to know whom he was talking to but Harry tells him it's none of his business and goes to bed.\nHogwarts, Gryffindor Common Room\nHagrid, Sirius, Ron, Cho\nannoyed, nervous\n\n\nvoldemort also goes by the names tom riddle, he-who-must-not-be-named, dark lord.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\nsirius also goes by the names sirius black, padfoot, snuffles, stubby boardman.",
    "search_text": "First Hand\nSirius’s planned talk helps Harry cope with Skeeter’s article and Ron’s continued anger. At Hagrid’s request, Harry secretly sees the dragons for the First Task. Later, Sirius contacts Harry, warning him about Karkaroff’s Death Eater past and Jorkins’ disappearance. Ron interrupts, ending the conversation before Sirius can give advice.\nHogwarts, Gryffindor Common Room\nHagrid, Sirius, Ron, Cho\nannoyed, nervous\n79",
    "tags": [
      "Hogwarts",
      "Gryffindor Common Room",
      "Hagrid",
      "Sirius",
      "Ron",
      "Cho",
      "annoyed",
      "nervous"
    ],
    "importance": "Medium",
    "token_count": 571
  },
  {
    "memory_id": "Goblet of Fire 80",
    "prompt_text": "[PERSPECTIVE: First Hand]\nAfter Harry tells Hermione everything he learned recently, they try to research ways to get past a dragon in the library without success. On Monday, realising the other schools' champions know about the dragons, Harry tips off Cedric to make sure the contest is fair. Moody then appears and gives Harry some general advice on how to beat his Dragon: play to his strengths and use a simple spell to get what he needs. With Hermione's help, Harry manages to master the Summoning Charm after working on it until 2 a.m. On Tuesday, the day of the task, Mr Bagman reveals that their task is to get the Golden egg each dragon is guarding. The model dragons each champion would draw out of a small bag would determine the order they'll be going in and which dragon they'll face.\nHarry finds himself slated to go last. He gets the most violent of the four dragons, the Hungarian Horntail. Once his turn comes up, Harry manages to summon his Firebolt and fly. He uses the flying strategies he learned as a Quidditch player to lure the dragon off the eggs long enough for him to zoom in and snatch the golden egg, despite taking a minor shoulder injury during the task. Ron, realising the true danger of the Tournament, and realising that Harry was telling the truth about not putting his name in the Goblet of Fire, tries to apologise to Harry feeling terrible about how he treated him. Harry forgives him and they become best friends again, with most of Hogwarts (excluding Slytherin) backing him as well.\nAfter seeing his score, Harry learns that he is currently tied with Viktor Krum for first place. Mr Bagman reveals to the champions that the Second Task will take place on 24 February at 9:30am and that their Golden Eggs contain a clue as to what it will be.\nHogwarts\nRon, Hermione, Cedric\nnervous, determined, victorious\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.",
    "search_text": "First Hand\nHarry tips off Cedric about the dragons, then trains with Hermione to master the Summoning Charm. Facing the Hungarian Horntail, Harry summons his Firebolt and retrieves the golden egg. Ron reconciles with Harry after seeing the danger firsthand. Harry ties with Krum, and the egg holds a clue for Task Two.\nHogwarts\nRon, Hermione, Cedric\nnervous, determined, victorious\n80",
    "tags": [
      "Hogwarts",
      "Ron",
      "Hermione",
      "Cedric",
      "nervous",
      "determined",
      "victorious"
    ],
    "importance": "Medium",
    "token_count": 517
  },
  {
    "memory_id": "Goblet of Fire 81",
    "prompt_text": "[PERSPECTIVE: First Hand]\nAfter Ron is brought up to speed on what Harry has learned, he allows Harry to borrow Pigwidgeon to send Sirius a new letter updating him on the completion of the first task. Gryffindor celebrates Harry's success that night, but when Harry opens up his golden egg during the party, a horrible screech comes out. Meanwhile, Hermione learns from Fred Weasley how to get into the kitchen where the house-elves are.\n\nIn December, Rita Skeeter arrives at Hagrid's during a Care of Magical Creatures lesson with the fourth years to try to get an interview with Hagrid. Hagrid is surprised to see her there, as Dumbledore had banned her from Hogwarts Castle.\n\nThat night, Hermione does not show up to dinner. She surprises Harry and Ron as they are about to enter Gryffindor Tower and takes them to the kitchens. There they see a lot of domestic elves, and Harry is reunited with Dobby and learns that Winky is there too. Dobby reveals that it is difficult for a free house-elf to find actual work. After he spent two years failing to find work and found Winky, Dobby came to Hogwarts and had been there for a week so far; Dumbledore even agreed to pay Dobby a small wage. Winky is very sad and ashamed about being fired by her old master. Hermione tries to cheer her up, with no luck, though Winky does become slightly happier when she learns that Mr Crouch has been at Hogwarts.\nHogwarts, Kitchen\nRon, Hermione, Dobby, Winky\ncelebratory, sympathetic\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\ndumbledore also goes by the names albus dumbledore, albus.\nfred also goes by the names fred weasley.\nsirius also goes by the names sirius black, padfoot, snuffles, stubby boardman.",
    "search_text": "First Hand\nHarry sends Sirius an update after the first task. That night, his golden egg emits a terrible screech when opened. Hermione visits the kitchens with Harry and Ron, where they see Dobby working and meet the depressed Winky. Hermione tries to comfort her, learning Crouch has been at Hogwarts recently.\nHogwarts, Kitchen\nRon, Hermione, Dobby, Winky\ncelebratory, sympathetic\n81",
    "tags": [
      "Hogwarts",
      "Kitchen",
      "Ron",
      "Hermione",
      "Dobby",
      "Winky",
      "celebratory",
      "sympathetic"
    ],
    "importance": "Medium",
    "token_count": 514
  },
  {
    "memory_id": "Goblet of Fire 82",
    "prompt_text": "[PERSPECTIVE: First Hand]\nAfter a Transfiguration class, McGonagall tells her students about the Yule Ball, a formal event that is scheduled for 25 December and is open to fourth years and above (though a younger student can still attend if invited by an older student as their date). She tells Harry privately that he and his dance partner will start off the event alongside the other champions and their dates as a traditional part of the Triwizard Tournament.\nOver the next few weeks, both Ron and Harry unsuccessfully attempt to find dates as they get through the final classes of the term. Fred and George are also acting suspiciously again; they want to borrow Pigwidgeon to deliver a letter to someone, but Pigwidgeon is not back yet (from delivering Sirius' letter). Harry later works up his courage and asks Cho to go to the dance with him, but learns that she had already agreed to go with Cedric. This information sours Harry's relationship with Cedric.\nAfter Harry returns to the Gryffindor common room, he sees Ginny comforting Ron and learns that Ron foolishly tried to ask Fleur out. Ron then tactlessly asks Hermione out. She is offended to be the last person he would ask, telling Ron she is going with someone else. Harry can't ask Ginny out either, since she is going with Neville. Finally, Harry manages to secure dates for both himself and Ron. Parvati for Harry, and Padma for Ron.\nHogwarts\nRon, Hermione, Parvati, Padma\nworried, nervous, rejected\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\nfred also goes by the names fred weasley.\ngeorge also goes by the names george weasley.\nginny also goes by the names ginny weasley.\nsirius also goes by the names sirius black, padfoot, snuffles, stubby boardman.",
    "search_text": "First Hand\nMcGonagall announces the Yule Ball and tells Harry he must open it with a partner. Harry and Ron struggle to find dates. Cho turns Harry down for Cedric, and Hermione rejects Ron, revealing she already has a date. Eventually, Harry asks Parvati, who finds a date—Padma—for Ron.\nHogwarts\nRon, Hermione, Parvati, Padma\nworried, nervous, rejected\n82",
    "tags": [
      "Hogwarts",
      "Ron",
      "Hermione",
      "Parvati",
      "Padma",
      "worried",
      "nervous",
      "rejected"
    ],
    "importance": "Medium",
    "token_count": 492
  },
  {
    "memory_id": "Goblet of Fire 83",
    "prompt_text": "[PERSPECTIVE: First Hand]\nAs the holidays begin, Hermione refuses to tell Ron who her date for the Yule Ball is, stating he'll make fun of her. Pigwidgeon returns with Sirius' reply. Sirius congratulates Harry for completing the first task and reminds him to stay on guard.\nOn Christmas Day, Dobby wakes Harry up and gives Harry his present: a pair of mismatched socks he made himself from wool he purchased with his wages. Harry then opens the presents he got from his other friends for Christmas, which include a hand-knit jumper with the image of a dragon from Mrs Weasley and a magical penknife from Sirius. Harry and his dorm mates get ready for the ball, then head to the Great Hall, where the event is to take place. At the start of the ball, it is revealed that Hermione is going with Viktor Krum.\nAfter the entire room has their meal, the Weird Sisters start their performance for the dance. Neither Harry nor Ron have any interest in dancing (though Harry does participate in the opening dance) and their dates, Pavarti and Padma, soon abandon them. Ron also gets into an embarrassing argument with Hermione; he claims that Viktor Krum is the enemy and that going to the ball with him is treason.\n\nHarry and Ron then decide to go for a walk on the grounds to get away from the ruckus. They encounter Hagrid and Maxime enjoying a tender moment. The moment is ruined when Hagrid insinuates Maxime is a Half-giant, like him. She is offended due to the nasty reputation giants have in the wizarding world. Shortly after the ball, Cedric gives Harry a hint about the egg: have a bath with it. He gives Harry the password to enter the Prefects' bathroom, and thanks him for warning him about the dragons.\nHogwarts, Great Hall\nRon, Hermione, Krum, Cedric, Padma, Pavarti\nhappy, nervous, surprised\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\nsirius also goes by the names sirius black, padfoot, snuffles, stubby boardman.",
    "search_text": "First Hand\nHermione refuses to reveal her Yule Ball date, who is later revealed to be Krum. On Christmas, Harry receives socks from Dobby and gifts from friends. At the Ball, Harry and Ron sulk while their dates leave them. Ron argues with Hermione over Krum. Cedric later gives Harry a clue about the egg.\nHogwarts, Great Hall\nRon, Hermione, Krum, Cedric, Padma, Pavarti\nhappy, nervous, surprised\n83",
    "tags": [
      "Hogwarts",
      "Great Hall",
      "Ron",
      "Hermione",
      "Krum",
      "Cedric",
      "Padma",
      "Pavarti",
      "happy",
      "nervous",
      "surprised"
    ],
    "importance": "Medium",
    "token_count": 545
  },
  {
    "memory_id": "Goblet of Fire 84",
    "prompt_text": "[PERSPECTIVE: First Hand]\nRon and Hermione decide to put last night's argument behind them. Hermione isn't too surprised when she learns that Hagrid is a half-giant, as she suspected this all along. Meanwhile, Harry is reluctant to take Cedric's advice to take the golden egg into the bath due to his jealousy about Cho.\n\nA substitute teacher, Professor Grubbly-Plank, teaches the first Care of Magical Creatures of the year. Draco Malfoy shows Harry that Rita Skeeter had published a nasty story about Hagrid and his giant heritage, this has apparently driven Hagrid into hiding. This raises some questions between the trio as to how she knew this.\nSeveral weeks pass and during another Hogsmeade visit, while hoping to find Hagrid at the Three Broomsticks Inn, the trio instead finds Ludo Bagman meeting with some goblins. During a private conversation with Mr Bagman, Harry learns that Barty Crouch has stopped coming to work and is sending Percy instructions by owl. Also, after a search, they still haven't found Bertha Jorkins. Bagman then again offers his help for the tournament, which Harry immediately declines. Hermione then questions why Mr Bagman is trying to help Harry cheat, along with why he was meeting with goblins. Rita Skeeter, then shows up to investigate. Harry and Hermione start an argument with her about her article on Hagrid.\nThe trio go to Hagrid's cabin and, along with Dumbledore, try to persuade him to return. They point out that not everyone has abandoned Hagrid, and that everyone has secrets in their pasts. After Dumbledore leaves, Hagrid remembers his late father telling him never to be ashamed of what he is and gets over his depression.\nHogwarts, Hagrid's Hut\nHagrid, Dumbledore, Bagman, Rita\njealous, offended, sympathetic\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\ndumbledore also goes by the names albus dumbledore, albus.",
    "search_text": "First Hand\nHagrid goes into hiding after Rita Skeeter exposes his giant heritage. Harry, jealous of Cedric, avoids solving the egg clue. In Hogsmeade, the trio spots Bagman with goblins and learns Crouch is missing. They later convince Hagrid to return, reminding him he’s not alone and should be proud of who he is.\nHogwarts, Hagrid's Hut\nHagrid, Dumbledore, Bagman, Rita\njealous, offended, sympathetic\n84",
    "tags": [
      "Hogwarts",
      "Hagrid's Hut",
      "Hagrid",
      "Dumbledore",
      "Bagman",
      "Rita",
      "jealous",
      "offended",
      "sympathetic"
    ],
    "importance": "Medium",
    "token_count": 539
  },
  {
    "memory_id": "Goblet of Fire 85",
    "prompt_text": "[PERSPECTIVE: First Hand]\nHarry sneaks into the Prefect's bathroom at night so he could have all the time he will need to figure out the clue, taking only the golden egg, his Invisibility Cloak, and the Marauder's Map with him. Harry initially has trouble figuring out how to open the egg properly, but with a little help from Moaning Myrtle, who had been spying on him, Harry opens the egg under water. This time, Harry hears voices singing and can understand them when he puts his head underwater. Harry realises that he must save something he cares about from merpeople who live in the depths of the Black Lake.\nOn the way back to Gryffindor tower, Harry sees Barty Crouch in Snape's office on the Marauder's Map and goes to investigate. When he falls through a trick stair and traps his leg, he accidentally drops the egg and map, attracting the attention of Filch. Filch finds the egg, and Snape soon arrives and demands Filch's help in catching someone who broke into his office. Moody then shows up, angering Snape by suggesting Snape had something to hide in his office. Moody then saves Harry from detection by claiming that the Marauder's Map is his own (after an invisible Harry warns him not to give it to Snape). Snape suspects Harry's involvement.\nAs Moody frees Harry's leg, Harry tells Moody about how the map works and that he saw Mr Crouch on it. After Moody spends time looking over the Marauder's Map, Harry asks what Crouch was doing in Snape's office, and Moody suggests that Crouch was trying to find evidence of Snape being a Dark wizard. Moody then asks to borrow the map, and after learning what Harry was up to that night, says that Harry might consider becoming an Auror for a career.\nHogwarts, Prefect Bathroom\nMoody, Myrtle, Filch, Snape\nconfused, nervous, proud\n\n\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.",
    "search_text": "First Hand\nHarry solves the egg clue in the Prefect’s bathroom with help from Moaning Myrtle: he must rescue something from merpeople. On his way back, he sees Crouch on the Marauder’s Map and investigates. Caught by Filch and Snape, Moody intervenes, covers for him, and asks to borrow the map.\nHogwarts, Prefect Bathroom\nMoody, Myrtle, Filch, Snape\nconfused, nervous, proud\n85",
    "tags": [
      "Hogwarts",
      "Prefect Bathroom",
      "Moody",
      "Myrtle",
      "Filch",
      "Snape",
      "confused",
      "nervous",
      "proud"
    ],
    "importance": "Medium",
    "token_count": 496
  },
  {
    "memory_id": "Goblet of Fire 86",
    "prompt_text": "[PERSPECTIVE: First Hand]\nHarry explains what happened the previous night to Ron and Hermione. Even though Harry and Ron suspect Snape might have put Harry's name in the Goblet of Fire, Hermione doubts this. Harry also sends a school owl to Sirius to update him on what happened.\nOver the coming weeks, even with help from Hermione and Ron as well as the library's resources, Harry struggles to think of a way to breathe underwater for an hour. Two days before the second task is to start, Sirius's response comes in. Sirius wants to know when their next trip to Hogsmeade is.\n\nThe next morning, with a little help from Dobby, Harry discovers gillyweed, a plant that, when eaten, gives him fish-like qualities such as gills and fins. He quickly makes his way to the lake just as the task is about to start and finds that, once again, Percy is taking Mr Crouch's place. While swimming through the lake and fighting off a swarm of Grindylows, Moaning Myrtle points Harry in the right direction and Harry discovers a town of Merpeople, where Ron (the thing Harry would miss the most) is being held, along with Hermione (for Krum), Cho (for Cedric), and Fleur's sister.\nHarry frees Ron, but refuses to leave the others, despite the insistence of the Merpeople. Cedric and Krum appear and rescue their loved ones, but Fleur never arrives. With little other choice, Harry drags her sister to the surface as well, narrowly avoiding drowning as the gillyweed wears off. Although he was wrong to think the other hostages would be left to die (they would have simply returned to the surface unharmed), his bravery and valour earn him extra points from the judges. This puts both Harry and Cedric in first place in the overall points.\nBlack Lake\nFleur, Dobby, Ron, Hermione\ndistressed, relieved\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\nsirius also goes by the names sirius black, padfoot, snuffles, stubby boardman.",
    "search_text": "First Hand\nHarry struggles to solve the second task until Dobby gives him gillyweed. In the lake, he rescues Ron and Fleur’s sister, refusing to leave her behind. Though misinformed about the task’s danger, his courage earns extra points, tying him with Cedric for first place. Sirius asks to meet in Hogsmeade.\nBlack Lake\nFleur, Dobby, Ron, Hermione\ndistressed, relieved\n86",
    "tags": [
      "Black Lake",
      "Fleur",
      "Dobby",
      "Ron",
      "Hermione",
      "distressed",
      "relieved"
    ],
    "importance": "Medium",
    "token_count": 539
  },
  {
    "memory_id": "Goblet of Fire 87",
    "prompt_text": "[PERSPECTIVE: First Hand]\nIn March, Sirius' reply states that the trio are to meet up with him during their next Hogsmeade trip and asks them to bring food. Before Potions, Slytherin Pansy Parkinson gleefully gives Hermione a copy of Witch Weekly; Rita had published an article on Hermione Granger, saying that she is toying with both Harry and Krum's feelings. Pansy, who is quoted in the article, suggested Hermione was making illegal Love Potions. Hermione realises that Skeeter must have eavesdropped on her and Krum's conversation on the shores of the lake, and begins wondering how Rita is getting her information. After Snape gets a hold of the article, he reads it aloud, creating further laughter from the Slytherins. He then breaks the trio up and sends them to different tables. Snape also confronts Harry over the recent theft of boomslang skin and gillyweed from his office, who has no idea what he's talking about. He threatens Harry with Veritaserum, a potion that will cause Harry to tell the truth when consumed. Karkaroff then shows up to talk to Snape and sticks around until after class. Snape blows him off, but not before Harry, who purposely stayed behind, noticed that Karkaroff had tried to show Snape something on his arm.\nHogwarts, Potions Classroom\nHermione, Snape, Karkaroff, Rita\noffended, suspicious\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\nsirius also goes by the names sirius black, padfoot, snuffles, stubby boardman.",
    "search_text": "First Hand\nSirius arranges to meet the trio in Hogsmeade. Hermione is furious when Witch Weekly prints lies about her love life, she suspects Rita is magically eavesdropping. In Potions, Snape mocks the article and accuses Harry of stealing ingredients. After class, Karkaroff tries to show Snape something on his arm.\nHogwarts, Potions Classroom\nHermione, Snape, Karkaroff, Rita\noffended, suspicious\n87",
    "tags": [
      "Hogwarts",
      "Potions Classroom",
      "Hermione",
      "Snape",
      "Karkaroff",
      "Rita",
      "offended",
      "suspicious"
    ],
    "importance": "Medium",
    "token_count": 437
  },
  {
    "memory_id": "Goblet of Fire 88",
    "prompt_text": "[PERSPECTIVE: First Hand]\nSirius meets Harry, Ron, and Hermione secretly in Hogsmeade and directs them to a mountain cave where Buckbeak and some old Daily Prophet articles are waiting. They first discuss Winky and what happened at the World Cup. Sirius suggests that whoever stole Harry's wand must have done so while they were watching the game in the Top Box, and is suspicious that Barty Crouch was looking around for something before he sacked Winky. He then finds it odd that not only did Crouch not show up during the game, but also that he is suddenly indisposed.\nSirius explains that Crouch was the one who sent him to Azkaban without a trial, as Crouch used to be the Head of the Department of Magical Law Enforcement and was once poised to become the next Minister for Magic. During Voldemort's previous reign, Crouch took extreme measures against the Death Eaters, including allowing the Aurors to use the Unforgivable Curses against them. While this greatly boosted Crouch's popularity and ensured that Crouch would become the next Minister, Crouch's son had been caught with a group of Death Eaters just after Voldemort's downfall. He was given a show trial by his father before being locked up in Azkaban; he died a year later.\nRon brings up Crouch's appearance in Snape's office. Sirius states that doesn't make sense. Sirius says it is questionable why Dumbledore would trust Snape. Snape was interested in the Dark Arts as a child and hung out with some Slytherin students that became Death Eaters.\n\nSirius then brings all the questions of these mysterious circumstances together, including why Moody was also searching Snape's office. He asks Ron to send a letter to Percy to find out if there is any news about Crouch. Sirius reminds them not to wander outside Hogwarts at all for safety reasons.\nHogseade\nRon, Hermione, Sirius, Barty\nsuspicious\n\n\nvoldemort also goes by the names tom riddle, he-who-must-not-be-named, dark lord.\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\ndumbledore also goes by the names albus dumbledore, albus.\nsirius also goes by the names sirius black, padfoot, snuffles, stubby boardman.",
    "search_text": "First Hand\nSirius meets the trio in a cave near Hogsmeade and shares suspicions about Crouch, Winky, and the stolen wand. He explains Crouch’s harsh past, including imprisoning his own son. Sirius questions Snape’s trustworthiness and asks Ron to write Percy for updates on Crouch, warning them to stay safe.\nHogseade\nRon, Hermione, Sirius, Barty\nsuspicious\n88",
    "tags": [
      "Hogseade",
      "Ron",
      "Hermione",
      "Sirius",
      "Barty",
      "suspicious"
    ],
    "importance": "Medium",
    "token_count": 613
  },
  {
    "memory_id": "Goblet of Fire 89",
    "prompt_text": "[PERSPECTIVE: First Hand]\nHate mail soon starts popping up for Hermione in regard to Rita Skeeter's article. She has to go to the Hospital Wing due to a letter containing bubotuber pus, causing painful boils, and doesn't turn up until a Care of Magical Creatures lesson, where Hagrid is having them use Nifflers to find gold coins he buried (which is actually Leprechaun gold, which disappears in a few hours). Hagrid encourages Hermione to ignore the hate mail, citing the hate mail he received after Skeeter released the article about him. Hermione decides to discover how Skeeter has been getting her information when she is already banned from school grounds.\nIt is around Easter that Percy's response comes, along with Easter eggs from Mrs Weasley (Hermione's is smaller than Harry and Ron's because Mrs Weasley read Skeeter's article). His irradiated response doesn't help. On the night of 24 May, Harry and the other champions are called to the Quidditch pitch by Ludo Bagman and informed that a magical maze will be grown there and filled with magical obstacles. Their job is to head to the centre of the maze and touch the Triwizard Cup. Before Mr Bagman can offer Harry advice again, Krum takes Harry aside to the Forbidden Forest and questions him about his relationship with Hermione. Harry assures Krum that he and Hermione are just friends.\nMoments later, a rather crazy-looking Barty Crouch emerges from the forest asking for Dumbledore. He mentions that Voldemort is getting stronger and that he himself was responsible for something bad. He also mentions his son, as well as Bertha Jorkins, who is now dead. Harry goes to retrieve Dumbledore, but when he returns, they find that Krum has been stunned and Crouch has disappeared. Dumbledore has Hagrid take Harry back to Gryffindor Tower to rest.\nHogwarts\nKrum, Hermione, Hagrid, Barty\nsurprised, upset\n\n\nvoldemort also goes by the names tom riddle, he-who-must-not-be-named, dark lord.\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\ndumbledore also goes by the names albus dumbledore, albus.",
    "search_text": "First Hand\nHermione receives hate mail over Skeeter’s article and ends up in the Hospital Wing. She vows to uncover how Skeeter gathers info while banned from school. In May, Crouch appears in the forest ranting about Voldemort. When Dumbledore returns, Crouch is gone and Krum is stunned.\nHogwarts\nKrum, Hermione, Hagrid, Barty\nsurprised, upset\n89",
    "tags": [
      "Hogwarts",
      "Krum",
      "Hermione",
      "Hagrid",
      "Barty",
      "surprised",
      "upset"
    ],
    "importance": "Medium",
    "token_count": 588
  },
  {
    "memory_id": "Goblet of Fire 90",
    "prompt_text": "[PERSPECTIVE: First Hand]\nThe trio debate last night's events the following morning. Harry thinks the strange things Mr Crouch said were important, especially if Voldemort is getting stronger. The group go to the Owlery to send a letter to Sirius Black, and overhear Fred and George, who are talking about blackmailing someone that they've tried to reason with. Ron asks whom they are blackmailing, but they make it look like they are joking. After they leave, Ron points out that it is obvious Fred and George are serious about starting a Joke Shop. They are close to graduating, with only one full year left, and they have to make enough money on their own to start one. Hermione suggests telling Percy, but Ron refuses, both because of what Sirius said about Barty Crouch Snr and Percy's similarities to him. Later, they meet up with Moody. Moody reveals that he couldn't find him. He also tells them that there's nothing they can do about Crouch and that the Ministry is investigating the matter, and urges Harry to instead prepare for the final task.\nSirius's response arrives the following day: he scolds Harry for being out with Krum alone and late at night and says he is lucky he wasn't attacked, since it is clear to him that someone did not want Barty Crouch to reach Dumbledore, and he was probably feet away from them in the dark. He instructs Harry to stay safe and practise defensive spells for the Third Task, and demands that Harry give him his word that he won't go out of bounds again, especially not after hours. At Hermione's urging, he sends an owl back doing so.\nHogwarts, Great Hall\nRob, Hermione, Fred, George\nuncertain\n\n\nvoldemort also goes by the names tom riddle, he-who-must-not-be-named, dark lord.\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\ndumbledore also goes by the names albus dumbledore, albus.\nfred also goes by the names fred weasley.\ngeorge also goes by the names george weasley.\nsirius also goes by the names sirius black, padfoot, snuffles, stubby boardman.",
    "search_text": "First Hand\nThe trio discuss Crouch’s disappearance and send a letter to Sirius. They overhear Fred and George hinting at blackmail, likely to fund their future joke shop. Moody says Crouch can’t be found. Sirius replies, warning Harry not to wander at night again and urges him to train for the final task.\nHogwarts, Great Hall\nRob, Hermione, Fred, George\nuncertain\n90",
    "tags": [
      "Hogwarts",
      "Great Hall",
      "Rob",
      "Hermione",
      "Fred",
      "George",
      "uncertain"
    ],
    "importance": "Medium",
    "token_count": 573
  },
  {
    "memory_id": "Goblet of Fire 91",
    "prompt_text": "[PERSPECTIVE: First Hand]\nDuring Divination class Harry passes out and has a vision. He sees Voldemort being informed of someone's death and torturing Wormtail for failing to prevent that person from escaping. Harry awakens with his scar hurting badly and pretends he has to go to the Hospital Wing. Harry actually goes to see Dumbledore. After spending time trying to get the password to Dumbledore's office right, Harry overhears an argument between Dumbledore, Moody, and Cornelius Fudge regarding the Barty Crouch situation. Fudge refuses to believe the words that Crouch said about Bertha Jorkins being dead, and while debating what happened to Crouch, Fudge suggests that Madame Maxime is the likely culprit given her half-giant physiology. Dumbledore accuses Fudge of acting on personal prejudice, which Fudge ignores due to Dumbledore's friendship with Hagrid. Moody interrupts the debate to explain that Harry Potter has arrived.\nHogwarts, Headmaster's Office\nDumbledore, Fudge, Moody\nsurprised, curious\n\n\nvoldemort also goes by the names tom riddle, he-who-must-not-be-named, dark lord.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\ndumbledore also goes by the names albus dumbledore, albus.",
    "search_text": "First Hand\nDuring Divination, Harry has a vision of Voldemort punishing Wormtail for letting someone escape. His scar burns, and he rushes to Dumbledore’s office. There, he overhears Dumbledore, Moody, and Fudge arguing about Crouch. Fudge dismisses Crouch’s claims and wrongly suspects Madame Maxime.\nHogwarts, Headmaster's Office\nDumbledore, Fudge, Moody\nsurprised, curious\n91",
    "tags": [
      "Hogwarts",
      "Headmaster's Office",
      "Dumbledore",
      "Fudge",
      "Moody",
      "surprised",
      "curious"
    ],
    "importance": "Medium",
    "token_count": 336
  },
  {
    "memory_id": "Goblet of Fire 92",
    "prompt_text": "[PERSPECTIVE: First Hand]\nHarry is alone in Dumbledore's office. While looking around, notices Dumbledore's Pensieve, a device that stores memories. Through curiosity, Harry peers in and ends up looking into three of Dumbledore's memories. The first is the trial of Igor Karkaroff, in which he renounces his support of the Death Eaters and gives the names of existing Death Eaters, including Snape. Dumbledore (in the memory) states that Snape is a spy against Voldemort and is no longer a threat. The second memory shows the trial of Ludo Bagman. The third is a trial for the Lestrange family, a group of three, and Crouch's son, Barty Crouch Jnr, for the use of the Cruciatus Curse on Alice and Frank Longbottom. Crouch sentences them all to a lifetime in Azkaban. By then Dumbledore (from the present) arrives and brings Harry back.\nAfter Dumbledore explains what happened and shows Harry another of his memories regarding a teenage Bertha Jorkins during her Hogwarts years, Harry explains what happened in Divination. Dumbledore finds Harry's scar pains to be an odd concept and brings up that this is the second time it has hurt, the first being during the summer.\nDumbledore suspects that the reason why Harry's scar hurts is due to the connection that Voldemort's failed curse had created with him. He believes the scar would only hurt when Voldemort were close or was feeling a strong emotion. Dumbledore also explains to Harry that, unlike the Ministry, he believes that the disappearances of Bertha Jorkins, Barty Crouch, and a Muggle by the name of Frank Bryce may be connected to Voldemort.\nDumbledore also explains that Frank and Alice Longbottom are Neville's parents and they went insane due to the Lestranges' attack and that this is the reason why Neville was brought up by his grandmother and why he has such an aversion to the Cruciatus Curse.\nHogwarts, Headmasters office\nDumbledore, Bertha\ncurious\n\n\nvoldemort also goes by the names tom riddle, he-who-must-not-be-named, dark lord.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\ndumbledore also goes by the names albus dumbledore, albus.",
    "search_text": "First Hand\nIn Dumbledore’s office, Harry accidentally views Pensieve memories: trials of Karkaroff, Bagman, and the Lestranges—plus Barty Crouch Jr.—for torturing Neville’s parents. Dumbledore explains the scar pain may signal Harry’s link to Voldemort. He suspects the disappearances of Jorkins, Crouch, and Frank Bryce are all connected.\nHogwarts, Headmasters office\nDumbledore, Bertha\ncurious\n92",
    "tags": [
      "Hogwarts",
      "Headmasters office",
      "Dumbledore",
      "Bertha",
      "curious"
    ],
    "importance": "Medium",
    "token_count": 581
  },
  {
    "memory_id": "Goblet of Fire 93",
    "prompt_text": "[PERSPECTIVE: First Hand]\nAs the third task approaches, Ron and Hermione find time when they are not studying for their final exams to help Harry. Even McGonagall helps by allowing him to practise in her empty classroom during lunchtime. During one practice session, Ron notices Malfoy outside the castle sitting by a tree and doing something odd. Harry and Hermione also see him before they return to practice. Sirius sends Harry messages by owl each day, reminding Harry to focus on what is ahead.\n\nOn the day of the third task, Rita Skeeter releases an article claiming Harry is demented and dangerous. She uses a quote from Draco Malfoy in the article. This raises some questions between the trio, since the article mentions Harry's scar hurting during Divination, and Skeeter is not allowed inside Hogwarts, so she shouldn't have had that information. Hermione finally figures out how Skeeter may be getting her information and leaves to put her theory to the test.\nMcGonagall tells the champions that their families have come to watch them complete. Harry doesn't want to meet them, expecting the Dursleys, but instead finds Molly and Bill Weasley. They mention to Harry that Percy will not be coming this time. After the Barty Crouch incident, which is being kept secret, Percy was hauled in for questioning regarding that the instructions he was receiving, which may not have actually been sent by Barty Crouch. Instead, Cornelius Fudge will be serving as the fifth Triwizard judge in his place.\nAfter the rest of the Weasley children and Hermione show up, Harry tells Mrs Weasley that everything Skeeter wrote on Hermione was a lie.\nHogwarts\nMolly, Hermione, Rita\nnervous, angry, happy\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\nmolly also goes by the names molly weasley, mrs. weasley, ms. weasley.\nsirius also goes by the names sirius black, padfoot, snuffles, stubby boardman.",
    "search_text": "First Hand\nAs the third task nears, Ron, Hermione, and even McGonagall help Harry practise. A new Skeeter article claims Harry is unstable, using info she shouldn’t know. Hermione leaves to confirm her theory. On task day, Harry is relieved to see Molly and Bill instead of the Dursleys.\nHogwarts\nMolly, Hermione, Rita\nnervous, angry, happy\n93",
    "tags": [
      "Hogwarts",
      "Molly",
      "Hermione",
      "Rita",
      "nervous",
      "angry",
      "happy"
    ],
    "importance": "Medium",
    "token_count": 527
  },
  {
    "memory_id": "Goblet of Fire 94",
    "prompt_text": "[PERSPECTIVE: First Hand]\nFor the third and final task of the Triwizard Tournament, Mr Bagman takes the champions to the maze and Harry and Cedric, who are tied for first place, are sent in first.\n\nHarry successfully navigates the maze with the aid of the Four-Point Spell. He gets past both a Blast-Ended-Skrewt and a Boggart disguised as a Dementor. Along the way, he hears Fleur scream. Harry rescues Cedric, who has been attacked by a mind-controlled Krum; Harry manages to stun Krum and sends out a signal for Krum to be rescued before he and Cedric move on. Harry manages to pass a sphinx and, as he approaches the Cup, is attacked by an Acromantula. Aided by Cedric, he defeats it, though one of Harry's legs is injured in the process. After taking the monster out, they decide to grab the Cup simultaneously. Unbeknownst to them, the Cup is actually a Portkey that transports them to an old cemetery in the Muggle village of Little Hangleton. \n\nJust as Harry and Cedric are trying to figure out what happened, a hooded stranger appears and Harry's scar begins hurting again. A second voice orders the stranger to kill Cedric, which he does, leaving Harry frozen with shock and horror. Harry is then dragged to a large marble tombstone with the name Tom Riddle engraved upon it. The stranger then tightly binds Harry to it with thick black cords and stuffs black cloth in his mouth to muffle his cries for help. \nUnable to escape, Harry recognises the stranger as Peter Pettigrew. He also notes that Pettigrew is carrying what appears to be a deformed infant. Pettigrew takes some of Harry's blood, bone dust from Tom Riddle Snr's grave, and puts them in a cauldron. He then cuts off his own right hand, at the orders of the strange creature, and places it in a cauldron. The creature is revealed to be none other than Lord Voldemort himself, and the potion made by Pettigrew returns a physical form and restores his powers stronger than before.\nHogwarts, Little Hangleton\nCedric, Voldemort, Pettigrew\nshock, horror\n\n\nvoldemort also goes by the names tom riddle, he-who-must-not-be-named, dark lord.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\npettigrew also goes by the names peter, peter pettigrew, wormtail.",
    "search_text": "First Hand\nHarry and Cedric reach the Triwizard Cup together, unaware it’s a Portkey. They’re transported to a graveyard where Pettigrew kills Cedric. Harry is bound to Tom Riddle’s grave as Pettigrew performs a dark ritual using Harry’s blood. Voldemort emerges reborn, fully restored to power at last.\nHogwarts, Little Hangleton\nCedric, Voldemort, Pettigrew\nshock, horror\n94",
    "tags": [
      "Hogwarts",
      "Little Hangleton",
      "Cedric",
      "Voldemort",
      "Pettigrew",
      "shock",
      "horror"
    ],
    "importance": "Medium",
    "token_count": 635
  },
  {
    "memory_id": "Goblet of Fire 95",
    "prompt_text": "[PERSPECTIVE: First Hand]\nVoldemort forces Wormtail to take out his bleeding arm to activate the Dark Mark and summon the Death Eaters. After his Death Eaters arrive, Voldemort spends time criticising them for failing to seek him out during these last thirteen years, even though they knew that he had found a way to escape mortal death. He believes they feared a power greater than his, like that of Albus Dumbledore, which is why they slipped back into normal wizarding society and claimed they were never loyal to Voldemort. Voldemort then rewards Wormtail for aiding with his rebirth by creating a new silver hand for him.\nVoldemort identifies more Death Eaters, including Lucius Malfoy, and announces his plans for rebuilding his army and punish the Death Eaters that have deserted him. Voldemort explains that now that they share the same blood, Voldemort is free to touch Harry. \n\nWith Wormtail's help, Voldemort was able to regain a body of his own and some of his powers and return to Britain. There, he plotted Harry's kidnapping, knowing that Harry's blood would remove his own mother's protection. Voldemort reveals that this servant who is at Hogwarts has ensured that Harry would win the tournament and be brought to the graveyard. Voldemort then frees the injured and weakened Harry and orders him to face him in a duel, wishing to prove who among the two is stronger in front of his minions. After Harry refuses to bow to the Dark Lord, Voldemort uses the Imperius Curse on Harry to force him to. Though Harry gives in the first time, the second time he manages to shake the curse off, much to the astonishment of the Death Eaters present.\nWhen the duel begins, something miraculous happens. Voldemort and Harry's wands are \"brothers\", due to the fact that their wands' cores are both feathers from the same phoenix. As the wands spells meet in the air and interlock, a Priori Incantatem effect occurs. This causes the spirit echoes of Voldemort's victims, including Harry's parents, to spill out from his wand. The echoes momentarily protect Harry, allowing him to grab the Portkey and escape to Hogwarts with Cedric's body.\nLittle Hangleton\nVoldemort, Pettigrew, Lucius\nscared, angry\n\n\nvoldemort also goes by the names tom riddle, he-who-must-not-be-named, dark lord.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\ndumbledore also goes by the names albus dumbledore, albus.\npettigrew also goes by the names peter, peter pettigrew, wormtail.",
    "search_text": "First Hand\nVoldemort summons his Death Eaters, rebukes them for abandoning him, and rewards Wormtail with a silver hand. He reveals his plan to use Harry’s blood to bypass Lily’s protection and forces Harry into a duel. Their wands connect, triggering Priori Incantatem. Spirit echoes shield Harry, letting him escape with Cedric’s body.\nLittle Hangleton\nVoldemort, Pettigrew, Lucius\nscared, angry\n95",
    "tags": [
      "Little Hangleton",
      "Voldemort",
      "Pettigrew",
      "Lucius",
      "scared",
      "angry"
    ],
    "importance": "Medium",
    "token_count": 681
  },
  {
    "memory_id": "Goblet of Fire 96",
    "prompt_text": "[PERSPECTIVE: First Hand]\nAfter Harry returns to Hogwarts with Cedric’s body, chaos erupts. While Dumbledore and Fudge tend to Cedric’s parents, a shaken Harry is taken away by “Moody,” who questions him about the graveyard. Harry suspects Karkaroff is Voldemort’s servant, but “Moody” reveals Karkaroff fled and wasn’t loyal. He then confesses he was behind Harry’s entry into the Triwizard Tournament and secretly helped him throughout each task—from tipping off Hagrid about the dragons, to arranging for Dobby to supply the gillyweed, to interfering in the third task by removing obstacles and disabling the other champions. His true goal was to get Harry to the graveyard.\n\nWhen he prepares to kill Harry, Dumbledore, Snape, and McGonagall intervene just in time. Dumbledore reveals this man isn’t the real Alastor Moody, whom he finds imprisoned in a trunk. The imposter had been using Polyjuice Potion all year and forgot his latest dose. When the potion wears off, he is revealed to be Barty Crouch Jr.\n\nUnder Veritaserum, Crouch Jr. confesses that he escaped Azkaban with help from his dying mother, who swapped places with him using Polyjuice Potion. His father kept him under the Imperius Curse until Bertha Jorkins stumbled upon the secret. Crouch Sr. erased her memory, causing lasting damage. Winky convinced Crouch Sr. to let his son attend the Quidditch World Cup under an Invisibility Cloak. There, Barty stole Harry’s wand and later used it to cast the Dark Mark.\n\nVoldemort, informed by Bertha, found and freed Barty Jr. They captured the real Moody, and Barty Jr. assumed his identity, using knowledge of Moody’s habits and behavior to deceive everyone. While impersonating Moody, Barty Jr. learned about the tasks, manipulated events, and turned the Triwizard Cup into a Portkey to send Harry to Voldemort.\n\nBarty Crouch Sr. eventually tried to warn Dumbledore but was intercepted and killed by his son, who transfigured the body and buried it in Hagrid’s yard. All of this had been part of Voldemort’s plan to return to power.\nHogwarts\nCrouch Jr., Dumbledore, Moody\nconfused, distressed, shock\n\n\nvoldemort also goes by the names tom riddle, he-who-must-not-be-named, dark lord.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\ndumbledore also goes by the names albus dumbledore, albus.",
    "search_text": "First Hand\nAfter returning with Cedric’s body, Harry is taken by “Moody,” who reveals he rigged the Tournament to deliver Harry to Voldemort. Dumbledore intervenes just in time, exposing the imposter as Barty Crouch Jr. Under Veritaserum, Crouch confesses everything—his escape, impersonation, and role in Voldemort’s return.\nHogwarts\nCrouch Jr., Dumbledore, Moody\nconfused, distressed, shock\n96",
    "tags": [
      "Hogwarts",
      "Crouch Jr.",
      "Dumbledore",
      "Moody",
      "confused",
      "distressed",
      "shock"
    ],
    "importance": "Medium",
    "token_count": 662
  },
  {
    "memory_id": "Goblet of Fire 97",
    "prompt_text": "[PERSPECTIVE: First Hand]\nDumbledore takes Harry to his office to meet Sirius, but not before placing McGonagall in charge of Crouch Jnr. He also sends Snape to take Moody to the Hospital Wing and bring Cornelius Fudge up to Moody's office.\nOnce in Dumbledore's office, Harry tells Dumbledore and Sirius everything. Dumbledore explains the Priori Incantatem effect and says that the spirits that appeared were echoes of Voldemort's most recent victims. After Sirius transforms back into a dog they head to the Hospital Wing, where Harry is given a Sleeping Potion to help him relax.\nUpon waking up, he, along with Molly and Bill Weasley, hear a large argument. Fudge summoned a Dementor as protection when he went to confront Crouch Jnr, which sucked out Crouch Jnr's soul before he, McGonagall, Snape, and Dumbledore entered the Hospital Wing. Dumbledore is upset that they lost a key piece of evidence on Voldemort's return, while Fudge believes the man was a lunatic and that his testimony would not have been useful.\nDue to reading Rita Skeeter's last article about Harry being dangerous, Fudge does not accept Harry's testimony. Harry gets up and tries to identify the Death Eaters whose names he heard earlier, but Fudge points out they were cleared long ago. Even after Snape reveals his Dark Mark and explains that Voldemort had summoned him, Fudge thinks it is some kind of a ploy. He then exits the room, but not before he gives Harry his winnings from the Tournament.\nDumbledore has Sirius revert to his true form. Both Mrs Weasley and Snape are surprised by his presence, but are quickly convinced of his innocence. Dumbledore dispatches Sirius to reinstate the Order of the Phoenix by gathering known wizards and witches who would support their side. Harry then regrets asking Cedric to grab the Triwizard cup with him, and then uses the last of the potion to return to sleep.\nHogwarts, Medical Wing\nDumbledore, Fudge, Snape\ngrief, guilt\n\n\nvoldemort also goes by the names tom riddle, he-who-must-not-be-named, dark lord.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\ndumbledore also goes by the names albus dumbledore, albus.\nmolly also goes by the names molly weasley, mrs. weasley, ms. weasley.\nsirius also goes by the names sirius black, padfoot, snuffles, stubby boardman.",
    "search_text": "First Hand\nDumbledore brings Harry to Sirius, and Harry recounts everything. Dumbledore explains Priori Incantatem. Later, Fudge has a Dementor kiss Crouch Jr., destroying vital evidence. He dismisses Harry’s testimony and ignores Snape’s Dark Mark. Dumbledore tasks Sirius with reforming the Order of the Phoenix. Harry falls asleep, grieving Cedric’s death.\nHogwarts, Medical Wing\nDumbledore, Fudge, Snape\ngrief, guilt\n97",
    "tags": [
      "Hogwarts",
      "Medical Wing",
      "Dumbledore",
      "Fudge",
      "Snape",
      "grief",
      "guilt"
    ],
    "importance": "Medium",
    "token_count": 648
  },
  {
    "memory_id": "Goblet of Fire 98",
    "prompt_text": "[PERSPECTIVE: First Hand]\nHarry meets with Cedric's parents. They do not blame him for what happened and are thankful to have his body, but decline Harry's offer of the winnings.\nDuring the Leaving Feast, a memorial feast for Cedric is held, where Dumbledore tells the school what has happened in the graveyard despite the Ministry's wishes that he keep it secret. Fleur and Krum both say good-bye to the trio before they take their carriage to the Hogwarts Express.\nHermione reveals that she has discovered that Rita Skeeter is an unregistered animagus who can turn into a beetle. Hermione caught Skeeter in a jar in the Hospital Wing after the third task. Hermione assures Harry and Ron that her stories will trouble them no longer, since she told Rita that if the stories continued, she would tell the Ministry about her secret.\nJust as Malfoy, Crabbe, and Goyle arrive and taunt Harry over Voldemort's return, they are rendered unconscious from hexes used by both the trio and Fred and George Weasley. Harry, Ron, and George then began kicking, rolling, and pushing the unconscious Malfoy, Crabbe, and Goyle into a spot where they will be out of the way. Soon another mystery is solved: The person that Fred and George were hinted to have been blackmailing was Ludo Bagman. When the twins won their bet, he paid them their winnings at the Quidditch World Cup in Leprechaun gold and wouldn't even return their original wager.\n\nThe twins reveal that Bagman has a long-time problem with gambling and he made a bet that Harry would win the tournament to get his money back, which is why he was trying to help Harry cheat. However, since Harry and Cedric actually \"tied\" for first place, Bagman has gone on the run. Harry gives the twins his Triwizard Winnings to help them with their dream of running a joke shop. Everyone then say their good-byes as Harry prepares to leave with Vernon Dursley.\nHogwarts, Hogwarts Express\nRon, Hermione, Fred, George, Malfoy\nsad, relaxed\n\n\nvoldemort also goes by the names tom riddle, he-who-must-not-be-named, dark lord.\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\ndumbledore also goes by the names albus dumbledore, albus.\nfred also goes by the names fred weasley.\ngeorge also goes by the names george weasley.\nvernon also goes by the names vernon dursley, mr. dursley.",
    "search_text": "First Hand\nHarry meets Cedric’s parents, who thank him and refuse the Triwizard Tournament winnings. Dumbledore tells the students the truth about Voldemort’s return. Hermione reveals Rita Skeeter is an unregistered Animagus and has blackmailed her into silence. Harry gives Fred and George his winnings to start their joke shop.\nHogwarts, Hogwarts Express\nRon, Hermione, Fred, George, Malfoy\nsad, relaxed\n98",
    "tags": [
      "Hogwarts",
      "Hogwarts Express",
      "Ron",
      "Hermione",
      "Fred",
      "George",
      "Malfoy",
      "sad",
      "relaxed"
    ],
    "importance": "Medium",
    "token_count": 671
  },
  {
    "memory_id": "Order of the Phoenix 100",
    "prompt_text": "[PERSPECTIVE: First Hand]\nMrs Figg explains to a surprised Harry she is actually a Squib, mentions she was sent by Dumbledore to watch over Harry and also kept his visits to her house boring so the Dursleys would not send Harry elsewhere if he were happy. After Mundungus Fletcher shows up, Mrs Figg scolds him for his foolish actions before sending him to inform Dumbledore of this situation so he can act quickly. Just before they part, Harry learns that Dumbledore has been keeping him under observation in order to protect him after what had happened with Voldemort last month. When Aunt Petunia and Uncle Vernon notice Dudley in his sickly state they fawn over him and Harry attempts to slip away, but Dudley speaks and assumes that Harry attacked him with some sort of spell since Muggles cannot see Dementors.\nBefore Harry can explain himself, the Ministry of Magic sends Harry a letter telling him that he's been expelled from Hogwarts for underage magic. Another letter from Arthur Weasley arrives telling Harry that Dumbledore is trying to sort this out and to stay put in his house, not surrender his wand, and not to perform any more magic. As Harry is explaining that the Dementors are responsible, Petunia surprisingly shows she has some knowledge of the Dementors. A second letter from the Ministry arrives stating that Dumbledore has convinced them to set up a hearing on 12 August to decide whether or not to break Harry's wand and Harry is being placed on suspension instead of being expelled.\nVernon is ready to throw Harry out, as he has always yearned to do so since receiving Harry, when Petunia receives a Howler. Before she has an opportunity to open the letter, it bursts into flames and a menacing voice says, \"Remember my last, Petunia\". Petunia then immediately convinces her husband to let Harry remain at Privet Drive.\nPrivet Drive\nFigg, Petunia, Vernon\nconfused, panicked\n\n\nvoldemort also goes by the names tom riddle, he-who-must-not-be-named, dark lord.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\ndumbledore also goes by the names albus dumbledore, albus.\nvernon also goes by the names vernon dursley, mr. dursley.\npetunia also goes by the names petunia dursley, mrs. dursley, ms. dursley.",
    "search_text": "First Hand\nMrs Figg reveals she’s a Squib sent by Dumbledore to watch Harry. After scolding Mundungus for leaving, she sends him to alert Dumbledore. The Ministry expels Harry for underage magic, but Dumbledore arranges a hearing instead. A Howler to Petunia prompts her to insist Harry stay at Privet Drive.\nPrivet Drive\nFigg, Petunia, Vernon\nconfused, panicked\n100",
    "tags": [
      "Privet Drive",
      "Figg",
      "Petunia",
      "Vernon",
      "confused",
      "panicked"
    ],
    "importance": "Medium",
    "token_count": 572
  },
  {
    "memory_id": "Order of the Phoenix 101",
    "prompt_text": "[PERSPECTIVE: First Hand]\nWhen Uncle Vernon, Aunt Petunia, and Dudley leave to attend an award ceremony for the best kept suburban lawn in England (which was a hoax set up by Tonks to lure the Dursleys away from their house), a number of witches and wizards come to rescue Harry from the Dursleys' home. They are members of the Order of the Phoenix, an elite group whose members fight Lord Voldemort and the Death Eaters. Among them were the real Mad-Eye Moody and Remus Lupin, along with some newcomers such as Nymphadora Tonks and Kingsley Shacklebolt. After flying through the cold night, they land at their destination, 12 Grimmauld Place (London). The Weasleys, Hermione Granger, and Harry’s godfather Sirius Black are there. While the Order of the Phoenix are having a meeting, Mrs Weasley takes Harry to the room where Ron and Hermione are before heading back. Harry converses with Hermione and Ron and learns to his ire that Dumbledore was the reason he had no contact from his friends all summer, though Ron and Hermione were uncomfortable with this, knowing how Harry would feel. Fred and George then appear magically through Apparition, revealing to Harry they passed their test. The Weasley children reveal that—besides Severus Snape who has joined the Order—Bill and Charlie have also joined. Charlie has been given the task of recruiting foreign wizards to their cause.\nAs for Percy, the Weasley children sadly reveal he has deserted their family after he and Arthur had a fight over Percy's recent promotion to Cornelius Fudge's Junior Assistant. Harry also learns that the Ministry has been using the Daily Prophet to build on what Rita Skeeter started and is portraying Harry as some \"attention-seeking liar\". While helping on closing the curtains, Sirius shows up and explains to Harry that Number 12, Grimmauld Place is the Black family's ancestral home and that he inherited it upon his mother's death.\nGrimmauld Place, Privet Drive\nRon, Hermione, Sirius\nupset, angry\n\n\nvoldemort also goes by the names tom riddle, he-who-must-not-be-named, dark lord.\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\ndumbledore also goes by the names albus dumbledore, albus.\nfred also goes by the names fred weasley.\ngeorge also goes by the names george weasley.\nvernon also goes by the names vernon dursley, mr. dursley.\npetunia also goes by the names petunia dursley, mrs. dursley, ms. dursley.\nsirius also goes by the names sirius black, padfoot, snuffles, stubby boardman.",
    "search_text": "First Hand\nThe Order of the Phoenix rescues Harry from Privet Drive and takes him to 12 Grimmauld Place, Sirius Black’s inherited home. Harry reunites with friends, learns Dumbledore kept them from writing, and hears of Percy’s rift with his family, Snape’s membership in the Order, and the Ministry’s smear campaign against him.\nGrimmauld Place, Privet Drive\nRon, Hermione, Sirius\nupset, angry\n101",
    "tags": [
      "Grimmauld Place",
      "Privet Drive",
      "Ron",
      "Hermione",
      "Sirius",
      "upset",
      "angry"
    ],
    "importance": "Medium",
    "token_count": 717
  },
  {
    "memory_id": "Order of the Phoenix 102",
    "prompt_text": "[PERSPECTIVE: First Hand]\nWhile they are setting up for dinner, Sirius reveals he has been confined in the house for a month since he is still a wanted criminal and that Voldemort and the Death Eaters would know he is an Animagus by now due to Wormtail informing them, which makes him almost useless to the Order. They then have dinner, and numerous conversations go around. After dinner, Sirius tries to tell Harry about the latest events and about their plans, but Molly keeps saying that Harry is too young and that Dumbledore told them not to tell Harry \"more than he needs to know\". After the two argue about it, Molly reluctantly allows Harry and everyone else but Ginny to stay and listen.\nHarry learns that Voldemort is keeping a low profile and is building an army. Though Harry managed to escape during Voldemort's rebirth, allowing Dumbledore to reactivate the Order of the Phoenix, it is difficult for them to convince as many people what has happened because of the Ministry and Fudge's position, since Fudge believes that Dumbledore is after his job. Another reason the Order is having trouble with finding allies is the issue of their credibility. Sirius is a wanted murderer, Lupin is a werewolf, and the members that work for the Ministry would lose their jobs since Fudge is willing to sack anyone just for disagreeing with him. Fudge has also been trying to discredit Dumbledore's reputation to prevent him from spreading the information, and is having the Daily Prophet cover up any news related to this. Sirius attempts to mention that Voldemort is trying to retrieve a \"weapon...something he didn't have last time\", before Molly and Lupin ask him to stop, and they then send the kids off to bed.\nGrimmauld Place\nSirius, Molly\nintrigued\n\n\nvoldemort also goes by the names tom riddle, he-who-must-not-be-named, dark lord.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\ndumbledore also goes by the names albus dumbledore, albus.\nmolly also goes by the names molly weasley, mrs. weasley, ms. weasley.\nginny also goes by the names ginny weasley.\nsirius also goes by the names sirius black, padfoot, snuffles, stubby boardman.",
    "search_text": "First Hand\nSirius, confined to Grimmauld Place, argues with Molly over telling Harry about Voldemort. Harry learns Voldemort is secretly building an army while the Ministry discredits Dumbledore and covers up the truth. Sirius hints Voldemort seeks a weapon he lacked before but is stopped from revealing more.\nGrimmauld Place\nSirius, Molly\nintrigued\n102",
    "tags": [
      "Grimmauld Place",
      "Sirius",
      "Molly",
      "intrigued"
    ],
    "importance": "Medium",
    "token_count": 551
  },
  {
    "memory_id": "Order of the Phoenix 103",
    "prompt_text": "[PERSPECTIVE: First Hand]\nAfter Harry and Ron head into their room, Fred and George Apparate inside, where the four briefly discuss their speculation on what Voldemort might be seeking before their mother's footsteps convince the twins they have to get back to their own room. While Molly is busy arguing with Mundungus Fletcher in another room, Harry meets Kreacher, the domestic-elf of the House of Black. He is always cursing and muttering bad words, on occasion calling Hermione a mudblood and then insulting Sirius for betraying his mother's trust after Sirius arrives before Kreacher heads to another room. Harry notices an old tapestry, that Sirius sarcastically explains is the family tree of the \"Noble and Most Ancient House of Black\". Sirius reveals that he was disowned by his family at the age of sixteen and lived with Harry's father James and his parents before his uncle, who was disowned as well, left Sirius some money to live on his own.\nSirius explains that his family was all for the purification of the wizarding race, getting rid of Muggle-borns and having pure-bloods in charge, and while not all of them were Death Eaters, they agreed with Voldemort's ideals. Sirius mentions that his brother was killed, presumably for attempting to abandon the Death Eaters. Harry is then surprised to learn that Sirius is related to the Malfoys through Lucius's wife Narcissa. He also learns that Tonks' mother Andromeda is Sirius's cousin, and that she was also disowned. Both she and Narcissa had a sister, Bellatrix, who was sent to Azkaban. She is the woman Harry saw in Dumbledore's Pensieve during Barty Crouch Jnr's trial.\nSirius then mentions his parents' home is only being used as the Order of the Phoenix's headquarters due to the protective enchantments his father put on it years ago and the additional security measures that Dumbledore set up.\n12 Grimmauld Place\nSirius, Kreacher\nintrigued\n\n\nvoldemort also goes by the names tom riddle, he-who-must-not-be-named, dark lord.\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\ndumbledore also goes by the names albus dumbledore, albus.\nmolly also goes by the names molly weasley, mrs. weasley, ms. weasley.\nfred also goes by the names fred weasley.\ngeorge also goes by the names george weasley.\nsirius also goes by the names sirius black, padfoot, snuffles, stubby boardman.",
    "search_text": "First Hand\nAfter discussing Voldemort’s possible goal, Harry meets Kreacher, the Black family’s foul-mouthed house-elf, who insults Hermione and Sirius before leaving. Sirius shows Harry the Black family tree, revealing his disownment at sixteen, his ties to the Malfoys, and explains the house is used as headquarters due to old and new enchantments.\n12 Grimmauld Place\nSirius, Kreacher\nintrigued\n103",
    "tags": [
      "12 Grimmauld Place",
      "Sirius",
      "Kreacher",
      "intrigued"
    ],
    "importance": "Medium",
    "token_count": 672
  },
  {
    "memory_id": "Order of the Phoenix 104",
    "prompt_text": "[PERSPECTIVE: First Hand]\nHarry heads down to breakfast and learns that Amelia Bones will be in charge of his hearing. Harry is nervous over the possibility of being expelled from Hogwarts, but Lupin assures Harry that underage wizards are allowed to use magic in life-threatening situations. Arthur Weasley then escorts Harry to the Ministry for his disciplinary hearing using the train in the London Underground. Just outside the courtroom, Mr Weasley stops, telling Harry that he must face the hearing alone.\n\nCornelius Fudge is acting as the head of the Wizengamot. After Dumbledore arrives, Fudge starts the trial without giving Harry a chance to defend himself. Once Harry gets the chance to explain about the Dementors, Fudge labels his statement a convenient lie, but Dumbledore is able to produce a reliable witness: Mrs Figg. Mrs Figg is able to describe the attack and confirms that the Dementors attacked Harry and Dudley.\nWhen Fudge points out the unlikelihood of Dementors in Little Whinging, Dumbledore suggests that someone within the Ministry ordered them there. Fudge refuses to accept any of this as evidence and while Dumbledore reminds him that magic can be used in these extraordinary circumstances. Fudge dismisses this, given Harry's past issues, reminding them of the fact that Harry inflated his aunt in the past, even though no charges were pressed.\nFudge also tries to bring up Harry's rule-breaking at Hogwarts, but Dumbledore reminds Fudge that the Ministry does not have the authority to punish students for what they do at school. He points out the irregularity of the hastiness for this trial and attempt to destroy Harry's wand without successfully proving these charges, and also the use of the full Wizengamot for a simple case of under-age magic. When the Wizengamot takes a vote, Harry is cleared of all charges with more than half of the Wizengamot raising their hands to clear him.\nMinistry of Magic\nFudge, Arthur, Figg, Dumbledore\nstressed, worried, relief\n\n\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\ndumbledore also goes by the names albus dumbledore, albus.",
    "search_text": "First Hand\nAt his Ministry hearing, Harry faces Fudge’s accusations of lying about Dementors. Dumbledore brings Mrs Figg as a witness, proving the attack happened. Fudge refuses to believe it but is overruled. Dumbledore points out irregularities in the trial, and the Wizengamot votes to clear Harry of all charges.\nMinistry of Magic\nFudge, Arthur, Figg, Dumbledore\nstressed, worried, relief\n104",
    "tags": [
      "Ministry of Magic",
      "Fudge",
      "Arthur",
      "Figg",
      "Dumbledore",
      "stressed",
      "worried",
      "relief"
    ],
    "importance": "Medium",
    "token_count": 522
  },
  {
    "memory_id": "Order of the Phoenix 105",
    "prompt_text": "[PERSPECTIVE: First Hand]\nHarry leaves the courtroom and tells Mr Weasley that he had been cleared of all charges. Arthur decides to take Harry back to Grimmauld Place before he heads out on an assignment. On their way they see Fudge meeting with Lucius Malfoy. While Harry believes that Fudge may have been put under the Imperius Curse, Mr Weasley states that Dumbledore doubts this. Back at Grimmauld Place, everybody celebrates Harry's acquittal.\nA few days later, on the last day of the holidays, the children receive their Hogwarts letters and Ron and Hermione are named prefects. Molly Weasley is so pleased with Ron's appointment as a prefect that she agrees to Ron's request to get a new broomstick (though an inexpensive one) when she goes to Diagon Alley to pick up their new books. Harry feels some resentment that Ron was chosen over him as prefect. Later that night, Mrs Weasley prepares a dinner party for the new prefects. During the party, Harry feels better when he learns from Sirius that he and Harry's father James were not made prefects either during their fifth year at Hogwarts, since Lupin was selected for that position instead.\nAfter the party, Mrs Weasley goes upstairs to get rid of the Boggart Alastor Moody identified for her earlier. Moody shows Harry an old photograph of the original Order of the Phoenix and identifies the people in the photograph, though hearing Moody describe the terrible fates of some of the members in the photograph makes Harry feel uncomfortable. After going upstairs, Harry finds that the sight of her worst fears (all her family members and Harry dead) was too much for Mrs Weasley; she started to cry before Lupin gets rid of the Boggart. As they help calm her down, Mrs Weasley wonders about the future of her loved ones.\nGrimmauld Place\nMolly, Sirius, Moody, Lupin\nresentful, uncomfortable\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\ndumbledore also goes by the names albus dumbledore, albus.\nmolly also goes by the names molly weasley, mrs. weasley, ms. weasley.\nsirius also goes by the names sirius black, padfoot, snuffles, stubby boardman.",
    "search_text": "First Hand\nHarry is cleared of charges. At Grimmauld Place, Ron and Hermione become prefects, upsetting Harry until Sirius reassures him. Moody shows Harry a photo of the old Order, detailing grim fates. Later, a Boggart reveals Mrs Weasley’s worst fear—her loved ones dead—leaving her in tears until Lupin comforts her.\nGrimmauld Place\nMolly, Sirius, Moody, Lupin\nresentful, uncomfortable\n105",
    "tags": [
      "Grimmauld Place",
      "Molly",
      "Sirius",
      "Moody",
      "Lupin",
      "resentful",
      "uncomfortable"
    ],
    "importance": "Medium",
    "token_count": 593
  },
  {
    "memory_id": "Order of the Phoenix 106",
    "prompt_text": "[PERSPECTIVE: First Hand]\nOn the day of departure to Platform Nine and Three-Quarters, the group is rushing to get ready as the children will be taken there under guard per Moody's recommendation. Mrs Weasley is angry with Fred and George for bewitching their trunks instead of trying to carry them downstairs and knocking Ginny off-balance. Harry is assigned to go with Molly and Tonks. Sirius accompanies them in his Animagus form. After the Hogwarts Express departs, with Ron and Hermione having to go to the prefects' carriage, Harry shares a compartment with Ginny, Neville Longbottom, and a girl from Ginny's year named Luna Lovegood, who is a Ravenclaw student. Later Ron and Hermione show up and tell them who the new prefects are for the other houses, including Draco Malfoy and Pansy Parkinson for Slytherin. Luna is reading a tabloid magazine called The Quibbler, of which, she tells them, her father is the editor, after Hermione makes an insensitive comment towards the magazine.\nAfter arriving at Hogsmeade station Harry notices that instead of Hagrid, Professor Grubbly-Plank, who previously substituted for Hagrid during their last school year, is there to direct the first years to their boats. When boarding their carriage Harry notices that the carriages are being pulled by some sort of winged horses (called a Thestral). He points them out to Ron and Hermione, but they cannot see them, and act worried when he insists that they are right there. Luna says that she can see them, and in fact could see them ever since she first came to Hogwarts. Harry is mystified, since he couldn't see them when he first came, but he can see them now.\nHogwarts\nLuna, Ginny, Hermione, Ron\nNervous, embarassed, confused\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\nmolly also goes by the names molly weasley, mrs. weasley, ms. weasley.\nfred also goes by the names fred weasley.\ngeorge also goes by the names george weasley.\nginny also goes by the names ginny weasley.\nsirius also goes by the names sirius black, padfoot, snuffles, stubby boardman.",
    "search_text": "First Hand\nEscorted to the train under guard, Harry rides with Ginny, Neville, and Luna Lovegood, later joined by Ron and Hermione. Luna reads The Quibbler, her father’s magazine. At Hogsmeade, Hagrid is absent, replaced by Professor Grubbly-Plank. Harry sees winged horses pulling carriages—visible only to him and Luna.\nHogwarts\nLuna, Ginny, Hermione, Ron\nNervous, embarassed, confused\n106",
    "tags": [
      "Hogwarts",
      "Luna",
      "Ginny",
      "Hermione",
      "Ron",
      "Nervous",
      "embarassed",
      "confused"
    ],
    "importance": "Medium",
    "token_count": 602
  },
  {
    "memory_id": "Order of the Phoenix 99",
    "prompt_text": "[PERSPECTIVE: First Hand]\nOn the hottest day of summer so far, Harry Potter remains at his house, 4 Privet Drive, living with his Muggle aunt, uncle and cousin and severely cut off from the rest of the wizarding world. The neighbourhood is suffering from an exhausting heat wave. Harry spends the majority of his summer out of the house, going on walks and avoiding his aunt and uncle. He doesn't want them to know why he is so interested in the news that summer. He is constantly rummaging through bins for old newspapers, searching for front-page news about the return of Lord Voldemort in the Daily Prophet. However, nothing unusual is reported, so Harry assumes that the Minister for Magic, Cornelius Fudge, is still as oblivious and in denial of Lord Voldemort's return as he was before.\n\nAfter running into his cousin Dudley Dursley and his street gang on a walk, Harry confronts Dudley after his gang leaves. This turns into an argument where Dudley mocks Harry about Cedric's death, having heard Harry use that name in his sleep. Harry immediately denies it, and when Harry takes out his wand and pretends to curse Dudley with it, a cold chill comes onto the duo and they are then attacked by Dementors. Harry attempts the Patronus Charm three times and is successful on the last try, and is surprised to find Mrs Figg, his old, cat-loving neighbour, storming up the road towards them. Harry tries to hide his wand, but Mrs Figg tells him to keep it out in case more of them show up. This comment makes Harry realise that Mrs Figg knows about the wizarding world. She is furious about Mundungus Fletcher, who was supposed to be watching Harry for the Order of the Phoenix, but had Disapparated from the front of 4 Privet Drive only moments earlier.\nPrivet Drive\nDudley, Figg\nangry, frightened, surprised\n\n\nvoldemort also goes by the names tom riddle, he-who-must-not-be-named, dark lord.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.",
    "search_text": "First Hand\nIn a sweltering summer, Harry obsessively checks the news for signs of Voldemort’s return but finds nothing. After Dudley taunts him about Cedric, Dementors attack. Harry drives them off with a Patronus, and Mrs Figg appears—revealing she knows about magic and is angry at Mundungus for abandoning his watch.\nPrivet Drive\nDudley, Figg\nangry, frightened, surprised\n99",
    "tags": [
      "Privet Drive",
      "Dudley",
      "Figg",
      "angry",
      "frightened",
      "surprised"
    ],
    "importance": "Medium",
    "token_count": 524
  },
  {
    "memory_id": "Philosopher's Stone 1",
    "prompt_text": "[PERSPECTIVE: First Hand]\nThere is no sign that Harry Potter lives at the Dursleys, with no pictures of him on the walls. He is forced to live in the cupboard under the stairs, a very cramped space with many spiders. Petunia comes to Harry's door one morning and wakes him with a shrill voice, tells him to make some bacon; she wants everything perfect for Dudley's 11th birthday. Harry dresses into a pair of Dudley's old clothes and enters the kitchen, where the table is covered in Dudley's presents.\n\nHarry is forced to wear Dudley’s ill fitting hand me downs, as the Dursleys avoid spending money on him whenever possible. Tape holds his glasses together because Dudley has smashed them many times. What distinguishes Harry from others the most is the lightning-shaped scar on his forehead. He often wonders how he got it, and the Dursleys have told him it was from the car crash that killed Harry's parents. Harry doesn't know much more about this accident because the Dursleys' first rule is not to ask questions. Dudley comes into the kitchen and begins to count his presents, only to find 36, which he angrily recalls is one fewer than the year before. Aunt Petunia states that they will buy him two new gifts while they are out. Vernon tells Petunia that their neighbour, Arabella Figg, has broken her leg and cannot take care of Harry while they are at the zoo. They can't think of anyone else who can take care of him, so Harry has to go with them.\nPrivet Drive\nVernon, Dudley, Petunia\nindifferent\n\n\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nvernon also goes by the names vernon dursley, mr. dursley.\npetunia also goes by the names petunia dursley, mrs. dursley, ms. dursley.",
    "search_text": "First Hand\nHarry is treated poorly be his adoptive parents the Dursleys, forced to live in a small cupboard under the stairs and wear Dudley's hand me downs. Dudley complains about his gifts, and Vernon informs Harry that since his babysitter is unavailable, he will be coming with them for Dudley's birthday trip to the zoo.\nPrivet Drive\nVernon, Dudley, Petunia\nindifferent\n1",
    "tags": [
      "Privet Drive",
      "Vernon",
      "Dudley",
      "Petunia",
      "indifferent"
    ],
    "importance": "Medium",
    "token_count": 466
  },
  {
    "memory_id": "Philosopher's Stone 10",
    "prompt_text": "[PERSPECTIVE: First Hand]\nEveryone sits down to a grand feast to begin the year. Harry is overwhelmed by the variety of luscious food served. Sir Nicholas de Mimsy-Porpington, the resident ghost of Gryffindor (popularly known as Nearly Headless Nick because of a botched decapitation), introduces himself to the first-year students and tells them he hopes they will win the house championship this year. Over dessert, the discussion turns to the students' upbringings. A student named Neville Longbottom tells how his family thought he was a Squib until he survived a fall from a window. Another student, Seamus Finnigan, talks about how his father, a Muggle, was shocked when he found out his wife (Seamus' mother) was a witch. Harry glances around the room and notices a few of the teachers talking to one another. One of them, while speaking to Quirrell, stares malevolently at Harry, who immediately feels a sharp pain in his forehead scar. Harry asks Percy the prefect who he is, and finds out that this man is Professor Severus Snape, who teaches Potions. After dessert, Dumbledore gets up to make his welcome speech. He adds a few warnings about staying away from the Forbidden Forest and avoiding the 3rd-floor corridor on the right side of the school before sending everyone off to bed in their Common rooms.\nHogwarts, Great Hall, Gryffindor Tower\nDumbledore, Snape\nhappy\n\n\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\ndumbledore also goes by the names albus dumbledore, albus.",
    "search_text": "First Hand\nHarry attends the welcoming feast at Hogwarts, talking to fellow Gryffindor students. He notices professor Snape glaring at him, and feels a pain in his scar. Dumbledore gives a welcome speech, warning that students aren't allowed in the forbidden forest, or a corridor on the third floor. They then go to their common room for the night.\nHogwarts, Great Hall, Gryffindor Tower\nDumbledore, Snape\nhappy\n10",
    "tags": [
      "Hogwarts",
      "Great Hall",
      "Gryffindor Tower",
      "Dumbledore",
      "Snape",
      "happy"
    ],
    "importance": "Medium",
    "token_count": 387
  },
  {
    "memory_id": "Philosopher's Stone 11",
    "prompt_text": "[PERSPECTIVE: First Hand]\nAll of Harry’s classes are very interesting to Harry, with the only exception being History of Magic, taught by Professor Binns. In his first Transfiguration class on Thursday, Professor McGonagall transfigures her desk into a pig and then back again while explaining how Transfiguration itself is some of the most complex and dangerous magic to be learned, and anyone who will get caught messing around with it will have to be banned from the class. Only Hermione is able to make any progress at turning a match into a needle, for which McGonagall gives her a rare smile, but Harry is relieved to see that most of his peers are just as lost as he is. When the time comes to transition to Defence Against the Dark Arts class every morning, the lesson turns into more of a joke, as Quirrell keeps going on with stories about his travels in the year prior, such as when he had ward off a vampire in Romania, and when he had earned his turban from an African prince for saving him from a troublesome zombie. \n\nDuring breakfast on the first Friday, Hedwig arrives with a tea invitation from Hagrid. Later, in his Potions class, Harry discovers that Professor Snape hates him, mocking Harry as \"our new celebrity\" and then humiliating Harry for his ignorance of potion-making materials, asking him a series of questions he doesn’t know the answer to, all why Hermione is raising her hand, being completely ignored by Snape, much to her frustration.\nHogwarts, Transfiguration Classroom, Potions Classroom\nMcGonagall, Snape, Hermione\ninterested, embarrassed\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.",
    "search_text": "First Hand\nHarry experiences his first classes at Hogwarts, and is pleased to see most other students (except for Hermione) are just as clueless as he is. In his first potions class, Snape makes it a point to embarrass Harry as much as possible. Snape clearly has a grudge against Harry.\nHogwarts, Transfiguration Classroom, Potions Classroom\nMcGonagall, Snape, Hermione\ninterested, embarrassed\n11",
    "tags": [
      "Hogwarts",
      "Transfiguration Classroom",
      "Potions Classroom",
      "McGonagall",
      "Snape",
      "Hermione",
      "interested",
      "embarrassed"
    ],
    "importance": "Medium",
    "token_count": 418
  },
  {
    "memory_id": "Philosopher's Stone 12",
    "prompt_text": "[PERSPECTIVE: First Hand]\nHarry has been at Hogwarts for around two weeks when he finds out that the Gryffindors will have flying lessons with the Slytherins, much to his disliking. Harry does not want to spend more time with Malfoy than he has to. However, Harry finds that he is quite a natural at flying. Madam Hooch leads the class, gently sending the new fliers off the ground. Neville has an accident when his broom runs amok and breaks his wrist. Madam Hooch takes him to the Hospital Wing telling everyone to stay on the ground while she is away. Malfoy notices a Remembrall belonging to Neville, picks it up, and begins to fly around with it. Harry goes after Malfoy, who throws the ball in the air. Harry catches it spectacularly and lands safely back on the ground. Just then, Professor McGonagall arrives, reprimanding Harry and ordering him to follow her. But instead of punishing him, McGonagall introduces him to Oliver Wood, captain of the Gryffindor Quidditch team, and makes him the Gryffindor team's new Seeker. At dinner, Harry excitedly tells Ron about joining the Quidditch team but tells him that Wood wants it to be a secret.\nHogwarts, Quidditch Pitch\nNeville, McGonagall, Malfoy\nannoyed, surprised\n\n\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.",
    "search_text": "First Hand\nHarry attends his first broom flying lesson, and after Neville is escorted to the hospital wing, Malfoy takes the opertunity to steal Nevilles rememberall, taunting Harry with it when he tries to take it back. Harry gets on his broom, breaking the rules to get the rememberall back. Instead of being punished, McGonagall recommends him to the Quidditch team.\nHogwarts, Quidditch Pitch\nNeville, McGonagall, Malfoy\nannoyed, surprised\n12",
    "tags": [
      "Hogwarts",
      "Quidditch Pitch",
      "Neville",
      "McGonagall",
      "Malfoy",
      "annoyed",
      "surprised"
    ],
    "importance": "Medium",
    "token_count": 371
  },
  {
    "memory_id": "Philosopher's Stone 13",
    "prompt_text": "[PERSPECTIVE: First Hand]\nMalfoy comes over with his cronies Vincent Crabbe and Gregory Goyle and teases Harry about getting in trouble during flying practice. The tension grows and Malfoy challenges Harry to a wizard's duel. Harry accepts, in spite of Hermione's attempt to dissuade them from breaking the school rules. As Harry and Ron sneak out later that night, Hermione tries to stop them but gets locked out of the dorm (the Fat Lady has gone for an evening stroll) and must tag along. Neville also joins them, as he has forgotten the password to the common room and ended up sleeping on the floor outside. They arrive at the Trophy Room, the site of the duel, but Malfoy is nowhere to be found. Suddenly, they hear Argus Filch and his cat, Mrs Norris, enter the room. With it obvious that Malfoy tricked them, they begin to hide and then run away. Not sure where they are going, they accidentally end up in the forbidden area on the third floor, staring at a large and scary three-headed dog (named Fluffy). The children manage to get back to their dorm safely, though they are terrified. Hermione reprimands Harry, saying they could have ended up dead, or worse, expelled. Hermione stirs Harry's curiosity by pointing out that the dog was standing on a trapdoor.\nHogwarts, Gryffindor Tower\nRon, Hermione, Malfoy, Filch, Fluffy\ntense, scared\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.",
    "search_text": "First Hand\nHarry is challenged to a duel by Malfoy, which Harry accepts. Sneaking out to attend the duel Hermione tries to talk them out of breaking the rules, but gets locked out and tags along. Malfoy doesn't show up to the duel, tipping of Filch. Trying to escape Filch they run into a giant, three headed dog (named Fluffy). The three return to Gryffindor tower without getting caught.\nHogwarts, Gryffindor Tower\nRon, Hermione, Malfoy, Filch, Fluffy\ntense, scared\n13",
    "tags": [
      "Hogwarts",
      "Gryffindor Tower",
      "Ron",
      "Hermione",
      "Malfoy",
      "Filch",
      "Fluffy",
      "tense",
      "scared"
    ],
    "importance": "Medium",
    "token_count": 407
  },
  {
    "memory_id": "Philosopher's Stone 14",
    "prompt_text": "[PERSPECTIVE: First Hand]\nHarry receives a Nimbus 2000, a racing broomstick, along with a note from Professor McGonagall summoning him to Quidditch practice. Malfoy tells Harry that first-year students are not allowed broomsticks. Malfoy then tries to report Harry to Professor Flitwick who just expresses admiration for Harry's talent having heard from McGonagall. Harry later meets Oliver Wood to learn the basics of Quidditch, including the various positions on a standard Quidditch team and the implements used in the game. Oliver explains Harry's role as a Seeker: his job is to avoid other players and catch the Golden Snitch. A Quidditch game cannot end until the Snitch is caught, making the Seeker the most important player on a team.\nHogwarts, Great Hall\nRon, McGonagall\nexcited, Happy\n\n\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.",
    "search_text": "First Hand\nHarry recieves a broom, the Nimbus 2000, as a gift from professor McGonagall, and learns the basics of Quidditch\nHogwarts, Great Hall\nRon, McGonagall\nexcited, Happy\n14",
    "tags": [
      "Hogwarts",
      "Great Hall",
      "Ron",
      "McGonagall",
      "excited",
      "Happy"
    ],
    "importance": "Medium",
    "token_count": 253
  },
  {
    "memory_id": "Philosopher's Stone 15",
    "prompt_text": "[PERSPECTIVE: First Hand]\nOn Halloween, Flitwick begins teaching his students how to make things fly, using the Wingardium Leviosa spell. Hermione is the first to succeed; Ron, offended by her air of superiority, utters a nasty comment about Hermione not having any friends that Hermione overhears. Harry notices her running off in tears.\n\nHarry and Ron arrive at the Halloween feast to hear Professor Quirrell, the teacher of Defence Against the Dark Arts, burst in and give a terrifying announcement about a twelve-foot troll in the building. As the prefects lead the students back to their dorms, Harry realises that Hermione does not know about the troll. They head off to warn her and come upon the troll. Unwittingly, they lock it in the girls' bathroom only to realise that Hermione is trapped in there with the troll. Rushing into the bathroom they first try to distract the troll by throwing things. Harry jumps on its back and inadvertently jams his wand up its nose. Ron casts Wingardium Leviosa on the trolls club, dropping it on the trolls head, knocking it out. Professor McGonagall finds them and begins to scold the boys. Hermione interjects that Harry and Ron were looking for her. She then lies, saying that she went to face the troll herself and that Ron and Harry had been trying to save her from it. At this point, Hermione befriends them.\nHogwarts, Girls Washroom\nRon, Hermione\nscared, triumphant\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.",
    "search_text": "First Hand\nAfter Hermione corrects Ron during charms class he insults her, causing Hermione to run and cry in the girls bathroom. Later, when a troll shows up, Harry and Ron work together to rescue Hermione. Hermione becomes their friend.\nHogwarts, Girls Washroom\nRon, Hermione\nscared, triumphant\n15",
    "tags": [
      "Hogwarts",
      "Girls Washroom",
      "Ron",
      "Hermione",
      "scared",
      "triumphant"
    ],
    "importance": "Medium",
    "token_count": 424
  },
  {
    "memory_id": "Philosopher's Stone 16",
    "prompt_text": "[PERSPECTIVE: First Hand]\nHarry borrows a book entitled Quidditch Through the Ages from Hermione. Professor Snape discovers Ron, Harry, and Hermione out with the book and confiscates it. Harry notices that Snape is limping. Going off to retrieve the book from Snape, Harry overhears Snape talking to Argus Filch about the fact that the three-headed dog has attacked him, leaving a cut on his leg, which makes Harry very suspicious.\n\nThe next morning, the Quidditch match begins. Harry spots the Golden Snitch early in the game and is flying toward it when the Slytherin Captain pushes him out of the way and is penalised. Later in the game, Harry's broom begins jerking uncontrollably. Hagrid comments that only Dark magic could make a broomstick so hard to manage. Hermione notices that Snape is staring at Harry and muttering to himself (Unaware Quirrell is the one hexing Harry), signs of casting a curse. Hermione rushes over to Snape in such a hurry that she knocks Quirrell over, sneaks behind Snape, and sets his robe on fire. Suddenly, the spell on Harry's broom is broken and Harry is once again in control. He starts speeding toward the ground and lands, catching the Snitch in his mouth and nearly swallowing it.\n\nHagrid takes Harry back to his hut with Hermione and Ron, who tells Harry that Snape was putting a curse on his broomstick. Hagrid does not believe this, asking why Snape would try to kill Harry. Harry tells Hagrid about Snape getting injured by the dog in the third-floor corridor. Hagrid involuntarily reveals that the three-headed dog, Fluffy, is his, and that what the dog is guarding is a secret known only to Albus Dumbledore and a man named Nicolas Flamel.\nHogwarts, The Quidditch Pitch\nHermione, Snape, Quirrell, Hagrid\ndistressed, triumphant, intrigued\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\ndumbledore also goes by the names albus dumbledore, albus.",
    "search_text": "First Hand\nDuring Harry's first Quidditch match his broom starts behaving erratically. suspecting his is being cursed by Snape, Hermione sneaks up behind him and secretly sets his robes on fire. Harry regains control of his broom, winning the match. Later, Hagrid reveals the three headed dog (Fluffy) is his, and its guarding something to do with Nicolas Flamel.\nHogwarts, The Quidditch Pitch\nHermione, Snape, Quirrell, Hagrid\ndistressed, triumphant, intrigued\n16",
    "tags": [
      "Hogwarts",
      "The Quidditch Pitch",
      "Hermione",
      "Snape",
      "Quirrell",
      "Hagrid",
      "distressed",
      "triumphant",
      "intrigued"
    ],
    "importance": "Medium",
    "token_count": 550
  },
  {
    "memory_id": "Philosopher's Stone 17",
    "prompt_text": "[PERSPECTIVE: First Hand]\nChristmas is approaching. Malfoy teases Harry about having to stay at Hogwarts for the holiday, as he does not have parents. Harry, however, is looking forward to spending Christmas away from the Dursleys, especially because Ron is also staying at Hogwarts, as Mr and Mrs Weasley are going to visit Ron's older brother Charlie in Romania. The day before the holidays, Hermione tears Ron and Harry away from a conversation with Hagrid to look in the library for more information about Nicolas Flamel. The librarian, Madam Pince, catches Harry prowling around the restricted-books section of the library and kicks him out.\n\nOn Christmas Day, Harry and Ron awaken to presents, though Harry's are fewer. Harry receives a flute from Hagrid, a 50 pence coin from the Dursleys, some fudge and Chocolate Frogs from Hermione, and a knitted jumper from Ron's mother. He also receives an Invisibility cloak accompanied only by an anonymous note telling him that the cloak once belonged to Harry's father and to \"use it well.\"\nHogwarts, Gryffindor Tower\nRon\nHappy, amazed\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.",
    "search_text": "First Hand\nHarry spends Chistmas at Hogwarts with Ron, recieving gifts from friends for the first time. He also recieves an invisibility cloak from an unknown individual.\nHogwarts, Gryffindor Tower\nRon\nHappy, amazed\n17",
    "tags": [
      "Hogwarts",
      "Gryffindor Tower",
      "Ron",
      "Happy",
      "amazed"
    ],
    "importance": "Medium",
    "token_count": 350
  },
  {
    "memory_id": "Philosopher's Stone 18",
    "prompt_text": "[PERSPECTIVE: First Hand]\nHarry tries on his Invisibility Cloak. Unseen, he is able to go to the library's restricted-books section. But one of the books starts screaming when he opens it, so he quickly leaves. Harry wonders into an empty classroom, and inside stands an old mirror in a gold frame with the inscription \"Erised stra ehru oyt ube cafru oyt on wohsi\" (\"I show not your face, but your heart's desire\"). Harry looks in the mirror and sees many people standing behind him, but when he turns around in the room, he sees no one. Suddenly, he recognises that two of the people in the mirror are his dead mother and father. He tries to speak to them, but they can only communicate by waving.\n\nThe next night, Harry brings Ron with him to the mirror. Ron does not see Harry's parents in the mirror but instead sees himself holding the Quidditch Cup. On the third night, Harry returns to the mirror alone. There he finds Albus Dumbledore. Dumbledore explains to Harry that the mirror, which is known as the Mirror of Erised, displays the deepest desires of whoever looks into it. Harry is relieved to find that Dumbledore is not angry. However, he warns Harry that men have wasted away and been driven mad before the mirror and informs Harry that the mirror will be moved to a new location and tells him not to go looking for it. When Harry asks what Dumbledore sees in the mirror, his answer is \"himself holding a pair of socks.\"\nHogwarts\nRon, Dumbledore\namazed\n\n\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\ndumbledore also goes by the names albus dumbledore, albus.",
    "search_text": "First Hand\nLate one night Harry comes across a strange mirror that, instead of displaying his reflection, shows his parents. He tries to show Ron, but Ron only sees himself holding the Quidditch Cup. Later, Dumbledore explains to Harry that the mirror shows you what you most desire.\nHogwarts\nRon, Dumbledore\namazed\n18",
    "tags": [
      "Hogwarts",
      "Ron",
      "Dumbledore",
      "amazed"
    ],
    "importance": "Medium",
    "token_count": 425
  },
  {
    "memory_id": "Philosopher's Stone 19",
    "prompt_text": "[PERSPECTIVE: First Hand]\nHarry suddenly remembers that he read the name Nicolas Flamel on a chocolate frog card, which reminds Hermione that she had seen the name in a book she picked up from the library, and the team discover that he was a famous alchemist who is the only known maker of the Philosopher's Stone, whose powers include turning any metal to gold and producing the Elixir of Life, a potion that can make the drinker immortal.\n\nThe Gryffindor versus Hufflepuff Quidditch match arrives and Snape, who referees the match, is predictably biased, while on the stands Ron and Neville get into a scuffle with Malfoy, Crabbe, and Goyle after Malfoy made some rude comments towards the players of their house's team as well as both of them. Harry catches the snitch and wins the match under five minutes, though Ron did not see this due to fighting Draco Malfoy, and Neville is sent to the hospital wing due to the injuries he sustained from fighting both Crabbe and Goyle. Later, Harry notices and follows Snape into the Forbidden Forest by broomstick where he meets Quirrell and they speak of the Philosopher's Stone. Harry thinks that Snape is trying to force Quirrell to help him get the stone so he can get rich, to the alarm of both Ron and Hermione who fear Quirrell will talk.\nHogwarts\nSnape, Quirrell\nsuspicious\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.",
    "search_text": "First Hand\nHarry discovers Nicolas Flamel is an alchemist who created the Philosophers Stone, which can make a person immortal. Later, Harry sees Snape talk about the Philosophers Stone, causing Harry to think Snape intends to steal it.\nHogwarts\nSnape, Quirrell\nsuspicious\n19",
    "tags": [
      "Hogwarts",
      "Snape",
      "Quirrell",
      "suspicious"
    ],
    "importance": "Medium",
    "token_count": 409
  },
  {
    "memory_id": "Philosopher's Stone 2",
    "prompt_text": "[PERSPECTIVE: First Hand]\nDudley is allowed to take a friend to the zoo and chooses his friend Piers Polkiss. Piers comes to the house with his mother. A half-hour later, Harry sits in the car with Dudley, Piers, Vernon, and Petunia. On the way, a motorbike overtakes them, and Vernon complains about them. Harry remarks that he has dreamed about a flying motorbike, and Vernon snappily reminds him that motorbikes do not fly. Harry thinks about all the strange things that have happened to him: he once jumped onto the school chimney and mysteriously grew all of his hair back the morning after a haircut. At the zoo, Dudley and Piers find the animals boring. Harry is left to watch a Boa constrictor as it sleeps, and when Dudley tries to make it move, it wakes up but still doesn't move. The snake begins to move after Dudley and Piers slink away. Moments later, Harry speaks to the snake and finds it miraculously understands him. Upon realising that it is now moving, Piers calls Dudley and Vernon back to the snake's exhibit. Dudley pushes Harry out of the way and he lands hard on the concrete floor Dudley presses his face against the glass. Harry becomes angry, and somehow the glass vanishes, and the snake gets out, scaring Dudley and Piers. As the snake slithers away, Harry thinks he hears it speak back to him. Piers tattletales on Harry that he had been talking to the snake, and Uncle Vernon sends him to his cupboard –with no meals for a week as cruel punishment.\nZoo\nDudley\nbored, intrigued, angry\n\n\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nvernon also goes by the names vernon dursley, mr. dursley.\npetunia also goes by the names petunia dursley, mrs. dursley, ms. dursley.",
    "search_text": "First Hand\nHarry goes to the zoo with the Dursleys, but the animals aren't very active. Harry discovers he can talk to one of the snakes, but as soon as the snake shows interest, Dudley pushes Harry aside to look at it. Harry gets mad, and the glass in the enclosure vanishes, allowing Dudley to fall in.\nZoo\nDudley\nbored, intrigued, angry\n2",
    "tags": [
      "Zoo",
      "Dudley",
      "bored",
      "intrigued",
      "angry"
    ],
    "importance": "Medium",
    "token_count": 478
  },
  {
    "memory_id": "Philosopher's Stone 20",
    "prompt_text": "[PERSPECTIVE: First Hand]\nHarry, Ron and Hermione meet with Hagrid, who confirms the Stone is being kept at Hogwarts. Hermione charms him into talking about the enchantments used to guard it: Fluffy, the three-headed dog, is Hagrid's, along with enchantments from Professors Sprout, Flitwick, McGonagall, Quirrell, and Snape. After this, Harry complains about the high temperature in Hagrid's hut, only to discover he has a Norwegian Ridgeback dragon egg, which he names Norbert once it has hatched. Malfoy, who has been spying on them, discovers the dragon. To solve the problem, they convince Hagrid to send the dragon off to Ron's brother Charlie. Ron's hand is bitten by the dragon, and he is sent off to Madam Pomfrey. Harry and Hermione smuggle Norbert in a crate up to the tallest tower under Harry's Invisibility cloak and on the way they see Professor McGonagall hauling Malfoy away to detention for being out of bed at night and speaking \"lies\" about Harry and a dragon. They pass the crate off to Charlie's friends, and head back down the stairs, where they meet up with Filch, realising too late they have left the Invisibility Cloak behind. Filch takes Harry and Hermione to McGonagall's office, where they meet Neville. McGonagall, very disappointed, takes 50 points each from the three of them and gives them all detention, which they will serve with Malfoy. Their popularity with the other students suffers because of this.\nHogwarts, Hagrids Hut\nRon, Hermione, McGonagall, Hagrid\nsurprised, guilty\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.",
    "search_text": "First Hand\nHarry learns more about the protections guarding the philosophers stone, and discovers Hagrid has an illegal dragons egg. After the egg hatches they convince Hagrid to let them send it to Ron's brother Charlie. After successfully getting rid of the dragon, Harry and Hermione are caught and punished.\nHogwarts, Hagrids Hut\nRon, Hermione, McGonagall, Hagrid\nsurprised, guilty\n20",
    "tags": [
      "Hogwarts",
      "Hagrids Hut",
      "Ron",
      "Hermione",
      "McGonagall",
      "Hagrid",
      "surprised",
      "guilty"
    ],
    "importance": "Medium",
    "token_count": 481
  },
  {
    "memory_id": "Philosopher's Stone 21",
    "prompt_text": "[PERSPECTIVE: First Hand]\nFilch takes Harry, Hermione, Neville, and Malfoy out to the Forbidden Forest to serve their detention, where Hagrid awaits to take them in to do a bit of investigating. Hagrid shows them some silver unicorn blood and says they need to find the unicorn that is hurt. They split up, with Hagrid taking Harry and Hermione, and Neville and Malfoy going with Fang. Hagrid encounters a few centaurs, named Ronan and Bane, but gets no useful information from them. Suddenly, Hagrid sees red sparks in the air, signalling the other party is in trouble. He runs for them and returns, scolding Malfoy for startling Neville into sending up the sparks. Hagrid switches Harry and Neville, sending Harry off with Malfoy instead. They eventually find the dead unicorn and see something drinking its blood. Malfoy screams and runs with Fang, leaving Harry, who is saved from the figure by a centaur, named Firenze, who tells Harry that unicorn blood can keep you alive, even if you are an inch from death, but curses you with a half-life in the process. He then reveals that the person who was drinking it was doing so to remain alive until they were able to drink the Elixir of Life and wants the Stone. He also asks Harry if he would not know anyone who has been waiting for years to regain power and Harry realises that the mysterious figure was a weakened but still alive Voldemort.\nBack in the common room, Harry tells Hermione and Ron Voldemort's in the forest and that Snape wants the Stone to help Voldemort restore his powers. Afterwards, going into his bed, Harry finds that his Invisibility Cloak has been returned to him.\nHogwarts, Forbidden Forest\nHermione, Hagrid, Voldemort, Firenze\nscared, disturbed\n\n\nvoldemort also goes by the names tom riddle, he-who-must-not-be-named, dark lord.\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.",
    "search_text": "First Hand\nHarry and Hermione have to spend their detention with Hagrid, who is looking for a wounded unicorn in the forbidden forest. Harry finds the unicorn, with a shadowy cloaked figure drinking its blood. Harry is saved from the figure by centaurs, and told that unicorn blood can prolong a persons life. Harry believes the figure to have been Voldemort.\nHogwarts, Forbidden Forest\nHermione, Hagrid, Voldemort, Firenze\nscared, disturbed\n21",
    "tags": [
      "Hogwarts",
      "Forbidden Forest",
      "Hermione",
      "Hagrid",
      "Voldemort",
      "Firenze",
      "scared",
      "disturbed"
    ],
    "importance": "Medium",
    "token_count": 542
  },
  {
    "memory_id": "Philosopher's Stone 22",
    "prompt_text": "[PERSPECTIVE: Second Hand]\nAfter finishing their exams, Harry realises the suspicious coincidence in Hagrid wanting a dragon more than anything else, only to meet a stranger who had one to give him. He, Ron, and Hermione run to ask him about the man who gave Norbert to him, and he says he never saw his face because he kept his hood up. Hagrid also mentions that they talked about Hogwarts and Fluffy the three-headed dog. He also mentions that the stranger gave him drinks while getting information out of him. Hagrid lets it slip how to get past Fluffy, which sends Harry, Ron and Hermione off. They head for Dumbledore's office, only to see McGonagall, who tells them he has left for London. After Harry reveals that they know about the Stone, McGonagall insists no one could steal the Stone. The trio realise that Dumbledore has been lured away and that Snape's going after the Stone that night so they decide to head out that night to try to get it themselves. After Hermione curses Neville in a Full Body-Bind Curse for refusing to allow them to leave, they head up to the third-floor room and start their intense trip into the seven Philosopher's Stone Chambers. They find the door ajar, and a harp in the room. Harry plays the flute Hagrid got him for Christmas, and Fluffy goes back to sleep. They head down through the trapdoor. They land in Professor Sprout's room, full of Devil's Snare, which almost smothers them before Hermione lights a fire and drives it off.\nHogwarts\nRon, Hermione, Fluffy\ndetermined, surprised, tense\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\ndumbledore also goes by the names albus dumbledore, albus.",
    "search_text": "Second Hand\nAfter discovering that Hagrid let slip how to get past Fluffy, Harry, Ron, and Hermione decide to stop Voldemort themselves. They lull the three headed dog to sleep by playing the flute, and pass through the trap door. They get tangled in Devil Snare, but Hermione's knowledge allows them to escape unharmed.\nHogwarts\nRon, Hermione, Fluffy\ndetermined, surprised, tense\n22",
    "tags": [
      "Hogwarts",
      "Ron",
      "Hermione",
      "Fluffy",
      "determined",
      "surprised",
      "tense"
    ],
    "importance": "Medium",
    "token_count": 473
  },
  {
    "memory_id": "Philosopher's Stone 23",
    "prompt_text": "[PERSPECTIVE: First Hand]\nThe next room, Professor Flitwick's, holds a bunch of flying keys and some broomsticks. Harry finds a silver one with a broken wing that is different from the others and uses a nearby broom and skills as a Seeker to catch it, unlocking the next door with it. The next room is Professor McGonagall's, and has a large chessboard, for a game of Wizard's Chess that requires Harry, Ron, and Hermione to play as pieces. Ron uses his skill at chess to help them win, at the cost of having to sacrifice himself and getting knocked out. Harry and Hermione continue to the next room, Professor Quirrell's, where they find an unconscious troll laying on the floor. Lastly, they enter Professor Snape's room and find seven potions in bottles along with a roll of paper giving clues on which one to drink to continue, noting that three bottles have poison, two have nettle wine, one will send the drinker back, and the other will let the drinker move forward into the next room. Hermione tells Harry that it is a test of logic and not magic wherein most wizards fail. She solves the puzzle, and at Harry's instruction, drinks the one that will allow her to head back through the purple flame, while Harry drinks the one to head into the black flame and into the final room.\nHogwarts\nRon, Hermione\nDetermined\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.",
    "search_text": "First Hand\nHarry, Ron, and Hermione work their way through the obstacles keeping them from the philosophers stone. Harry uses his skills flying a broom to catch a flying key, Ron uses his skills at Wizard chess, sacrificing himself, and Hermione completes a logic puzzle. Harry continues on alone.\nHogwarts\nRon, Hermione\nDetermined\n23",
    "tags": [
      "Hogwarts",
      "Ron",
      "Hermione",
      "Determined"
    ],
    "importance": "Medium",
    "token_count": 392
  },
  {
    "memory_id": "Philosopher's Stone 24",
    "prompt_text": "[PERSPECTIVE: First Hand]\nAs Harry enters the final chamber, where the philosophers stone is kept, it is Quirrell whom Harry sees in the room, not Snape. Harry, astonished, hears Quirrell tell him that, next to Snape, no one would expect him to try to steal the Stone and that Snape was actually protecting Harry. Harry notices the Mirror of Erised, and Quirrell stops to examine it, saying it is the key to getting the Stone. Harry questions Quirrell, who says he is serving Lord Voldemort, and although Snape hated Harry because of his father, he never wanted Harry dead. He explains how Snape and Harry's father went to school together when they were younger, and how it was there where their hatred against each other started. Quirrell asks for help from his master to get the Stone, and a snake-like voice tells him to use the boy. Harry is told to look into the Mirror. He sees his reflection pull the Stone out of his pocket and put it back in, and Harry feels it drop into his own pocket. He tells Quirrell that he sees himself shaking hands with Dumbledore, after winning the House Cup for Gryffindor. The snake-like voice tells Quirrell Harry is lying and Quirrell takes his turban off to show Harry what lies on the back of his head. Harry is shocked to see another face where the back of Quirrell's head should be. The face has red eyes and a snake-like slit where the nose should be. Harry realises this is the face of Voldemort and Voldemort demands Harry give him the Stone. Harry refuses and runs, but Quirrell seizes him. However, the contact with Harry's skin burns Quirrell and causes him to have boils all over the area in which Harry touched him. Harry grabs Quirrell's face, then his arm, and holds on, with the blinding pain in his scar building, until he feels the arm wrenched away before he blacks out.\nHogwarts\nQuirrell\nshock, brave, determined\n\n\nvoldemort also goes by the names tom riddle, he-who-must-not-be-named, dark lord.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\ndumbledore also goes by the names albus dumbledore, albus.\nphilosophers stone also goes by the names sorcerers stone.",
    "search_text": "First Hand\nUpon entering the final chamber where the philosophers stone is kept, Harry is shocked to discover it is Quirrell helping Voldemort, and that Snape has been trying to pretect Harry the whole time. Voldemort is revealed to be attached to the back of Querrill's head, and as Quirrell tries to take the stone, Harry passes out.\nHogwarts\nQuirrell\nshock, brave, determined\n24",
    "tags": [
      "Hogwarts",
      "Quirrell",
      "shock",
      "brave",
      "determined"
    ],
    "importance": "Medium",
    "token_count": 555
  },
  {
    "memory_id": "Philosopher's Stone 25",
    "prompt_text": "[PERSPECTIVE: First Hand]\nHarry awakes in the hospital wing with Dumbledore there, telling him Quirrell did not succeed at getting the Stone, and indeed the Stone has been destroyed. In spite of this, there are other ways in which Voldemort can return. He cannot be killed, and he left Quirrell to die. Dumbledore explains the reason why Quirrell could not touch Harry was because Harry's mother had died to save him, protecting him with her love. Harry also told Dumbledore about what Quirrell mentioned to him earlier regarding Snape hating Harry due to hatred for his father. Dumbledore responds that Snape was only grudgingly protecting Harry this year to pay off a debt he owed due to James Potter saving his life during their Hogwarts years. Harry then receives a visit from Ron and Hermione. Hagrid shows up later and gives Harry a book of photos of his parents and family.\n\nThe following day, at the end of term feast, Dumbledore awards some last-minute points for the recent events. He gives Ron and Hermione fifty points each, and Harry sixty, which places them in a tie with Slytherin for first place. Dumbledore then recognises that while it is hard to stand up to enemies, it is even harder to stand up to friends as Neville did, and he awards Neville 10 more points. This puts Gryffindor in the lead and the winners of the House Cup, to much rejoicing from everyone but the Slytherins. Not only were Gryffindor students happy, but Hufflepuff and Ravenclaw were happy to see Slytherins downfall. Soon, their trunks are all packed, and they take the Hogwarts Express back towards the muggle world. Harry, Ron and Hermione all say their goodbyes before heading home.\nHogwarts, Hospital Wing\nDumbledore, Ron, Hermione\nrelieved, celebratory\n\n\nvoldemort also goes by the names tom riddle, he-who-must-not-be-named, dark lord.\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\ndumbledore also goes by the names albus dumbledore, albus.",
    "search_text": "First Hand\nHarry wakes up in the hospital wing of Hogwarts, where Dumbledore informs Harry that Voldemort was defeated, but that he is likely to return. Harry attends the end of year feast, in which Gryffindor is awarded enough house points to win the house cup. Harry then says goodbye to Hermione and Ron before returning home.\nHogwarts, Hospital Wing\nDumbledore, Ron, Hermione\nrelieved, celebratory\n25",
    "tags": [
      "Hogwarts",
      "Hospital Wing",
      "Dumbledore",
      "Ron",
      "Hermione",
      "relieved",
      "celebratory"
    ],
    "importance": "Medium",
    "token_count": 551
  },
  {
    "memory_id": "Philosopher's Stone 3",
    "prompt_text": "[PERSPECTIVE: First Hand]\nOne day during the summer, Harry is told to get the post for Uncle Vernon. When Harry goes to get the mail, there are three letters: a postcard, a letter that looks like a bill, and a letter for Harry.\n\nHarry can't believe it. He has never had a letter in his life. Harry returns to the kitchen and starts to open his letter. Dudley soon sees that Harry has a letter, and Uncle Vernon snatches it from him to read it with Aunt Petunia. Uncle Vernon tells Harry and Dudley to get out of the kitchen, so they both go and stand in the hall.\n\nLater, when Harry is in his cupboard, Uncle Vernon comes in and says that he has burned the letter and that they are moving him up to Dudley's second bedroom. The next morning at breakfast, Dudley is asked to get the post by Uncle Vernon. Dudley calls out that another letter is addressed to Harry, this time in '''The Smallest Bedroom''' rather than '''The Cupboard Under the Stairs'''. Both Harry and Uncle Vernon rush to the hallway in an attempt to get the letter. After a minute of confused fighting, Uncle Vernon emerges, clutching the letter in his hand.\n\nEvery day, letters appear addressed to Harry, doubling in number. But they begin to appear in the strangest places, with Aunt Petunia even finds some while cracking open eggs. Finally, they get attacked by thirty or forty letters being fired out of the fireplace. Harry still does not manage to get his hands on one of the letters long enough to read it, and a furious Uncle Vernon states that they are leaving the house. They get into their car and leave ten minutes later.\nPrivet Drive\nVernon\nCurious, disappointed, determined.\n\n\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nvernon also goes by the names vernon dursley, mr. dursley.\npetunia also goes by the names petunia dursley, mrs. dursley, ms. dursley.",
    "search_text": "First Hand\nHarry is surprised to recieve a mysterious letter in the mail, but before he can read it, Vernon destroys it. However, more and more letters keep arriving, to the point where Vernon decides the only was to escape them is to leave the house entirely.\nPrivet Drive\nVernon\nCurious, disappointed, determined.\n3",
    "tags": [
      "Privet Drive",
      "Vernon",
      "Curious",
      "disappointed",
      "determined."
    ],
    "importance": "Medium",
    "token_count": 481
  },
  {
    "memory_id": "Philosopher's Stone 4",
    "prompt_text": "[PERSPECTIVE: First Hand]\nIn an attempt to escape the letters arriving for Harry, the Dursleys head to a remote cabin on a small rock island. Harry remembers that the next day will be his eleventh birthday. There is a loud knocking at the door.\n\nUncle Vernon comes through with Aunt Petunia cowering behind him. The door is blasted off its hinges and hits the floor. The giant turns his eyes to Harry and greets him, saying he hasn't seen him since he was a baby. The giant presents Harry with a birthday cake. Harry asks the giant who he is, and he says he is Rubeus Hagrid, the Keeper of Keys and Grounds at Hogwarts School of Witchcraft and Wizardry. He is shocked to discover that Harry knows nothing about Hogwarts. He gets angry at the Dursleys for not telling him anything about his parents' world, his world. Hagrid tells Harry his parents are famous and that he's a wizard. Hagrid gives Harry the letter that he has been craving. It tells him that he has been accepted into Hogwarts School of Witchcraft and Wizardry.\n\nUncle Vernon tells Hagrid that Harry won't be going, but the giant knows that a Muggle like him can't stop Harry from going to Hogwarts. Uncle Vernon reveals he knew that Harry's a wizard, and Aunt Petunia tells Harry that her sister, Harry's mother, was a witch. Petunia said another wizard killed them, and Harry screams that Petunia said they got killed in a car crash. Hagrid is as outraged as Harry is that the Dursleys have lied that much. He sits down and tells Harry that a Dark wizard named Lord Voldemort killed Harry's parents and tried to kill Harry too. But the spell he used backfired, only leaving Harry his scar. Voldemort vanished and hasn't been seen since.\n\nHarry doubts he is a wizard until Hagrid asks if he ever made anything he couldn't explain happen when he was angry or scared. When Uncle Vernon makes the mistake of mocking Dumbledore, Hagrid swishes the umbrella in Dudley's direction, and Dudley sprouts a curly pig's tail. Hagrid asks Harry not to mention it at Hogwarts.\nIsland Cabin\nHagrid, Vernon, Petunia\nSurprise, wonder\n\n\nvoldemort also goes by the names tom riddle, he-who-must-not-be-named, dark lord.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\ndumbledore also goes by the names albus dumbledore, albus.\nvernon also goes by the names vernon dursley, mr. dursley.\npetunia also goes by the names petunia dursley, mrs. dursley, ms. dursley.",
    "search_text": "First Hand\nWhen the Dursleys go to a remote cabin to hide from the unending letters, Hagrid arrives to deliver one in person. He tells Harry he is a wizard and about his family history, and that he will be attending Hogwarts School of Witchcraft and Wizardry, despite Vernon's protests.\nIsland Cabin\nHagrid, Vernon, Petunia\nSurprise, wonder\n4",
    "tags": [
      "Island Cabin",
      "Hagrid",
      "Vernon",
      "Petunia",
      "Surprise",
      "wonder"
    ],
    "importance": "Medium",
    "token_count": 688
  },
  {
    "memory_id": "Philosopher's Stone 5",
    "prompt_text": "[PERSPECTIVE: First Hand]\nWhen Harry wakes the following day, he hears a tapping noise coming from the window and lets in an owl. The owl drops a newspaper on Hagrid's lap and begins to claw Hagrid's coat. Hagrid tells Harry to pay the owl, so Harry does what he says, and the owl leaves. Hagrid tells him they have to go and buy his things, but Harry worries because he hasn't got any money. Hagrid tells him his parents didn't leave him without money and that their first stop is Gringotts, the wizard's bank. Hagrid says Dumbledore also needs something from Gringotts, so Hagrid has to go get it.\n\nAs they pass through London, people often stare at Hagrid due to his size and his pointing out things that Muggles are brilliant at inventing. Harry asks if there are Dragons guarding Gringotts. Hagrid says yes and mutters that he would like a dragon. Harry takes out his list and reads it out. It says he needs a set of robes, a pointed hat, dragon hide gloves, and a winter coat. There is a list of his books and stationary equipment. Hagrid leads them both into a pub called the Leaky Cauldron Harry did not notice was there. A man with a turban approaches them, and Hagrid introduces Harry to Quirinus Quirrell, the Defence Against the Dark Arts professor at Hogwarts. They talk for a bit then Hagrid steers them out a back door into a small enclosed area with a few barrels. Hagrid takes out his umbrella and taps bricks with it, counting an order. Once he is done, a hole appears in the brick wall, slowly getting bigger, until the wall disappears entirely, revealing a crowded street with people wearing robes everywhere with shops left and right. Hagrid tells Harry the street is called Diagon Alley.\nDiagon Alley\nHagrid, Quirrell\nawe, excitement\n\n\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\ndumbledore also goes by the names albus dumbledore, albus.",
    "search_text": "First Hand\nHagrid takes Harry to Diagon Alley to shop for school supplies. Harry expresses concern that he doesn't have money for school supplies, only for Hagrid to inform him that his parents left him plenty of money, and they are going to Gringotts bank to get some.\nDiagon Alley\nHagrid, Quirrell\nawe, excitement\n5",
    "tags": [
      "Diagon Alley",
      "Hagrid",
      "Quirrell",
      "awe",
      "excitement"
    ],
    "importance": "Medium",
    "token_count": 525
  },
  {
    "memory_id": "Philosopher's Stone 6",
    "prompt_text": "[PERSPECTIVE: First Hand]\nWhile walking down the street, Harry is trying to look everywhere around him, taking in as much as possible. At the end of Diagon Alley is a huge snowy white building: Gringotts Bank. A warning echoes as they enter, telling them to rob at their own risk. Harry and Hagrid go up to a Goblin and explain they need to take some money out of Harry's vault. The Goblin asks for Harry's key, and Hagrid presents it after sorting through many other keys. The Goblin calls upon another Goblin named Griphook to take them down to the vault. Hagrid also states they must be taken down to remove the You-Know-What in Vault 713. Griphook takes them to Harry's vault, where there is a large amount of money piled up there that Harry owns. There are Bronze Knuts, Silver Sickles, and Gold Galleons. Harry and Hagrid take some money for Harry's list, then leave Gringotts. Hagrid has to stand for a bit as the cart rides that takes them to the vaults make him feel sick. Griphook then takes them to Vault 713, where Hagrid removes a grubby little package but can't tell Harry it is the pholosophers stone.\nDiagon Alley, Gringotts\nHagrid\namazed, curious\n\n\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.",
    "search_text": "First Hand\nHagrid takes Harry to Gringotts to collect money for him to purchase school supplies, stopping by another vault so Hagrid can pick up a mysterious package containing the pholosophers stone for Dumbledore.\nDiagon Alley, Gringotts\nHagrid\namazed, curious\n6",
    "tags": [
      "Diagon Alley",
      "Gringotts",
      "Hagrid",
      "amazed",
      "curious"
    ],
    "importance": "Medium",
    "token_count": 374
  },
  {
    "memory_id": "Philosopher's Stone 7",
    "prompt_text": "[PERSPECTIVE: First Hand]\nHarry and Hagrid travel around Diagon Alley, picking up various things Harry will need for school. They continue shopping until all Harry needs is his wand and (Hagrid insists) a birthday present. \n\nIn Ollivanders, the wand shop, Mr Ollivander puts Harry off with his creepy demeanour while discussing the wands purchased by Hagrid, Harry's parents, and Voldemort. Ollivander touches Harry's scar and apologises for the fact that he sold the wand that caused it. Ollivander gives Harry a wand and tells him to give it a wave. Harry does so, but it isn't suitable for him, so Ollivander takes it back. Harry tries many wands, but none work well enough for him. Eventually, he picks up a wand and feels warmth in his fingers. Ollivander states that it is very curious that Harry should be destined for that wand when its brother gave Harry his scar. \n\nFor Harry's birthday, Hagrid buys Harry a snowy owl named Hedwig. Hagrid provides Harry with a train ticket, giving him the date, time, and location to catch the Hogwarts Express and tells Harry that if he ever needs anything, he is to write a letter, and Hedwig will know where to find him. Harry catches a train back to the Dursleys.\nDiagon Alley, Ollivander's wand shop\nOllivander, Hagrid\namazed, happy\n\n\nvoldemort also goes by the names tom riddle, he-who-must-not-be-named, dark lord.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.",
    "search_text": "First Hand\nHarry and Hagrid shop for school supplies, eventually reaching Ollivander's wand shop. After trying many wands Harry finds one that responds well to him, and Ollivander informs him that his wand is a \"brother\" of Voldemorts. Hagrid buys Harry an owl named Hedwig.\nDiagon Alley, Ollivander's wand shop\nOllivander, Hagrid\namazed, happy\n7",
    "tags": [
      "Diagon Alley",
      "Ollivander's wand shop",
      "Ollivander",
      "Hagrid",
      "amazed",
      "happy"
    ],
    "importance": "Medium",
    "token_count": 401
  },
  {
    "memory_id": "Philosopher's Stone 8",
    "prompt_text": "[PERSPECTIVE: First Hand]\nHarry arrives at King Cross station to depart for Hogwarts. He stands between Platforms Nine and Ten, wondering how to find Platform Nine and Three-Quarters. He overhears Molly Weasley using the word \"muggles\" and asks her for help. She tells him to run through the barrier between Platforms Nine and Ten, which he does, and he is astonished to find the train to Hogwarts on the other side of the station. \n\nHarry and Ron get on the train together, and bond over their anxiety about Hogwarts, and Harry buys a lot of sweets for them to share. Ron introduces Harry to elements of the wizarding world like Quidditch, Bertie Bott's Every Flavour Beans, and Famous Witches and Wizards cards. One of Harry's cards bears the picture of Albus Dumbledore.\n\nHarry also meets a slightly annoying, overachieving girl named Hermione Granger, a boy named Neville Longbottom who has lost his toad, Trevor. Hermione shows off her magical knowledge and strong personality, impressing Harry and slightly irritating Ron. \n\nLater, Draco Malfoy enters and offers to “help” Harry make the right friends, insulting Ron and Hagrid. Harry refuses his handshake, marking the beginning of their rivalry.\nKings Cross, Platform Nine and Three Quarters, Hogwarts Express\nRon, Hermione, Neville, Malfoy\nawe, excited, happy\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\ndumbledore also goes by the names albus dumbledore, albus.\nmolly also goes by the names molly weasley, mrs. weasley, ms. weasley.",
    "search_text": "First Hand\nHarry, confused about how to get to platform nine and three quarters, seeks the help of Molly Weasley. Boarding the train, Harry and Ron discuss things until Hermione and Neville interrupt. Later, Malfoy insults Ron while offering Harry friendship, which Harry rejects.\nKings Cross, Platform Nine and Three Quarters, Hogwarts Express\nRon, Hermione, Neville, Malfoy\nawe, excited, happy\n8",
    "tags": [
      "Kings Cross",
      "Platform Nine and Three Quarters",
      "Hogwarts Express",
      "Ron",
      "Hermione",
      "Neville",
      "Malfoy",
      "awe",
      "excited",
      "happy"
    ],
    "importance": "Medium",
    "token_count": 465
  },
  {
    "memory_id": "Philosopher's Stone 9",
    "prompt_text": "[PERSPECTIVE: First Hand]\nThe Hogwarts Express arrives at Hogsmeade Station, and Hagrid escorts the first years across the Lake in boats, where they catch their first glimpse of Hogwarts.\n\nThe new students are greeted at the castle door by Professor Minerva McGonagall, who tells them they will soon be sorted into their houses. All Hogwarts students live in one of four residences: Gryffindor, Hufflepuff, Ravenclaw, or Slytherin, with each house having its own team for Quidditch. The houses are in a yearlong competition with one another to acquire the most points, which are earned by success in Quidditch games and given by teachers for academic achievement and lost for student infractions, in order to win the House Cup awarded at the end of the year.\n\nThe first-years wait in an antechamber while McGonagall checks to see whether it is time yet. The Hogwarts ghosts glide into the room by mistake while debating whether to offer Peeves another chance.\n\nThe students are led to the Great Hall, where the entire school and a battered old hat on a stool are waiting for them. When the students try on the Sorting Hat, it announces the house in which they are placed. Harry becomes very nervous. He has learned that he does not care for Slytherin house, as the students in it are unpleasant and Voldemort once belonged to Slytherin. Hermione is Sorted into Gryffindor, much to Ron's displeasure. Finally, it is Harry's turn to wear the hat. He quietly says to himself \"not Slytherin, not Slytherin!\" The Hat is intrigued by this. \n\nAfter a brief mental discussion with the hat in which it tries to suggest Slytherin to him, the hat places Harry in Gryffindor. Harry is pleased to find that Ron joins in Gryffindor with him. Draco Malfoy is placed in Slytherin.\nHogwarts, Great Hall\nRon, Hermione, Malfoy\nexcited, nervous, celebratory\n\n\nvoldemort also goes by the names tom riddle, he-who-must-not-be-named, dark lord.\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.",
    "search_text": "First Hand\nHarry and the other first years are welcomed to Hogwarts, and are informed they are to be sorted into the four houses of Hogwarts. The sorting hat is placed on their head, and after some deliberation, the hat sorts Harry, Ron, and Hermione into Gryffindor, and Malfoy into Slytherin.\nHogwarts, Great Hall\nRon, Hermione, Malfoy\nexcited, nervous, celebratory\n9",
    "tags": [
      "Hogwarts",
      "Great Hall",
      "Ron",
      "Hermione",
      "Malfoy",
      "excited",
      "nervous",
      "celebratory"
    ],
    "importance": "Medium",
    "token_count": 583
  },
  {
    "memory_id": "Prisoner of Azkaban 48",
    "prompt_text": "[PERSPECTIVE: First Hand]\nHarry Potter spends another summer holiday with the Dursleys. Over the summer, the Dursleys have forbidden him to talk to any of the neighbours or accessing his magic supplies, which was a real problem for Harry, because his teachers at Hogwarts School of Witchcraft and Wizardry have given him a lot of summer homework. He has to sneak some of his books into his room to study in secret. The only improvement in his relationship to the Dursleys that gets changed is that they have given him permission to let his pet snowy owl Hedwig out at night with a promise not to use her to send letter to Ron or Hermione, since Uncle Vernon couldn't take the screeching racket the owl makes while bored if she gets locked in her cage all the time.\n\nOn Harry's thirteenth birthday, after midnight, Harry receives gifts and letters from Ron, Hermione, and Rubeus Hagrid, each wishing him a happy birthday and sending him a gift. Both Ron and Hermione mention in their letters they will be in London on the last week before term to pick up their school supplies and want Harry to join them. Hagrid hints in his letter the book he sent Harry will come in handy next term but he wants the reason for it to be a surprise until the term starts. Another letter from Professor Minerva McGonagall arrives, saying that third years are allowed to visit the village of Hogsmeade and that their guardian needs to sign the permission form in order for them to do so.\nPrevit Drive\nVernon, Petunia\nbored\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\nvernon also goes by the names vernon dursley, mr. dursley.\npetunia also goes by the names petunia dursley, mrs. dursley, ms. dursley.",
    "search_text": "First Hand\nDuring summer with the Dursleys, Harry secretly studies since they forbid him access to his magic supplies. On his 13th birthday, he receives gifts and letters from Ron, Hermione, and Hagrid, plus a Hogsmeade permission slip from McGonagall requiring his guardian’s signature.\nPrevit Drive\nVernon, Petunia\nbored\n48",
    "tags": [
      "Previt Drive",
      "Vernon",
      "Petunia",
      "bored"
    ],
    "importance": "Medium",
    "token_count": 482
  },
  {
    "memory_id": "Prisoner of Azkaban 49",
    "prompt_text": "[PERSPECTIVE: First Hand]\nWhen Harry awakes the next morning, he goes downstairs hoping to watch TV. Unfortunately for him, he finds his Uncle Vernon and Dudley already watching the news and sits down with them unnoticed as the channel's anchorman is halfway through the report on word from the Muggle Prime Minister out on the London streets of an escaped convict, Sirius Black, who Uncle Vernon comments looks like he came from an asylum rather than a prison. This is obviously because the mental state of Black's gaunt face and elbow-length hair is almost like comparing him to Harry, who luckily feels well groomed. The reporter then transitions to his report on the Ministry of Agriculture and Fisheries' announcement without implying beforehand which prison or asylum Black has escaped from, much to Uncle Vernon's confusion.\nNonetheless, Vernon announces to the family that his sister, Marjorie \"Marge\" Dursley, is coming to visit for a week. Harry agrees to behave normally during her visit, if his uncle will sign his permission form and has to send Hedwig to the Weasleys for the week due to Marge not knowing that Harry is a wizard. On the final night, when she calls his father, James Potter, a lazy good for nothing drunk, Harry loses his temper and accidentally inflates her with magic. Harry decides to take his school things and run away, fearing he will almost certainly be expelled from Hogwarts, after using magic outside school.\nPrivet Drive\nVernon, Petunia, Marge\nFurious\n\n\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nvernon also goes by the names vernon dursley, mr. dursley.\npetunia also goes by the names petunia dursley, mrs. dursley, ms. dursley.\nsirius also goes by the names sirius black, padfoot, snuffles, stubby boardman.",
    "search_text": "First Hand\nHarry hears a news report about escaped convict Sirius Black before learning Aunt Marge will visit. Hoping for a signed Hogsmeade form, he agrees to behave, but loses control when she insults his father, accidentally inflating her. Fearing expulsion for using magic, Harry packs and runs away.\nPrivet Drive\nVernon, Petunia, Marge\nFurious\n49",
    "tags": [
      "Privet Drive",
      "Vernon",
      "Petunia",
      "Marge",
      "Furious"
    ],
    "importance": "Medium",
    "token_count": 453
  },
  {
    "memory_id": "Prisoner of Azkaban 50",
    "prompt_text": "[PERSPECTIVE: First Hand]\nHe reaches Magnolia Crescent and sees a black dog staring at him. In his shock, Harry falls and the Knight Bus, a triple-decker bus designed for wizard transportation, arrives. The dog vanishes and is nowhere in sight. Harry meets the Knight Bus's conductor, Stan Shunpike and the driver, Ernie Prang. Harry departs on the Knight Bus to the Leaky Cauldron in London. He learns from the Daily Prophet, Sirius Black, the same convict and a follower of Lord Voldemort, broke out of Azkaban, the first person to ever do so. Sirius was imprisoned for murdering thirteen people with a single curse in 1981, right after the Potters' murder. At the Leaky Cauldron, he meets the Minister for Magic, Cornelius Fudge, in person, though Harry has to pretend that he doesn't know him since Harry and Ron were technically breaking school rules during their previous school year when they saw him in Hagrid's Hut. After explaining that Marge has been restored to normal and her memory modified, to Harry's surprise, Fudge doesn't take any action against him stating that accidental uses of magic don't count as violations of the Decree for the Reasonable Restriction of Underage Sorcery. Fudge books a room for Harry, where he will stay for the rest of the summer, but refuses to sign Harry's Hogsmeade permission slip.\nLeaky Cauldron\nFudge, Sirius\nshock, relief\n\n\nvoldemort also goes by the names tom riddle, he-who-must-not-be-named, dark lord.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\nsirius also goes by the names sirius black, padfoot, snuffles, stubby boardman.",
    "search_text": "First Hand\nAfter seeing a black dog, Harry accidentally summons the Knight Bus to the Leaky Cauldron. There, he learns Sirius Black escaped Azkaban after killing thirteen people in 1981. Minister Fudge excuses Harry’s magic use, arranges his stay for the summer, but refuses to sign his Hogsmeade permission slip.\nLeaky Cauldron\nFudge, Sirius\nshock, relief\n50",
    "tags": [
      "Leaky Cauldron",
      "Fudge",
      "Sirius",
      "shock",
      "relief"
    ],
    "importance": "Medium",
    "token_count": 456
  },
  {
    "memory_id": "Prisoner of Azkaban 51",
    "prompt_text": "[PERSPECTIVE: First Hand]\nHarry meets up with Ron, Hermione and the rest of the Weasleys who are also staying at the Leaky Cauldron. Much to Ron's displeasure, Hermione purchases a cat named Crookshanks, who harasses Ron's pet rat Scabbers. At some point during the night, Harry overhears a conversation between Ron's parents, Arthur and Molly Weasley. From what he hears, he learns that when Voldemort met his downfall, Black lost everything, and is now trying to kill Harry. He is unconcerned about Black, doubting that the escapee could harm him at Hogwarts with Dumbledore around.\n\nThe next day, Arthur tries to warn Harry about Black and Harry tells him that he already knows because he heard Mr and Mrs Weasley talking about it earlier. On the train, Harry, Ron, and Hermione share a compartment with Professor Remus Lupin, the new Defence Against the Dark Arts teacher. After several hours, the train stops and a sinister, cloaked figure enters. It sucks the happiness out of Harry, who faints. The creature then approaches Harry, possibly to kiss him, until Lupin drives it off with a spell.\nAfter Harry recovers, Lupin hands him and the others some chocolate and explains that the creature was a Dementor, one of the Azkaban Guards, and that they were searching the train for Sirius Black. At Hogwarts, Draco Malfoy taunts Harry over his reaction to the Dementor. After McGonagall speaks with Hermione about her school schedule, they return to the Great Hall to find that they missed the sorting ceremony. Dumbledore announces the two changes in staffing during the year: Lupin, and Hagrid, who has been made the Care of Magical Creatures teacher due to the retirement of Professor Kettleburn. Dumbledore also announces that Dementors are to be stationed around the school as a precaution against Black.\nHogwarts Express, Hogwarts\nHermione, Lupin, Ron, McGonagall\nHappy, distressed\n\n\nvoldemort also goes by the names tom riddle, he-who-must-not-be-named, dark lord.\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\ndumbledore also goes by the names albus dumbledore, albus.\nmolly also goes by the names molly weasley, mrs. weasley, ms. weasley.\nsirius also goes by the names sirius black, padfoot, snuffles, stubby boardman.",
    "search_text": "First Hand\nHermione buys a cat, Crookshanks, who targets Ron’s rat, Scabbers. Harry overhears the Weasleys saying Sirius Black wants to kill him. On the train to Hogwarts, a Dementor attacks, causing Harry to faint until Lupin drives it off. At school, Dumbledore announces Dementor security.\nHogwarts Express, Hogwarts\nHermione, Lupin, Ron, McGonagall\nHappy, distressed\n51",
    "tags": [
      "Hogwarts Express",
      "Hogwarts",
      "Hermione",
      "Lupin",
      "Ron",
      "McGonagall",
      "Happy",
      "distressed"
    ],
    "importance": "Medium",
    "token_count": 653
  },
  {
    "memory_id": "Prisoner of Azkaban 52",
    "prompt_text": "[PERSPECTIVE: First Hand]\nLessons start and Harry, Ron and Hermione head to the North Tower for their first Divination lesson. They meet Sybill Trelawney and predict future events using tea leaves. Harry sees a black dog in his tea cup, which Trelawney identifies as the Grim, the omen of death. This worries Harry, as he remembers the black dog he saw when he ran away. In their Care of Magical Creatures lesson, Hagrid teaches them about hippogriffs (horse/eagle hybrid creatures).\nAlthough initially nervous, Harry successfully approaches and rides a grey hippogriff named Buckbeak. Later in the lesson, Malfoy, who had not been listening to Hagrid's lecture, insults Buckbeak, causing it to slash his arm with its talons. He is taken to the hospital wing, and Hagrid fears that he will take the blame for letting Buckbeak attack Malfoy, even though Malfoy provoked it in the first place. Harry and his friends offer to help him clear Buckbeak.\n\nLater in the week, in Potions, Malfoy returns with a heavily bandaged arm. Although it is implied that he is exaggerating the seriousness of the injury, there is no way to prove it. Harry learns that Black has been sighted near Hogwarts. During the lesson, Malfoy hints that Black may be connected to Harry's past. In Defence against the Dark Arts, Lupin teaches the third years about Boggarts, shape-shifters that take the shape of a person's worst fear. The class then take on the Boggart, forcing it to assume a shape they find amusing. When it comes to Harry's turn he is sure the Boggart will turn into a Dementor but Lupin jumps in and repels the Boggart for him. Faced by Lupin, the Boggart takes the shape of a bright glowing orb. Harry is disappointed that Lupin does not let him fight the Boggart, thinking that Lupin feels he is not up to the task.\nHogwarts\nTrelawney, Lupin, Hagrid, Malfoy\nconcerned, disappointed\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.",
    "search_text": "First Hand\nIn Divination, Trelawney predicts death for Harry after seeing a black dog in his tea leaves. In Care of Magical Creatures, Harry rides Buckbeak, but Malfoy provokes it and is injured by it, threatening trouble for Hagrid. Lupin’s Defence class faces a Boggart; he stops Harry from confronting it, which disappoints Harry.\nHogwarts\nTrelawney, Lupin, Hagrid, Malfoy\nconcerned, disappointed\n52",
    "tags": [
      "Hogwarts",
      "Trelawney",
      "Lupin",
      "Hagrid",
      "Malfoy",
      "concerned",
      "disappointed"
    ],
    "importance": "Medium",
    "token_count": 566
  },
  {
    "memory_id": "Prisoner of Azkaban 53",
    "prompt_text": "[PERSPECTIVE: First Hand]\nIn October, the Gryffindor Quidditch team practises hard for the upcoming Quidditch season, especially since this is their team captain Oliver Wood's final year at Hogwarts. Oliver believes that their team should be able to win the Quidditch Cup before he graduates. Third years are also visiting Hogsmeade on Hallowe'en, and only Harry is not allowed, because his uncle did not sign his permission form. Harry spends the day in Lupin's office, drinking tea with him. Lupin tells him that he did not let Harry face the Boggart because he mistakenly believed the Boggart would become Lord Voldemort. Harry believes it would have become a Dementor. Shortly afterwards, Snape appears with a mysterious potion for Lupin. Lupin claims to simply have an illness, and that he is aided by the potion.\n\nA few hours later, Ron and Hermione return. They reach the portrait of the Fat Lady and see it slashed and that the Fat Lady is gone. Peeves reveals that he saw her fleeing through another portrait after Sirius Black attacked her for not letting him into Gryffindor Tower. Dumbledore, Argus Filch, and Percy seek her out.\n\nEvery student is moved in the Great Hall to sleep while teachers search the castle. They fail to find any sign of Black. Nobody talks about anything but Sirius Black for the next few days. The Fat Lady refuses to return to work until Black is caught. Because of this, Dumbledore is forced to replace her with Sir Cadogan the Mad Knight. Nobody in Gryffindor House is happy about this both because he changes the password (which are ridiculously complicated) twice a day and because he's extremely annoying, but none of the other pictures wanted the job because of what happened to the Fat Lady.\nHogwarts, Great Hall\nOliver, Sirius, Lupin, Dumbledore\nconcerned, annoyed\n\n\nvoldemort also goes by the names tom riddle, he-who-must-not-be-named, dark lord.\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\ndumbledore also goes by the names albus dumbledore, albus.\nsirius also goes by the names sirius black, padfoot, snuffles, stubby boardman.",
    "search_text": "First Hand\nOn Hallowe’en, Harry skips the Hogsmeade trip and spends time with Lupin, who explains why he stopped Harry facing the Boggart. That night, Sirius Black slashes the Fat Lady’s portrait trying to enter Gryffindor Tower. Students sleep in the Great Hall, and Sir Cadogan replaces her.\nHogwarts, Great Hall\nOliver, Sirius, Lupin, Dumbledore\nconcerned, annoyed\n53",
    "tags": [
      "Hogwarts",
      "Great Hall",
      "Oliver",
      "Sirius",
      "Lupin",
      "Dumbledore",
      "concerned",
      "annoyed"
    ],
    "importance": "Medium",
    "token_count": 582
  },
  {
    "memory_id": "Prisoner of Azkaban 54",
    "prompt_text": "[PERSPECTIVE: First Hand]\nBecause of the attack on The Fat Lady, an annoyed Harry gets placed under surveillance: Teachers find excuses to go down the halls with him, Percy Weasley, acting on his mother's orders, follows him everywhere like a guard dog. Professor McGonagall decides to reveal the truth to Harry but Harry reveals he already knows Black's after him. McGonagall explains that's why she doesn't want him practising Quidditch in the evenings but Harry states he's got to train. Professor McGonagall agrees and decides to ask Madam Hooch to be present.\nGryffindor's first Quidditch match is coming up, but due to Malfoy's injury, Slytherin cannot play. Gryffindor plays Hufflepuff instead. On the day before the match, Lupin becomes ill and Snape teaches his classes for him. Oddly, he ignores Lupin's syllabus and instead gives a lesson on werewolves and assigns the class to write an essay on werewolves.\nDuring the quidditch match, it is raining badly and Harry sees a large black dog resembling the Grim in the topmost empty row of seats in the Quidditch stadium. Dementors enter the match causing Harry to faint and fall from his broomstick. Harry realises that the screaming he had been hearing during his Dementor-induced fainting spells is his mother in her last moments.\nDumbledore saves Harry, but his Nimbus 2000 broomstick flies into the Whomping Willow and is destroyed. Hufflepuff wins the match shortly afterward. After the match, Harry wakes up in the Hospital Wing and learns what happened, including that Oliver Wood has declined Hufflepuff captain Cedric Diggory's offer for a rematch.\nHogwarts, Quidditch Pitch\nSnape, Percy, McGonagall, Dumbledore\nstartled, disappointed, sad\n\n\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\ndumbledore also goes by the names albus dumbledore, albus.",
    "search_text": "First Hand\nAfter Sirius’s attack, teachers and Percy closely monitor Harry. McGonagall allows Quidditch practice with Madam Hooch present. Gryffindor plays Hufflepuff, but during the rain-soaked match, Harry sees the black dog before Dementors make him faint, hearing his mother’s last screams. Dumbledore saves him, but his Nimbus 2000 is destroyed.\nHogwarts, Quidditch Pitch\nSnape, Percy, McGonagall, Dumbledore\nstartled, disappointed, sad\n54",
    "tags": [
      "Hogwarts",
      "Quidditch Pitch",
      "Snape",
      "Percy",
      "McGonagall",
      "Dumbledore",
      "startled",
      "disappointed",
      "sad"
    ],
    "importance": "Medium",
    "token_count": 501
  },
  {
    "memory_id": "Prisoner of Azkaban 55",
    "prompt_text": "[PERSPECTIVE: First Hand]\nAlarmed by the adverse effects the Dementors have on him, Madam Pomfrey insists that Harry stay in the hospital wing for the weekend. The following week, Lupin is back teaching. After class, Harry goes to Lupin wondering why the Dementors affect him so much. Lupin explains that Dementors are fear itself and they pull forth the horrors from a person's past, which is why just before he faints, Harry hears his mother screaming before she dies and why the Dementors affect him worse than anyone else. Harry asks Lupin if he can give him private lessons on the spell to drive off Dementors in case another one arrives at a Quidditch match. Lupin says he will, but after the Christmas holidays, citing his frequent illness.\n\nDuring the last weekend before the holidays, Harry is yet again not able to go to Hogsmeade. To bring some Christmas cheer to Harry, Fred and George give Harry the Marauder's Map. It shows Hogwarts' secret passages and corridors, as well as every person's location within the castle and the grounds.\nHarry uses the Marauder's Map to sneak into Hogsmeade. He then meets Ron and Hermione in Honeydukes, where they were discussing what kind of sweets to get Harry. They visit the Three Broomsticks, a pub run by Madam Rosmerta. When Cornelius Fudge, Minerva McGonagall, Filius Flitwick, and Rubeus Hagrid arrive, Harry hides underneath their table to avoid being seen. The trio overhears their conversation, as they discuss how Sirius Black was a close childhood friend of Harry's father, James, and that he is Harry's godfather. The group goes on to talk about how the Potters learned how Voldemort had marked them for death. Dumbledore had advised them to go into hiding. One week later, Black sold out the Potters to Lord Voldemort. Peter Pettigrew, another of James's friends, confronted Black for the betrayal and he and twelve Muggles were killed by Black. Black was taken to Azkaban afterwards. Harry is devastated.\nHogwarts, Three Broomsticks, Hogsmeade\nFred, George, Hermione, Ron\nhappy, shocked, devistated\n\n\nvoldemort also goes by the names tom riddle, he-who-must-not-be-named, dark lord.\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\ndumbledore also goes by the names albus dumbledore, albus.\nfred also goes by the names fred weasley.\ngeorge also goes by the names george weasley.\npettigrew also goes by the names peter, peter pettigrew, wormtail.\nsirius also goes by the names sirius black, padfoot, snuffles, stubby boardman.",
    "search_text": "First Hand\nLupin explains Dementors affect Harry strongly because they force him to relive his mother’s death. Fred and George give Harry the Marauder’s Map, letting him sneak to Hogsmeade. Hiding in the Three Broomsticks, he overhears that Sirius Black, his godfather, betrayed his parents to Voldemort.\nHogwarts, Three Broomsticks, Hogsmeade\nFred, George, Hermione, Ron\nhappy, shocked, devistated\n55",
    "tags": [
      "Hogwarts",
      "Three Broomsticks",
      "Hogsmeade",
      "Fred",
      "George",
      "Hermione",
      "Ron",
      "happy",
      "shocked",
      "devistated"
    ],
    "importance": "Medium",
    "token_count": 725
  },
  {
    "memory_id": "Prisoner of Azkaban 56",
    "prompt_text": "[PERSPECTIVE: First Hand]\nHarry is depressed both about the truth about Sirius Black and that no one bothered to tell him before. Harry is also continuing to have nightmares about Dementors and his mother screaming. During the start of the holidays, Ron and Hermione try to console Harry but Harry chooses to go to Hagrid's house to ask him about Sirius Black despite Ron and Hermione's protests. When the trio arrives at his house, they find him distraught about Buckbeak's upcoming hearing before the Committee for the Disposal of Dangerous Creatures, and Harry decides it is better not to bring Sirius Black up.\nHagrid reveals that he had a horrible experience with the Dementors during his brief time in Azkaban. He can't set Buckbeak free without the risk of being sent back there. The trio then decides to help Hagrid prepare his defence for Buckbeak's case.\nFor Christmas, among his other presents, Harry receives the best model broomstick ever released: the Firebolt. Hermione is not happy when she learns that it came without a note, and is driven out of Harry and Ron's dormitory after Crookshanks attacks Scabbers again. During Christmas dinner, Hermione reports the mystery gift to McGonagall, who sends it away to have it tested for tampering. Both Hermione and McGonagall suspect Black might have sent the broomstick and that it could be jinxed. Harry ceases speaking with Hermione, even though he knew she had good intentions with reporting the Firebolt.\nHagrid's Hut, Hogwarts\nRon, Hermione, Hagrid, McGonagall\ndepressed, happy, betrayed\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\nsirius also goes by the names sirius black, padfoot, snuffles, stubby boardman.",
    "search_text": "First Hand\nTroubled by news about Black, Harry visits Hagrid but finds him upset over Buckbeak’s trial. The trio offers to help his defence. At Christmas, Harry receives a Firebolt without a note, alarming Hermione, who tells McGonagall. Suspecting it may be jinxed, she confiscates it for testing, upsetting Harry.\nHagrid's Hut, Hogwarts\nRon, Hermione, Hagrid, McGonagall\ndepressed, happy, betrayed\n56",
    "tags": [
      "Hagrid's Hut",
      "Hogwarts",
      "Ron",
      "Hermione",
      "Hagrid",
      "McGonagall",
      "depressed",
      "happy",
      "betrayed"
    ],
    "importance": "Medium",
    "token_count": 481
  },
  {
    "memory_id": "Prisoner of Azkaban 57",
    "prompt_text": "[PERSPECTIVE: First Hand]\nHarry starts his lessons with Lupin. Lupin tells Harry that the spell to drive off Dementors is called the Patronus Charm, instructs him in how to cast one, and lets him practise on a Boggart. Harry fails to produce a Patronus at first. This, however, is to be expected; the Patronus Charm is well beyond O.W.L. standard. During his first lesson, Harry learns that Lupin was a friend of his father James back during their days at Hogwarts, and also knew Sirius Black as well.\n\nBy February, Harry becomes quite good at producing a Patronus after a few lessons, but doesn't master it entirely. At the end of a lesson, Lupin explains the concept of a Dementor's Kiss and reveals that it will be Black's punishment if they find him. While thinking about the horror of the punishment, Harry runs into McGonagall on his way back to Gryffindor Tower. McGonagall gives Harry back the Firebolt, which has been proven not to be jinxed, and suggests that he practise with it before the match. Harry meets up with Ron and they decide to go make up with Hermione. Outside Gryffindor Tower, they bump into Neville who's in trouble because he lost a list. After the pair let him in, Neville tells Harry and Ron that he made a list of the passwords for Gryffindor Tower because Sir Cadogan is still changing them twice a day but somehow they got lost. Harry attempts to patch things up with Hermione but Scabbers disappears after they arrive at Gryffindor Tower, ruining any chance for Ron and Hermione's reconciliation.\nHogwarts, Gryffindor Tower\nRon, Hermione, Lupin\ndetermined\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\nsirius also goes by the names sirius black, padfoot, snuffles, stubby boardman.",
    "search_text": "First Hand\nHarry trains with Lupin to cast the Patronus Charm, improving but not mastering it. Lupin warns Black will face the Dementor’s Kiss if caught. McGonagall returns Harry’s cleared Firebolt. Harry tries reconciling with Hermione, but Scabbers’ disappearance reignites tensions, especially after Neville loses the Gryffindor Tower password list.\nHogwarts, Gryffindor Tower\nRon, Hermione, Lupin\ndetermined\n57",
    "tags": [
      "Hogwarts",
      "Gryffindor Tower",
      "Ron",
      "Hermione",
      "Lupin",
      "determined"
    ],
    "importance": "Medium",
    "token_count": 509
  },
  {
    "memory_id": "Prisoner of Azkaban 58",
    "prompt_text": "[PERSPECTIVE: First Hand]\nAs March arrives, a new Quidditch match approaches: Gryffindor vs. Ravenclaw. During the game, just as Harry is about to catch the Snitch, Cho Chang, a fourth year Seeker for the Ravenclaw team, screams. Harry looks around and sees three Dementors in the stands. He reacts instantly, sending a full-fledged Patronus at the Dementors. Harry catches the Snitch before Cho Chang, winning the match.\nLupin compliments Harry on his Patronus and shows Harry that the \"Dementors\" were really Draco Malfoy, Vincent Crabbe, Gregory Goyle, and Marcus Flint, the Slytherin team captain, trying to sabotage Harry. A furious McGonagall takes fifty points away from Slytherin and sentences all four of them to detention as punishment. The Gryffindors celebrate until Professor McGonagall tells them to go to bed.\nThat night, Ron wakes up to Sirius Black slashing his bed curtains in the boys' dormitory. Everyone thinks it might be a nightmare but the curtains are indeed ripped and Sir Cadogan proves Ron right when he happily admits he let Sirius Black into Gryffindor Tower. Black apparently had the whole week's passwords on a piece of paper. A furious Professor McGonagall demands to know who wrote down the passwords and lost them, to which Neville admits responsibility. Another search of the castle takes place, but Black evades capture again. Tighter security is put in place, and Sir Cadogan is fired and the Fat Lady resumes her duty guarding Gryffindor Tower on the condition her portrait is to be guarded. Ron becomes an instant celebrity, which he enjoys. Neville, on the other hand, is in complete disgrace: Professor McGonagall is so furious with him that she strips him of his visitation rights to Hogsmeade for the rest of the school year, gives him a detention and forbids the other Gryffindors to tell him the password.\nHogwarts, Gryffindor Tower\nSirius, Ron, Neville\ndistressed, ashamed\n\n\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\nsirius also goes by the names sirius black, padfoot, snuffles, stubby boardman.",
    "search_text": "First Hand\nDuring the Gryffindor–Ravenclaw match, Harry drives off fake Dementors—Malfoy, Crabbe, Goyle, and Flint in disguise—before winning the game. That night, Sirius Black slashes Ron’s bed curtains after Sir Cadogan let him in using lost passwords from Neville. Security tightens, Sir Cadogan is replaced, and Neville is heavily punished.\nHogwarts, Gryffindor Tower\nSirius, Ron, Neville\ndistressed, ashamed\n59",
    "tags": [
      "Hogwarts",
      "Gryffindor Tower",
      "Sirius",
      "Ron",
      "Neville",
      "distressed",
      "ashamed"
    ],
    "importance": "Medium",
    "token_count": 572
  },
  {
    "memory_id": "Prisoner of Azkaban 59",
    "prompt_text": "[PERSPECTIVE: First Hand]\nHagrid sends a letter to Harry, telling him that he wants to meet them in his hut for tea. Other than learning that Buckbeak's trial is that week, Harry and Ron learn that Hagrid wants to talk to them on behalf of Hermione. Hagrid mentions their feud has been hurting Hermione more than they think, and that she is only concerned about protecting Harry from Sirius Black. Despite Hagrid's advice, Ron's anger reignites when Hermione threatens to tell McGonagall about the Marauder's Map, which Harry plans to use to sneak into Hogsmeade during the upcoming trip that Saturday.\nWhile on the trip that weekend, Harry uses his Invisibility Cloak to make a few stops with Ron before visiting the Shrieking Shack, a house that is supposedly filled with violent ghosts. Malfoy, Crabbe, and Goyle show up there and provoke Ron. Harry, using his cloak, attacks the trio and Malfoy catches a glimpse of Harry's head. Malfoy later reports the incident to Snape, who interrogates Harry after he returns from Hogsmeade. Snape finds the Marauder's Map, but is not able to discover what it does and is instead bombarded by insults from the map's makers. Lupin is summoned and claims ignorance about the map and Ron shows up and claims the map is a Zonko product that insults anyone who touches it. Afterwards, Lupin brings Harry and Ron to the entrance hall, where he confiscates the map and reprimands Harry for not handing in something that could aid in Black's capture. He also scolds him for risking his life to sneak into Hogsmeade, thus undervaluing his parent's sacrifice.\nOn their way back to Gryffindor Tower, Harry and Ron find Hermione, who informs them that the Ministry has decided to execute Buckbeak despite the help she provided for Buckbeak's defence.\nHogwarts, Shrieking Shack\nRon, Hermione, Snape, Lupin\nangry, nervous, sad\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\nsirius also goes by the names sirius black, padfoot, snuffles, stubby boardman.",
    "search_text": "First Hand\nHagrid urges Harry and Ron to reconcile with Hermione, but tensions flare when she threatens to tell McGonagall about Harry’s Hogsmeade trip. Using his Invisibility Cloak, Harry visits Hogsmeade, attacks Malfoy, and is caught by Snape, who confiscates the Marauder’s Map. Hermione later tells them Buckbeak is sentenced to execution.\nHogwarts, Shrieking Shack\nRon, Hermione, Snape, Lupin\nangry, nervous, sad\n59",
    "tags": [
      "Hogwarts",
      "Shrieking Shack",
      "Ron",
      "Hermione",
      "Snape",
      "Lupin",
      "angry",
      "nervous",
      "sad"
    ],
    "importance": "Medium",
    "token_count": 580
  },
  {
    "memory_id": "Prisoner of Azkaban 60",
    "prompt_text": "[PERSPECTIVE: First Hand]\nBuckbeak's impending execution causes the friends to reconcile. Ron promises to help Hermione work on filing an appeal for Buckbeak's case, since Harry will be too busy with Quidditch practice sessions for the final match. After Malfoy mocks Hagrid during one of his classes, Hermione smacks him in the face. She then accidentally skips Charms. In Divination, Hermione finally explodes and drops the class.\n\nIn May, the Quidditch final takes place: Gryffindor vs. Slytherin. Gryffindor needs to be more than fifty points ahead before Harry can catch the Golden Snitch in order to win the Quidditch Cup. On the morning of the match, Harry catches another glimpse of the dog, this time with Crookshanks. In the match, Gryffindor take an early lead, and Slytherin resorts to cheating. This helps the Gryffindor team to gain penalty shots and get further ahead. Harry manages to catch the snitch at the right moment, allowing Gryffindor to come in first in the overall points and win the Quidditch Cup at last.\nHogwarts, Quidditch Pitch\nHermione, Malfoy, Ron\ndesperate, stressed, celebratory\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.",
    "search_text": "First Hand\nWith Buckbeak’s execution looming, the friends reconcile. Hermione slaps Malfoy, skips Charms, and quits Divination. In the Quidditch final against Slytherin, Gryffindor gains a strong lead despite Slytherin’s fouls. Harry catches the Snitch at the perfect moment, securing Gryffindor the Quidditch Cup.\nHogwarts, Quidditch Pitch\nHermione, Malfoy, Ron\ndesperate, stressed, celebratory\n60",
    "tags": [
      "Hogwarts",
      "Quidditch Pitch",
      "Hermione",
      "Malfoy",
      "Ron",
      "desperate",
      "stressed",
      "celebratory"
    ],
    "importance": "Medium",
    "token_count": 366
  },
  {
    "memory_id": "Prisoner of Azkaban 61",
    "prompt_text": "[PERSPECTIVE: First Hand]\nThe students take their end-of-year exams in June. Buckbeak's appeal is scheduled on the final day of the exams. After Harry's Divination final, Trelawney issues a genuine prediction that Voldemort's servant will return to him that night and Voldemort will once again rise to full power stronger than before. Meanwhile, Buckbeak's appeal fails, and it is decided that Buckbeak would be executed.\n\nThat night, after Hermione retrieves Harry's Invisibility Cloak from the one-eyed witch's hump (where he hid it after Malfoy spotted him in Hogsmeade), Harry, Ron, and Hermione use the cloak to go to Hagrid's cabin to console him before Buckbeak is executed. Hermione finds Scabbers in a milk jug and returns him to Ron. After the trio depart, Dumbledore, Fudge, a representative of the Committee for the Disposal of Dangerous Creatures, and the executioner, Walden Macnair, arrive. Buckbeak is then seems to be executed\nHogwarts, Hagrid's Hut\nRon, Hermione, Trelawney\nsad\n\n\nvoldemort also goes by the names tom riddle, he-who-must-not-be-named, dark lord.\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\ndumbledore also goes by the names albus dumbledore, albus.",
    "search_text": "First Hand\nDuring exams, Trelawney makes a real prophecy that Voldemort’s servant will return to him that night. Buckbeak’s appeal fails. That evening, under the Invisibility Cloak, the trio visits Hagrid to comfort him and finds Scabbers alive. After they leave, officials arrive and Buckbeak seems to be executed.\nHogwarts, Hagrid's Hut\nRon, Hermione, Trelawney\nsad\n61",
    "tags": [
      "Hogwarts",
      "Hagrid's Hut",
      "Ron",
      "Hermione",
      "Trelawney",
      "sad"
    ],
    "importance": "Medium",
    "token_count": 394
  },
  {
    "memory_id": "Prisoner of Azkaban 62",
    "prompt_text": "[PERSPECTIVE: First Hand]\nScabbers escapes from Ron. Harry, Ron, and Hermione chase him and spot the black dog and Crookshanks. Ron catches Scabbers, but the dog grabs him, dragging him into a passage under the Whomping Willow and breaking his leg. Harry, Hermione, and Crookshanks follow to the Shrieking Shack, finding Ron, Scabbers, and Sirius Black — the black dog’s true form.\n\nLupin arrives, accused by Hermione of aiding Black and being a werewolf. Lupin admits to the latter, denies helping Black, and explains he tracked them via the Marauder’s Map, where he also saw Peter Pettigrew alive. Pettigrew, an Animagus, has lived for years as Scabbers.\n\nThe trio doubt him, citing Pettigrew’s supposed murder by Black. Lupin urges Black to explain. Lupin recounts being bitten as a child and how Dumbledore arranged the Shrieking Shack and Whomping Willow to contain him during transformations. Eventually, Sirius, Pettigrew, and James Potter discovered the truth and became Animagi to accompany him. Lupin never told Dumbledore Sirius was one, fearing punishment for enabling them. Snape suddenly arrives, using Harry’s Invisibility Cloak.\n\nSnape tries to arrest Lupin and Black, but Harry, Ron, and Hermione disarm him. Black says he escaped Azkaban after seeing Scabbers in the paper and recognizing Pettigrew. He suspected Pettigrew intended to capture Harry for Voldemort. Black reveals Pettigrew had been the Potters’ Secret-Keeper — chosen at the last moment instead of Sirius, a change even Dumbledore didn’t know. Sirius hadn’t realized Pettigrew was already a spy for Voldemort, who betrayed the Potters immediately. After their deaths, Sirius confronted Pettigrew, who killed twelve Muggles, cut off his finger, transformed into a rat, and escaped, framing Black.\n\nBlack and Lupin force Scabbers to transform, revealing Pettigrew. Black says Pettigrew stayed with the Weasleys to monitor news until it was safe to return to Voldemort. Learning Pettigrew might soon act against Harry, Black escaped Azkaban in Animagus form to find him. He swears to Harry he’d have died before betraying his parents. Harry believes him.\n\nThe group takes Pettigrew back toward the castle, intending to deliver him to the Dementors.\nShreaking Shack\nPettigrew, Ron, Hermione, Sirius, Lupin\ntense\n\n\nvoldemort also goes by the names tom riddle, he-who-must-not-be-named, dark lord.\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\ndumbledore also goes by the names albus dumbledore, albus.\npettigrew also goes by the names peter, peter pettigrew, wormtail.\nsirius also goes by the names sirius black, padfoot, snuffles, stubby boardman.",
    "search_text": "First Hand\nScabbers escapes but is caught by Ron before a black dog drags him into the Whomping Willow tunnel. In the Shrieking Shack, the dog is revealed as Sirius Black. With Lupin’s help, they expose Scabbers as Peter Pettigrew, the Potters’ true betrayer. Sirius’s name cleared to Harry, they take Pettigrew to the castle.\nShreaking Shack\nPettigrew, Ron, Hermione, Sirius, Lupin\ntense\n62",
    "tags": [
      "Shreaking Shack",
      "Pettigrew",
      "Ron",
      "Hermione",
      "Sirius",
      "Lupin",
      "tense"
    ],
    "importance": "Medium",
    "token_count": 793
  },
  {
    "memory_id": "Prisoner of Azkaban 63",
    "prompt_text": "[PERSPECTIVE: First Hand]\nSirius and Harry talk about the former's friendship with the Potters, including that Sirius is Harry's godfather. Sirius tells Harry that he can choose to live with him if he wishes. Harry quickly and happily agrees, knowing this would mean he would never have to the return to the Dursleys.\n\nUnfortunately, the full moon rises, causing Lupin, who had not taken that day’s dose of Wolfsbane Potion, to turn into a werewolf. This allows Pettigrew to knock Ron out, turn into a rat, and escape. Harry and Hermione run after Lupin and Black (who has transformed into a dog). After seriously injuring Black, Lupin flees to the Forbidden Forest. By the Black Lake, a hundred Dementors arrive and suck the happiness from Harry, Hermione, and Black and attempt to perform a Kiss on them. Before they all faint, Harry sees a familiar figure across the lake conjure a powerful stag-shaped Patronus that drives all the Dementors away.\nBlack Lake\nHermione, Pettigrew, Sirius, Lupin\nhappy, scared\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\npettigrew also goes by the names peter, peter pettigrew, wormtail.\nsirius also goes by the names sirius black, padfoot, snuffles, stubby boardman.",
    "search_text": "First Hand\nSirius offers Harry a home, and Harry eagerly agrees. But when the full moon rises, Lupin transforms into a werewolf, letting Pettigrew escape. Chasing Lupin and Sirius, Harry and Hermione are attacked by Dementors by the Black Lake. Before fainting, Harry sees a mysterious figure cast a powerful stag Patronus.\nBlack Lake\nHermione, Pettigrew, Sirius, Lupin\nhappy, scared\n63",
    "tags": [
      "Black Lake",
      "Hermione",
      "Pettigrew",
      "Sirius",
      "Lupin",
      "happy",
      "scared"
    ],
    "importance": "Medium",
    "token_count": 377
  },
  {
    "memory_id": "Prisoner of Azkaban 64",
    "prompt_text": "[PERSPECTIVE: First Hand]\nHarry, Hermione, and Ron are taken to the Hospital Wing, and Black is taken to West Tower, where he is sentenced to a Dementor's Kiss. When Dumbledore arrives, Harry and Hermione try to tell him what actually happened, but Dumbledore tells them that, though he believes them, he cannot save Black, as the evidence against him is too great.\nHermione then reveals she has a Time-Turner, a device that will take them back through time. McGonagall gave the device to her during the Sorting on their first day back; this explains why throughout the year, there had been occasions of Hermione taking multiple classes at the same time and apparently disappearing into thin air.\nHarry and Hermione travel three hours into the past, watching themselves move through previous events. They realize that Dumbledore wanted them to travel three hours back to not only save Buckbeak from being wrongfully executed, but also to use Buckbeak to free Black from West Tower. After narrowly rescuing Buckbeak at the right moment before Macnair can execute him, Harry and Hermione hide near the Whomping Willow in the Forbidden Forest to wait for the \"other Harry and Hermione\" and everyone else to return from the Shrieking Shack.\nAfter two hours, following Lupin's transformation, Harry decides they need to head back to Hagrid's empty cabin so Lupin doesn't attack them. After spending some time in hiding, Harry leaves the cabin to check out the present situation and sees himself, Hermione, and Black fainting from Dementors. He realises that the silver stag he saw earlier across the lake was not cast by his dad, but rather by himself, and conjures a powerful Patronus that drives all the Dementors away. When it returns to him, he realises that it was the same Patronus as his father.\nHe and Hermione then fly Buckbeak up to West Tower and rescue Black. Harry and Sirius say their goodbyes before Sirius flies away on Buckbeak.\nHogwarts, Hospital Wing\nRon, Hermione, Sirius, Dumbledore\ndesperate, determined\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\ndumbledore also goes by the names albus dumbledore, albus.\nsirius also goes by the names sirius black, padfoot, snuffles, stubby boardman.",
    "search_text": "First Hand\nDumbledore believes Harry and Hermione but can’t save Sirius, so Hermione uses her Time-Turner to go three hours back. They save Buckbeak, then Harry realizes he cast the stag Patronus that saved them. Using Buckbeak, they free Sirius from West Tower, and he escapes into the night.\nHogwarts, Hospital Wing\nRon, Hermione, Sirius, Dumbledore\ndesperate, determined\n64",
    "tags": [
      "Hogwarts",
      "Hospital Wing",
      "Ron",
      "Hermione",
      "Sirius",
      "Dumbledore",
      "desperate",
      "determined"
    ],
    "importance": "Medium",
    "token_count": 596
  },
  {
    "memory_id": "Prisoner of Azkaban 65",
    "prompt_text": "[PERSPECTIVE: First Hand]\nHarry and Hermione make it back to the hospital wing just in time for Dumbledore to magically lock the door. Shortly afterwards, Snape bursts in, followed by Fudge and Dumbledore, and accuses Harry of freeing Black. Fudge assumes Snape is simply delirious because his chances of receiving the Order of Merlin have gone up in smoke. Fudge leaves to inform the Daily Prophet of the news and agrees to remove the Dementors from Hogwarts, since the Dementors' attempt to perform the Dementor's Kiss on Harry proves them to be more harmful than helpful. Shortly after they leave, Ron wakes up from his unconscious state.\nThe next day, while most of the other students are at Hogsmeade, the trio learns that Lupin is resigning because Snape told the Slytherin house Lupin's secret. Harry goes to see Lupin and is unable to sway Lupin's mind, since Lupin does not want to risk endangering the students again. Lupin confirms Harry's suspicions that James' Animagus form was indeed a stag. Lupin then gives Harry his Invisibility Cloak back, along with the Marauder's Map, and leaves with Dumbledore to catch his carriage.\nLater, while talking with Dumbledore, Harry confesses that he feels bad for not letting Lupin and Black kill Pettigrew, realising that he was the servant that would aid with Voldemort's return from Trelawney's prophecy. Dumbledore reminds Harry that he saved Black, an innocent man, from a terrible fate. Furthermore, Pettigrew owes a life debt to Harry for saving him, which Dumbledore is sure will prove useful later on. Before he leaves, Dumbledore mentions that Harry has some of his father's qualities, which is why his Patronus took the form of Prongs. At the end-of-the-year feast, Gryffindor wins both the Quidditch Cup and the House Cup.\nHogwarts, Hospital Wing, Great Hall\nDumbledore, Lupin, Snape, Fudge\nconcern, celebratory\n\n\nvoldemort also goes by the names tom riddle, he-who-must-not-be-named, dark lord.\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\ndumbledore also goes by the names albus dumbledore, albus.\npettigrew also goes by the names peter, peter pettigrew, wormtail.",
    "search_text": "First Hand\nHarry and Hermione return to the hospital wing. Snape accuses them of freeing Black, but Fudge dismisses it and removes the Dementors from Hogwarts. Lupin resigns after his secret is revealed, returning Harry’s cloak and map. Dumbledore reassures Harry about saving Pettigrew. Gryffindor wins both the Quidditch and House Cups.\nHogwarts, Hospital Wing, Great Hall\nDumbledore, Lupin, Snape, Fudge\nconcern, celebratory\n65",
    "tags": [
      "Hogwarts",
      "Hospital Wing",
      "Great Hall",
      "Dumbledore",
      "Lupin",
      "Snape",
      "Fudge",
      "concern",
      "celebratory"
    ],
    "importance": "Medium",
    "token_count": 641
  },
  {
    "memory_id": "Prisoner of Azkaban 66",
    "prompt_text": "[PERSPECTIVE: First Hand]\nThe students return to London aboard the Hogwarts Express. Hermione mentions to Harry and Ron that she gave up the Time-Turner because it caused her too much stress. She has decided to drop Muggle Studies so she can have a normal schedule again. Ron announces that he is planning to invite Harry to the Quidditch World Cup, since his father can get them tickets from work. Ron also has a telephone that he can use to contact Harry now.\n\nA tiny owl from Black then arrives on the train with a letter. In the letter, Black reveals that he is travelling far away from Hogwarts to avoid causing further problems and admits he bought Harry the Firebolt with Crookshanks' help. A separate section of the letter provides Harry with permission to visit Hogsmeade; Harry knows Dumbledore will accept it. Sirius also mentions that the tiny owl is a gift for Ron (later named Pigwidgeon by Ginny), since it is Black's fault that Ron no longer has a rat.\n\nAfter arriving at King's Cross, Ron says he will contact Harry about the finals of the Quidditch World Cup, and Harry heads back to Little Whinging with Uncle Vernon. Harry is happy he now has a true family member to depend on and mentions to Uncle Vernon that he has a godfather who had escaped from wizard prison and likes to check up on him.\nHogwarts Express\nRon, Hermione, Vernon\nhappy, relieved\n\n\nhermione also goes by the names hermione granger, granger, hermy.\nharry also goes by the names harry potter, potter, the boy who lived, the chosen one.\nron also goes by the names ron weasley, ronald weasley.\ndumbledore also goes by the names albus dumbledore, albus.\nginny also goes by the names ginny weasley.\nvernon also goes by the names vernon dursley, mr. dursley.\nsirius also goes by the names sirius black, padfoot, snuffles, stubby boardman.",
    "search_text": "First Hand\nOn the train home, Hermione reveals she’s dropped Muggle Studies and returned the Time-Turner. Ron plans to invite Harry to the Quidditch World Cup. An owl from Sirius brings Harry a Hogsmeade permission slip and gifts Ron a new owl. Harry returns to Privet Drive.\nHogwarts Express\nRon, Hermione, Vernon\nhappy, relieved\n66",
    "tags": [
      "Hogwarts Express",
      "Ron",
      "Hermione",
      "Vernon",
      "happy",
      "relieved"
    ],
    "importance": "Medium",
    "token_count": 484
  },
  {
    "memory_id": "Accio",
    "prompt_text": "[PERSPECTIVE: Lore]\nAccio\nCharm\nSummons an object to the caster by saying the name of the spell, followed by the item the caster wishes to summon.  For example, \"Accio broom\" would summon a broom from nearby. Ineffective on very large objects, such as buildings. The caster does not need to be in line of sight of the object, or even know what it looks like.\n\nThe caster has to clearly visualise the object in their mind before trying to summon it. Any distraction will make the spell ineffective.\nNo visual effect.\nFourth\nAccio is latin, for \"I call\" or \"I summon\". There exists counter-spells that can be placed on objects to keep them from being summoned",
    "search_text": "Lore\nAccio\nCharm\nSummons an object to the caster by saying the name of the spell, followed by the item the caster wishes to summon.  For example, \"Accio broom\" would summon a broom from nearby. Ineffective on very large objects, such as buildings. The caster does not need to be in line of sight of the object, or even know what it looks like.\n\nThe caster has to clearly visualise the object in their mind before trying to summon it. Any distraction will make the spell ineffective.",
    "tags": [],
    "importance": "Medium",
    "token_count": 174
  },
  {
    "memory_id": "Age Line",
    "prompt_text": "[PERSPECTIVE: Lore]\nAge Line\nCharm\nPrevents an individual either above or below a certain age from crossing a line.\nThe line produces a pale blue light.\nNone\nCannot be fooled with aging potions.",
    "search_text": "Lore\nAge Line\nCharm\nPrevents an individual either above or below a certain age from crossing a line.",
    "tags": [],
    "importance": "Medium",
    "token_count": 54
  },
  {
    "memory_id": "Aguamenti",
    "prompt_text": "[PERSPECTIVE: Lore]\nAguamenti\nCharm, Conjuration\nProduces a jet of clean water from the tip of the casters wand. Depending on the caster's concentration and intentions, this charm can produce anything from a simple trickle of water to a wave.\nWater pours from the tip of the wand. A faint blue light emits from where the water is produced.\nSixth\nThe wand movement for this spell was a smooth wave movement from right to left. This spell was useless against Fiendfyre, a spell that conjured cursed flames, as the water conjured from this spell would instantly evaporate on contact with the dark fire.",
    "search_text": "Lore\nAguamenti\nCharm, Conjuration\nProduces a jet of clean water from the tip of the casters wand. Depending on the caster's concentration and intentions, this charm can produce anything from a simple trickle of water to a wave.",
    "tags": [],
    "importance": "Medium",
    "token_count": 150
  },
  {
    "memory_id": "Alarte Ascendare",
    "prompt_text": "[PERSPECTIVE: Lore]\nAlarte Ascendare\nCharm\nCauses the object the caster points their wand at to fly upward into the air.\nRed bolt of light.\nNone\nAlarte comes from the Latin adjective Alate 'winged', and ascendare is a Latin verb meaning 'to climb' or 'to ascend'. Therefore, the whole incantation may be translated roughly as \"winged ascent\".",
    "search_text": "Lore\nAlarte Ascendare\nCharm\nCauses the object the caster points their wand at to fly upward into the air.",
    "tags": [],
    "importance": "Medium",
    "token_count": 98
  },
  {
    "memory_id": "Alohomora",
    "prompt_text": "[PERSPECTIVE: Lore]\nAlohomora\nCharm\nUnlocked doors and other locked objects. It could also unlock doors that had been sealed with a Locking Spell, although it was possible to bewitch doors to become unaffected by this spell.\nNo visual effect if cast correctly, can produce coloured lights with sloppy casting.\nFirst\nAlohomora is derived from the West African Sidiki dialect used in geomancy; it means \"friendly to thieves\". Invented by Eldon Elsrickle in the early 1600s. Before the discovery of Alohomora, the most popular unlocking spell was Portaberto, which splintered the lock from a door but occasionally left a smoking hole where the key should have gone. Before Portaberto, however, the most popular opening spell was Open Sesame, which ripped doors from their hinges and tore them into firewood. All of these were more rudimentary and by far less subtle than Alohomora.",
    "search_text": "Lore\nAlohomora\nCharm\nUnlocked doors and other locked objects. It could also unlock doors that had been sealed with a Locking Spell, although it was possible to bewitch doors to become unaffected by this spell.",
    "tags": [],
    "importance": "Medium",
    "token_count": 226
  },
  {
    "memory_id": "Amato Animo Animato Animagus",
    "prompt_text": "[PERSPECTIVE: Lore]\nAmato Animo Animato Animagus\nTransfiguration\nPart of the process of becoming an Animagus. The incantation had to be recited at sunrise and sundown, every day before the consumption of the Animagus Potion. The incantation was also recited just prior to the consumption of the potion, which had to take place just after a lightning storm started. The incantation was recited while placing the wand's tip over one's heart.\nGolden light.\nNone\nThe incantation \"Amato Animo Animato Animagus\" has latin roots, and can roughly translate to mean \"My love brings me life, I am obliged to become an animal wizard.\" It is the spell with the longest incantation.",
    "search_text": "Lore\nAmato Animo Animato Animagus\nTransfiguration\nPart of the process of becoming an Animagus. The incantation had to be recited at sunrise and sundown, every day before the consumption of the Animagus Potion. The incantation was also recited just prior to the consumption of the potion, which had to take place just after a lightning storm started. The incantation was recited while placing the wand's tip over one's heart.",
    "tags": [],
    "importance": "Medium",
    "token_count": 178
  },
  {
    "memory_id": "Anapneo",
    "prompt_text": "[PERSPECTIVE: Lore]\nAnapneo\nHealing, Vanishing, Charm\nClears the target's airway if they are choking on something.\nNo visual effect.\nNone\nFrom the Greek verb anapneo, meaning \"I breathe in.\"",
    "search_text": "Lore\nAnapneo\nHealing, Vanishing, Charm\nClears the target's airway if they are choking on something.",
    "tags": [],
    "importance": "Medium",
    "token_count": 62
  },
  {
    "memory_id": "Anteoculatia",
    "prompt_text": "[PERSPECTIVE: Lore]\nAnteoculatia\nDark charm\nCauses the target to grow antlers on their head.\nNo visual effect.\nNone",
    "search_text": "Lore\nAnteoculatia\nDark charm\nCauses the target to grow antlers on their head.",
    "tags": [],
    "importance": "Medium",
    "token_count": 39
  },
  {
    "memory_id": "Aparecium",
    "prompt_text": "[PERSPECTIVE: Lore]\nAparecium\nCharm\nReveals secret messages written in invisible ink, or any other hidden markings. Also works against Concealing charms\nWhite light.\nSecond\nFrom the latin \"apparere\", meaning \"to appear\"",
    "search_text": "Lore\nAparecium\nCharm\nReveals secret messages written in invisible ink, or any other hidden markings. Also works against Concealing charms",
    "tags": [],
    "importance": "Medium",
    "token_count": 64
  },
  {
    "memory_id": "Appare Vestigium",
    "prompt_text": "[PERSPECTIVE: Lore]\nAppare Vestigium\nCharm\nReveals and illuminates traces of recent magical activity and shows magical footprints and track marks in an area.\nGolden swirl\nNone",
    "search_text": "Lore\nAppare Vestigium\nCharm\nReveals and illuminates traces of recent magical activity and shows magical footprints and track marks in an area.",
    "tags": [],
    "importance": "Medium",
    "token_count": 51
  },
  {
    "memory_id": "Apparition",
    "prompt_text": "[PERSPECTIVE: Lore]\nApparition\nTransportation\nMagically teleports a witch or wizard to another location instantly. The destination is one that the primary user has been to or seen in some fashion previously. Can be used to Apparate two or more people at once if holding onto each other (i.e. Side-Along Apparition).\nNo visual effect.\nNone\nNo incantation required, but the caster must turn on the spot. Feels like being compressed on all sides, like being pushed through a narrow tube. The less experienced the caster, the louder the sound produced, ranging from a gunshot to utter silence. You must have a license from the ministry of magic to Apparate legally. Most avoid using Apparation due to the risk of \"Splinching\", the seperating of body parts that don't travel successfully.",
    "search_text": "Lore\nApparition\nTransportation\nMagically teleports a witch or wizard to another location instantly. The destination is one that the primary user has been to or seen in some fashion previously. Can be used to Apparate two or more people at once if holding onto each other (i.e. Side-Along Apparition).",
    "tags": [],
    "importance": "Medium",
    "token_count": 191
  },
  {
    "memory_id": "Arania Exumai",
    "prompt_text": "[PERSPECTIVE: Lore]\nArania Exumai\nCharm\nUsed to blast away Acromantulas or other large spiders. If the spell missed and struck a stone, it would produce a large black scorch mark, and thus was not recommended for use on humans,\nA bolt of blue light\nNone",
    "search_text": "Lore\nArania Exumai\nCharm\nUsed to blast away Acromantulas or other large spiders. If the spell missed and struck a stone, it would produce a large black scorch mark, and thus was not recommended for use on humans,",
    "tags": [],
    "importance": "Medium",
    "token_count": 71
  },
  {
    "memory_id": "Arresto Momentum",
    "prompt_text": "[PERSPECTIVE: Lore]\nArresto Momentum\ncharm\nSlows or stops an object.\nNone if cast perfectly, blue light otherwise.\nFifth\nThis charm was invented by the witch Daisy Pennifold in 1711 so it could be used to slow down falling Quaffles in Quidditch matches, allowing for Chasers to grab them in mid-air. Likely the combination of two words; the Anglo-French \"arester\", meaning \"to bring to a stop\", and the Latin \"Momentum\", meaning \"the force or strength gained whilst moving\". Literal translation: \"bring its momentum to a stop\".",
    "search_text": "Lore\nArresto Momentum\ncharm\nSlows or stops an object.",
    "tags": [],
    "importance": "Medium",
    "token_count": 150
  },
  {
    "memory_id": "Ascendio",
    "prompt_text": "[PERSPECTIVE: Lore]\nAscendio\nCharm\nThe Ascension Charm was a spell which flung the caster high into the air. The charm also works underwater, propelling the caster above the surface.\nNone, or blue light\nSeventh\n\"Ascendio\" comes from the Latin word \"ascendere\", meaning \"to climb\".",
    "search_text": "Lore\nAscendio\nCharm\nThe Ascension Charm was a spell which flung the caster high into the air. The charm also works underwater, propelling the caster above the surface.",
    "tags": [],
    "importance": "Medium",
    "token_count": 85
  },
  {
    "memory_id": "Avada Kedavra",
    "prompt_text": "[PERSPECTIVE: Lore]\nAvada Kedavra\nCurse\nWhen cast successfully on a living person or creature, the curse caused instantaneous and painless death, without causing any injury to the body, and without any trace of violence.\nVery bright green energy bolt.\nNone\nThe only known counter-spell to this curse was sacrificial protection, which used the power of love. Can be blocked or dodged. The Killing Curse does not work on undead creatures. The curse requires great skill, power, and intent in order to be performed correctly. You must truly desire to kill.",
    "search_text": "Lore\nAvada Kedavra\nCurse\nWhen cast successfully on a living person or creature, the curse caused instantaneous and painless death, without causing any injury to the body, and without any trace of violence.",
    "tags": [],
    "importance": "Medium",
    "token_count": 131
  }
]