{
  "memory_id": "Chamber of Secrets 31",
  "template_used": "HP Memory Template",
  "__template_name__": "",
  "__perspective__": "First Hand",
  "Created By": "Me",
  "Tags": [
    "pixies",
    "mandrake",
    "howler"
  ],
  "Importance": "Medium",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Ron receives a Howler from his mother during breakfast in the Great Hall. Then, Minerva McGonagall hands out timetables and the first class is Herbology with the Hufflepuffs. In the class, Professor Sprout teaches how to transplant Mandrake seedlings, which have restorative properties when mature. When pulled from their pots, the Mandrakes let out a terrible screeching sound. The next class is Transfiguration, where Ron has problems with his broken wand, even when he repaired it with some Spellotape. \n\nLater, the trio have their first lesson with Gilderoy Lockhart, appointed as the new Defence Against the Dark Arts teacher. His way of teaching is a complete disaster. He releases a bunch of Cornish Pixies into the classroom, expecting the students to subdue them. When it is clear things aren’t going as planned, Lockhart slips out of the classroom, leaving his students to handle the chaos he unleashed on their own. \n\nMuch to Harry's chagrin, he receives constant attention from Lockhart and Colin Creevey, a first year student. Both constantly interact with him on the base of his fame (Colin treats Harry as a celebrity and Lockhart hopes to actually bring him to that state).",
  "Brief Summary": "Ron receives a Howler from his mother during breakfast in the Great Hall. In transfiguration class, Ron has problems with his broken wand. Later, Harry's first lesson with Gilderoy Lockhart in Defence Against the Dark Arts is a complete disaster.",
  "Location": [
    "Hogwarts",
    "Great Hall"
  ],
  "Characters Present": [
    "Ron",
    "McGonagall",
    "Lockhart"
  ],
  "Emotional State": [
    "ashamed",
    "annoyed"
  ],
  "Chronological Placement": 31
}