{
  "memory_id": "Chamber of Secrets 30",
  "template_used": "HP Memory Template",
  "__template_name__": "",
  "__perspective__": "First Hand",
  "Created By": "Me",
  "Tags": [
    "Flying car",
    "Womping Willow",
    "punished"
  ],
  "Importance": "Medium",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "It is time to return to Hogwarts, Harry and the Weasleys arrives at King's Cross Station on the Ford Anglia, after several delays (Fred and George forgetting their broomsticks, and Ginny forgetting her diary.) On the way to the Hogwarts Express, when Harry and Ron try to go through the barrier to Platform Nine and Three-Quarters after everyone else went through, the barrier is mysteriously sealed against them. Having missed the train, Harry and Ron thus decide to fly Mr Weasley's flying Ford Anglia to Hogwarts. They end up getting spotted by many Muggles and crash into the Whomping Willow, the impact breaking Ron's wand. The giant tree starts pounding the car. The battered car manages to escape, ejecting Harry, Ron, and their luggage, before quickly driving off into the Forbidden Forest.\n\nAfter they make it to the castle, Professor Snape catches the boys and attempts to have them expelled for being sighted and breaking wizard law to get to the castle. Albus Dumbledore, however, says he will send a letter to Harry and Ron's families. Still, Professor McGonagall gives a warning and separate detentions to both boys, and pointed out that they hadn't thought things through as they could have just sent a letter to Hogwarts with Hedwig. She also tells them that Ginny had been sorted into Gryffindor.",
  "Brief Summary": "When Harry and Ron attempt to cross into platform nine and three quarters, they find they are blocked. In desperation they fly the flying car to Hogwarts, crashing into the Whomping Willow and getting in trouble.",
  "Location": [
    "Platform Nine and Three Quarters",
    "Hogwarts"
  ],
  "Characters Present": [
    "Ron",
    "Snape",
    "McGonagall"
  ],
  "Emotional State": [
    "distressed",
    "afraid",
    "disappointed"
  ],
  "Chronological Placement": 30
}