{
  "memory_id": "Chamber of Secrets 39",
  "template_used": "HP Memory Template",
  "__template_name__": "",
  "__perspective__": "First Hand",
  "Created By": "Me",
  "Tags": [
    "seeing the past",
    "chamber of secrets",
    "Tom Riddle's diary"
  ],
  "Importance": "Medium",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Harry realises that even if ink is spilled all over the diary, it is not stained at all. He tries writing to the diary and, to his surprise, Riddle writes back. He explains that he was the one who caught the person who opened the Chamber of Secrets the last time, and he can show Harry what happened. Harry agrees and gets sucked into a \"recording\" of Riddle's memory. Transported back to 13 June 1943, he witnesses the school's previous headmaster, Armando Dippet, informing Riddle that the school will be closed, since now a Muggle-born girl has died. Riddle is apprehensive of this, since it would mean getting sent back to the Muggle orphanage he grew up in and grown to hate. Dippet guesses that Riddle is Muggle-born as well, but Riddle corrects him by revealing that he's actually half-blood, having been left at the orphanage after his witch mother died, but not before requesting her son's first name to be Tom, after his Muggle father, and his middle name to be Marvolo, after his wizard grandfather. When dismissed by Dippet and a 50-years-younger Dumbledore, Harry follows Riddle down into the dungeons, where Riddle catches a 50-years-younger Hagrid fiddling with a young Acromantula (giant spider) in a cupboard. Accusing the giant of harbouring the monster behind the death of the Muggle-born girl in question, Riddle reports Hagrid to Dippet, despite Hagrid protesting that that his Acromantula, who he has seemingly named Aragog, has never killed anyone. Having seen this, Harry now believes that Hagrid was the one who opened the Chamber fifty years before and he is responsible this time.",
  "Brief Summary": "Harry writes in the diary and is shown Tom Riddle’s memory from 1943. Riddle blames Hagrid for the Chamber attacks, claiming Hagrid kept a deadly spider named Aragog. Harry, convinced by the scene, now suspects Hagrid was behind both the past and current attacks.",
  "Location": [
    "Hogwarts"
  ],
  "Characters Present": [
    "Hagrid",
    "Harry",
    "Tom Riddle"
  ],
  "Emotional State": [
    "surprised",
    "intrigued"
  ],
  "Chronological Placement": 39
}