{
  "memory_id": "Chamber of Secrets 34",
  "template_used": "HP Memory Template",
  "__template_name__": "",
  "__perspective__": "First Hand",
  "Created By": "Me",
  "Tags": [
    "Chamber of Secrets",
    "mudblood",
    "petrified"
  ],
  "Importance": "Medium",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Before they get to the Halloween feast, Harry hears the disembodied voice again (which Ron and Hermione cannot hear) and follows it to the second floor, where he finds  Mrs Norris, Filch's cat, hanging from a torch bracket, petrified and next to her, a threatening message is written on the wall, reading \"THE CHAMBER OF SECRETS HAS BEEN OPENED. ENEMIES OF THE HEIR, BEWARE\". Then, students leaving the Hallowe'en Feast surround them. And Malfoy yells: \"Enemies of the Heir, beware! You'll be next, Mudbloods!\"\n\nFilch and Snape try to get Harry in trouble for what happened, but Dumbledore says that it is powerful dark magic that no second year student could perform. They decide that Professor Sprout's mandrakes will be used, once they are mature enough, to create a draught that can revive Mrs Norris. Hermione wants to research the Chamber, so she persuades Professor Binns (the History of Magic teacher) into telling the class about it. He explains that one of the founders of Hogwarts, Salazar Slytherin, got into an argument with the others about whether Muggle-borns should be admitted. When the rift grew too large, he left the school. According to legend, as a going-away present to the school, he built a secret chamber that could only be opened by his true heir. This \"Chamber of Secrets\" contains a monster that only the Heir of Slytherin can control and that, once released, would purge the school of all Muggle-borns. Binns unsuccessfully tries to assure the class that the Chamber does not actually exist and that the school has been searched many times in vain.",
  "Brief Summary": "Harry hears a sinister disembodied voice, but Hermione and Ron don't hear it. The three discover Ms. Norris the cat, petrified, hanging next to a sinister message. Later, a teacher tells them the legend of the chamber of secrets, but insists it's just a legend.",
  "Location": [
    "Hogwarts"
  ],
  "Characters Present": [
    "Harry",
    "Ron",
    "Hermione",
    "Binns"
  ],
  "Emotional State": [
    "disturbed",
    "frightened"
  ],
  "Chronological Placement": 34
}