{
  "memory_id": "Chamber of Secrets 29",
  "template_used": "HP Memory Template",
  "__template_name__": "",
  "__perspective__": "First Hand",
  "Created By": "Me",
  "Tags": [
    "Floo powder",
    "fight with Lucius",
    "meeting Lockheart"
  ],
  "Importance": "Medium",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Harry stays at The Burrow until his departure for Hogwarts. The Weasleys make it clear that they all like Harry. During that period, he and the Weasleys travel to Diagon Alley with Floo Powder to get their school supplies. Harry has difficulty with the smoke around him and says \"Diagon Alley\" unclearly, and thus he accidentally lands in a shop in the ill-reputed Knockturn Alley instead. The shop is Borgin and Burkes, specialising in objects related to Dark magic. There he sees Lucius Malfoy, father of Draco Malfoy, selling items imbued with Dark magic to a dark arts salesman, Mr Borgin. Lucius Malfoy explains that the Ministry has been conducting raids on wizard houses to uncover illegal artefacts, so he is selling his more problematic possessions. He also expresses his disdain for a rumoured Muggle Protection Act, which he (rightly) assumes Arthur Weasley is behind.\n\nHarry leaves the shop and is found by Hagrid and taken back to Diagon Alley to reunite with the Weasleys and Hermione Granger, who is also there with her parents. In Flourish and Blotts, he and the Weasleys meet the famous wizard/author Gilderoy Lockhart, who announces that he will be taking over as Hogwarts's new Defence Against the Dark Arts teacher. He then forces Harry to have his picture taken with him for the front page of the Daily Prophet. They also meet Draco and Lucius Malfoy there. The elder Malfoy continuously taunts and insults Arthur and his family and eventually Arthur lunges at him. During the fight, Malfoy grabs one of the Weasleys' second-hand books and, after Hagrid breaks the fight up, throws the book back at Ginny in contempt.",
  "Brief Summary": "Harry accidently ends up in Borgin and Burkes, where he sees Lucius Malfoy selling illegal dark magic items. Harry meets Lockheart, who says he will be teaching at Hogwarts. Later, after Harry reunites with the Weasleys, Lucius insults the Weasleys, starting a fight with Arthur.",
  "Location": [
    "Diagon Alley",
    "Knockturn Alley",
    "Borgin and Burkes"
  ],
  "Characters Present": [
    "Lucius",
    "Arthur",
    "Lockheart"
  ],
  "Emotional State": [
    "suspicious",
    "angry"
  ],
  "Chronological Placement": 29
}