{
  "memory_id": "Chamber of Secrets 44",
  "template_used": "HP Memory Template",
  "Tags": [
    "Lockhart's memory charm",
    "chamber of secrets",
    "rescuing Ginny"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Moaning Myrtle explains her death, remarking the last thing she saw was a pair of enormous eyes by one of the sinks, whose tap has never worked. Harry finds a snake engraved on the tap and then opens the entrance to the Chamber of Secrets by speaking Parseltongue to it. Harry, Ron and Lockhart slide down a large pipe and find themselves in maze-like tunnels far below the school. Down there, they encounter a snakeskin left by the Basilisk. Just then, Lockhart feigns fainting and steals Ron's wand. Victoriously declaring that he will erase Harry and Ron's memories and tell everybody they lost their sanity at the sight of Ginny's mangled body, Lockhart casts the Memory Charm. However, Ron's broken wand causes the charm to backfire, erasing Lockhart's memory and causing a portion of the ceiling to cave in, trapping Harry in the direction of the chamber and Ron and Lockhart in the direction of the castle. Ron must then stay behind and clear a path through the rocks while Harry continues in search of Ginny. Harry then encounters a wall with stone snakes on it, opens it by speaking Parseltongue, and enters the Chamber.",
  "Brief Summary": "Myrtle reveals she died seeing giant eyes by a sink, leading Harry to open the Chamber using Parseltongue. He, Ron, and Lockhart descend into the tunnels, where Lockhart tries to erase their memories, but backfires. Separated by debris, Harry ventures alone into the Chamber to find Ginny.",
  "Location": [
    "Hogwarts"
  ],
  "Characters Present": [
    "Ron",
    "Lockhart",
    "Myrtle"
  ],
  "Emotional State": [
    "determined",
    "surprized",
    "apprehensive"
  ],
  "Chronological Placement": 44,
  "Created By": "Me",
  "Importance": "High"
}