{
  "memory_id": "Chamber of Secrets 27",
  "template_used": "HP Memory Template",
  "__template_name__": "",
  "__perspective__": "First Hand",
  "Created By": "Me",
  "Tags": [
    "meeting Dobby the elf",
    "house elf",
    "ministry warning"
  ],
  "Importance": "Medium",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "As Harry enters his bedroom he finds a strange creature on his bed, a house elf named Dobby, who tells Harry that he must not go back to Hogwarts, as it will be dangerous because terrible things are going to happen there. The elf, however, can't tell him what things, and continues to be vague because every time he gets close to letting something slip he starts hurting himself. In the process, he makes a lot of noise, which is noticed by the group downstairs. When he hears Uncle Vernon coming upstairs, Harry hides the elf in his closet right before Vernon comes in and scolds his nephew for making such a racket. Harry lets Dobby out as soon as his uncle leaves, and insists that he has to go back to Hogwarts since that's where he has friends despite them not writing to him. But to his surprise, Dobby then reveals that he has stopped letters being sent to Harry, and offers them to him if Harry will stay away from Hogwarts. Harry refuses and, making a frustrated Dobby run downstairs and use a Hover Charm to smash the dinner party's pudding.\nHarry is blamed for the incident once Dobby disappears. The evening is almost saved until an owl from the Ministry of Magic is promptly received (scaring away Mrs Mason, who is mortally afraid of birds) with a warning saying that Harry has violated the Decree for the Reasonable Restriction of Underage Sorcery, though he is not actually punished (possibly because it is only his first offence). After realising that Harry is not allowed to do magic outside of Hogwarts grounds, Uncle Vernon locks Harry in his room. Vernon reasons that if Harry uses magic to get himself out, he will be expelled anyway.",
  "Brief Summary": "Dobby the house elf warns Harry not to return to Hogwarts, as it is very dangerous. Dobby reveals he's been intersepting letters from Hermione and Ron, and says he will give them to Harry if he agrees not to return to Hogwarts. When Harry refuses, Dobby gets him in trouble.",
  "Location": [
    "Privet Drive"
  ],
  "Characters Present": [
    "Harry",
    "Dobby",
    "Vernon"
  ],
  "Emotional State": [
    "defiant",
    "upset",
    "annoyed"
  ],
  "Chronological Placement": 27
}