{
  "memory_id": "Chamber of Secrets 35",
  "template_used": "HP Memory Template",
  "__template_name__": "",
  "__perspective__": "First Hand",
  "Created By": "Me",
  "Tags": [
    "polyjuice potion",
    "Bludger attack",
    "broken arm"
  ],
  "Importance": "Low",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Harry, Ron and Hermione decide that Slytherin’s heir is probably Draco Malfoy, since he is a Pureblood supremacist, and because his father worked for Voldemort. To try to confirm it, Hermione proposes to use Polyjuice Potion, which can change a person into somebody else for an hour. After getting Lockhart's signature to check out the book Moste Potente Potions from the Restricted Section that has the recipe, Hermione warns them that the potion will take a month to brew, supposing they gather all the necessary ingredients. Since no one comes into Moaning Myrtle's bathroom, the three of them decide it is the best place to brew the potion unnoticed.\n\nDuring the month that it takes the Polyjuice Potion to brew, a Quidditch match between Gryffindor and Slytherin takes place. During the match, one of the Bludgers stakes after Harry and focuses completely on him, indicating the Bludger has been tampered with. Harry still manages to catch the Golden Snitch and allow for Gryffindor to win thanks to the Slytherin Seeker Draco Malfoy wasting his time insulting Harry and not paying attention. However, before Harry could catch the Snitch, the Bludger broke Harry's arm, and Lockhart, attempting to fix it, gets rid of all the bones in his arm instead. Madam Pomfrey gives Harry Skele-Gro potion to counter this and Harry is forced to stay in the Hospital Wing overnight.\n\nDuring that night, Dobby visits Harry and reveals that it was he who made the Bludger chase after Harry, and was also responsible for the barrier of Platform Nine and Three-Quarters not letting him in for in hopes of Harry leaving or never arriving at Hogwarts. He also reveals that the Chamber of Secrets has been opened before and immediately punishes himself, as he is not supposed to reveal anything. After Dobby disappears, Dumbledore, McGonagall, and Madam Pomfrey enter with Colin Creevey, who has been petrified.",
  "Brief Summary": "Harry, Ron, and Hermione believe Malfoy to be the heir of Slytherin, so they begin work on a polyjuice potion. A Bludger breaks Harry's arm during Quidditch, and Lockhart removes the bones in his arm. Dobby reveals he is responsible for the Bludger and Harry not being able to get on platform nine and three quarters.",
  "Location": [
    "Hogwarts",
    "Hospital Wing"
  ],
  "Characters Present": [
    "Hermione",
    "Lockhart",
    "Dobby"
  ],
  "Emotional State": [
    "suspicion",
    "anger"
  ],
  "Chronological Placement": 35
}