{
  "memory_id": "Chamber of Secrets 37",
  "template_used": "HP Memory Template",
  "__template_name__": "",
  "__perspective__": "First Hand",
  "Created By": "Me",
  "Tags": [
    "Polyjuice Potion accident",
    "Slytherin's heir",
    "secret mission"
  ],
  "Importance": "Medium",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "For the first time, Harry is taken to Dumbledore's office, and there he witnesses Fawkes—Dumbledore's phoenix—bursting into flames and then being reborn from the ashes. Dumbledore says that he does not believe Harry to be behind the attacks, a belief reinforced by Hagrid backing Harry's alibi, but a large portion of the school is now sure that Harry is Slytherin's heir. When Christmas arrives (Harry's gifts: a toothpick, fudge in a tin, a copy of Flying with the Cannons, a new quill, a jumper and plum cake), with the Polyjuice Potion ready and Hermione having acquired some spare Slytherin robes to use, they give to Crabbe and Goyle two chocolate cakes containing \"sleeping pills\" that made Crabbe and Goyle fall asleep after eating the cakes. Harry and Ron take their hairs (and shoes, because Crabbe and Goyle have larger feet) and assume their form. Hermione tries to use a hair she thought belongs to Millicent Bulstrode, but it is actually her cat's hair and Hermione is transformed into a cat/human hybrid. Hermione is forced to spend a few weeks in the Hospital Wing. As Crabbe and Goyle, once Draco leads them to the Slytherin common room, Harry and Ron interrogate an unsuspecting Malfoy and discover that even though he wishes he were, Draco is not the Heir of Slytherin. They also hear that Lucius Malfoy mentioned that the last time the chamber was opened, fifty years ago, a Muggle-born student died and whoever was responsible was expelled. Malfoy also mentions his father's secret stash of illegal artefacts.",
  "Brief Summary": "Harry visits Dumbledore and meets Fawkes, the phoenix. At Christmas, the trio uses Polyjuice Potion to question Malfoy. Hermione’s dose goes wrong, turning her part-cat. Disguised as Crabbe and Goyle, Harry and Ron learn Malfoy isn’t the Heir, but hear clues about Lucius Malfoy’s secrets.",
  "Location": [
    "Hogwarts",
    "Slytherin Common Room"
  ],
  "Characters Present": [
    "Ron",
    "Hermione",
    "Crabbe",
    "Goyle",
    "Malfoy"
  ],
  "Emotional State": [
    "shocked"
  ],
  "Chronological Placement": 37
}