{
  "memory_id": "Chamber of Secrets 28",
  "template_used": "HP Memory Template",
  "__template_name__": "",
  "__perspective__": "First Hand",
  "Created By": "Me",
  "Tags": [
    "Meeting the Weasleys",
    "escaping the Dursleys",
    "flying car."
  ],
  "Importance": "Medium",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "The Dursleys' punishment for Harry ruining the Dursley’s dinner lasts for three days, until Ron, Fred, and George Weasley, worried about not hearing from Harry all summer, borrow their father's flying Ford Anglia and come to the rescue. They break the metal bars off Harry's window and help him to pick the lock to his door so he can get his Nimbus 2000 and trunk. The Dursleys discover his escape attempt, but by the time they can intervene, Fred, George, Ron and Harry have got everything of Harry's and have flown away. On the flight to The Burrow, Harry explains Dobby's warning. They all agree that it is very fishy and speculate that Dobby most likely belongs to the Malfoys who sent Dobby to Harry as a joke, since the Malfoys are an old wizarding family of great wealth. Fred and George tell Harry that Lucius Malfoy formerly worked for Voldemort but claimed that the Dark Lord bewitched him after Voldemort lost his powers. Harry is taken to The Burrow, the Weasleys' home, and he finds the house truly amazing. Since Ron, Fred and George took the car without permission, they are yelled at by Molly Weasley, who was waiting in the kitchen. After their scolding, she makes them breakfast and has the three Weasley boys (and Harry who volunteered) de-gnome the garden, refusing to use a technique from Gilderoy Lockhart's Guide to Household Pests, and do it their own way. Arthur Weasley soon comes home and is honoured to meet Harry after they are introduced to each other. Molly, his wife, yells at him for enchanting the car. Ginny Weasley, who was enrolling at Hogwarts that year, is very obviously enamoured with Harry and spends most of her time hiding from him.",
  "Brief Summary": "The Weasley's, concerned over not having heard from him in a long time, come to rescue Harry in a flying car. They take him back home, where he meets the rest of the members of the Weasley family, including Ginny, who is particularly shy.",
  "Location": [
    "Privet Drive",
    "The Burrow"
  ],
  "Characters Present": [
    "Fred",
    "George",
    "Ginny",
    "Ron"
  ],
  "Emotional State": [
    "excited",
    "happy"
  ],
  "Chronological Placement": 28
}