{
  "memory_id": "Chamber of Secrets 42",
  "template_used": "HP Memory Template",
  "Tags": [
    "Basilisk",
    "chamber of secrets",
    "petrified"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Harry and Ron manage to trick Lockhart - who is leading them to their next class - into letting them go by stroking his ego. Just as they pat themselves on the back, they get caught by Professor McGonagall, and Harry has to make up an excuse - they were going to see Hermione in the Hospital Wing, where visitors were now prohibited. They now have to go along to make their story appear convincing, but rather than simply hanging around Hermione's petrified form, this time Harry finds a piece of paper tightly clutched in her hand, which reveals what Hermione discovered before she was attacked. She had discovered, based on strong circumstantial evidence, that the monster in the Chamber of Secrets is a Basilisk, one of the giant \"Kings of all Serpents\", thus explaining the mysterious voice that only Harry could hear, since he could speak Parseltongue. The Basilisk kills people by looking them in the eye, but no one died since they only looked indirectly at its deadly gaze: Colin Creevey saw it through his camera, Justin Finch-Fletchley saw it through Nearly-Headless Nick (since he was already dead and could not die \"again\", he was only petrified), Mrs Norris saw a reflection of it in the water from the flooded bathroom, and Hermione and Penelope Clearwater both used a mirror to look around corners after Hermione has figured things out. Harry discovers in the paper that spiders flee from it and how a rooster's crowing is potentially fatal to the Basilisk (which explains Hagrid's roosters having been killed during the year). On the note is also scribbled a single word, \"pipes\", implying that the serpent manoeuvres through the plumbing (which helps them to realise that the entrance to the Chamber of Secrets is in Moaning Myrtle's bathroom).",
  "Brief Summary": "Harry and Ron trick Lockhart and visit Hermione, discovering a note in her hand revealing the monster is a Basilisk. It kills with direct eye contact, and travels through pipes. This explains the attacks’ odd details and points to the Chamber’s entrance being in Moaning Myrtle’s bathroom.",
  "Location": [
    "Hogwarts"
  ],
  "Characters Present": [
    "Ron",
    "Hermione"
  ],
  "Emotional State": [],
  "Chronological Placement": 42,
  "Created By": "Me",
  "Importance": "High"
}