{
  "memory_id": "Chamber of Secrets 38",
  "template_used": "HP Memory Template",
  "__template_name__": "",
  "__perspective__": "First Hand",
  "Created By": "Me",
  "Tags": [
    "Tom Riddle's diary",
    "Valentines day"
  ],
  "Importance": "Medium",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Ron and Harry arrive at Moaning Myrtle's bathroom to find it flooded. Myrtle, a sulking ghost, explains that she had flooded it because somebody flushed a diary down the toilet and onto her. Harry picks it up; he discovers that it once belonged to somebody called T.M. Riddle, but the diary is completely blank. Ron remembers from his detention that Riddle had won an award for special service to the school fifty years before. Hermione deduces that since this coincides with the last time the Chamber was opened, Tom Riddle might have received his prize for catching whoever was responsible for the attacks back then. Even though all attempts to extract information from the diary fail, Harry feels a strange compulsion to keep it. On Valentine's Day, Ron and Harry are dismayed to find out Lockhart has spread dwarves dressed as cupids throughout the school to receive and deliver Valentines as a morale booster due to believing that he made the attacks stop. One cupid-dwarf manages to deliver one (a singing valentine from Ginny) to Harry. While struggling to avoid him, the embarrassed Harry trips and falls, having ink spilled all over the contents of his bag. Ginny notices the diary and assumes a horrified expression. Draco Malfoy also tries to steal the diary as Harry is picking up his stuff, but an angered Harry casts Expelliarmus on him, ignoring that Percy Weasley was also there trying to handle the situation, which results in Percy reprimanding Harry.",
  "Brief Summary": "Harry finds a blank diary belonging to T.M. Riddle, suspected to be linked to the last Chamber attacks. Despite no visible writing, Harry feels drawn to it. On Valentine’s Day, Ginny panics upon seeing the diary, and Harry casts a spell at Malfoy after he tries to steal it.",
  "Location": [
    "Hogwarts",
    "Girls Bathroom"
  ],
  "Characters Present": [
    "Malfoy",
    "Ginny"
  ],
  "Emotional State": [
    "curious",
    "angry",
    "embarrassed"
  ],
  "Chronological Placement": 38
}