{
  "memory_id": "Chamber of Secrets 32",
  "template_used": "HP Memory Template",
  "__template_name__": "",
  "__perspective__": "First Hand",
  "Created By": "Me",
  "Tags": [
    "mudblood",
    "hearing voices",
    "Malfoy becomes seeker"
  ],
  "Importance": "Medium",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "The Gryffindor Quidditch team has a very early practice on Saturday morning, where they are treated to an hour-long introduction to a new training programme Oliver Wood spent the summer working on. Soon after the actual practice starts, the Slytherin Quidditch team, with new Nimbus 2001 broomsticks, arrives, and an argument over field time ensues. During the confrontation, Malfoy is revealed to be the new Slytherin seeker, and the one responsible for getting the Slytherin team new brooms. Hermione says that nobody on the Gryffindor team had to buy their way in, they made it on pure talent. to which Malfoy calls Hermione a Mudblood, for which the Gryffindor team react angrily and Ron tries to curse him. However, his damaged wand causes the curse to backfire and he is rushed to Hagrid's cabin when he starts vomiting slugs. Ron and Hagrid both explain to Harry that Mudblood is a very insulting name for Muggle-Borns like Hermione. They also explain that there are some wizards like the Malfoys who think they are better than everyone else because they are Purebloods. After they return to the castle, Professor McGonagall assigns Harry and Ron their detentions. Harry is made to help Lockhart answer his fan mail, while Ron polishes the school's prizes and trophies. During his detention, Harry hears a disembodied sinister voice which Lockhart cannot hear.",
  "Brief Summary": "It is revealed that Malfoy bought the entire Slytherin Quidditch team new brooms, and they made Malfoy their new seeker. Hermione says he bought his way onto the team, to which he responds by calling her a mudblood. Later, in detention, Harry hears sinister voices.",
  "Location": [
    "Hogwarts",
    "Quidditch Pitch"
  ],
  "Characters Present": [
    "Hermione",
    "Malfoy"
  ],
  "Emotional State": [
    "outrage",
    "unease"
  ],
  "Chronological Placement": 32
}