{
  "memory_id": "Chamber of Secrets 26",
  "template_used": "HP Memory Template",
  "__template_name__": "",
  "__perspective__": "First Hand",
  "Created By": "Me",
  "Tags": [
    "Summer with the Dursleys",
    "magic ban",
    "sad birthday"
  ],
  "Importance": "Medium",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Harry Potter is living with the Dursleys for the summer holiday in mid-1992, and things are very bad for him. The Dursleys have become so fearful of Harry's new-found magical abilities that they have locked away all of Harry's magical supplies. They have also banned Harry from saying words such as \"magic\" in the house. The Dursleys have let him keep his pet snowy owl Hedwig, but have put a lock on her cage to keep her inside day and night to avoid suspicion from the neighbours. Naturally, this does not go well for the bird. Every time she gets bored, her screech rings throughout the house, causing an irritated Vernon to warn Harry that if he cannot control her, she will have to go.\n\nOn July 31 (Harry's twelfth birthday), Harry has never felt so lonely, for he misses Hogwarts and his best friends there, Ron Weasley and Hermione Granger. Neither of them have written to him all summer, not even to send birthday wishes. The Dursleys seem to have also forgotten his birthday, as they are busy preparing for a dinner party for one of Uncle Vernon's clients, Mr Mason, from whom Vernon is hoping to get a huge order. The only thing that the Dursleys care about is that Harry has to stay in his room for the night, making no noise and \"pretending he doesn't exist\". Later, Dudley comes waddling over and starts mocking Harry for not receiving a party on his birthday, Harry gets annoyed and scares him away by pretending to think out loud of a spell. Unfortunately, Petunia comes out when Dudley calls for her and beats her nephew with a soapy frying pan. She then gives Harry some chores to do, and once he is finished, Harry goes up to his room without making a sound.",
  "Brief Summary": "Harry is spending the summer with the Dursleys, who lock up his magic supplies and ban him from speaking about magic. They have an important dinner planned, and send Harry to his room. Harry is sad he hasn't heard from Ron or Hermione since they parted ways at Hogwarts.",
  "Location": [
    "Privet Drive"
  ],
  "Characters Present": [
    "Harry",
    "Vernon",
    "Dudley",
    "Petunia"
  ],
  "Emotional State": [
    "lonely"
  ],
  "Chronological Placement": 26
}