{
  "memory_id": "Philosopher's Stone 22",
  "template_used": "HP Memory Template",
  "__perspective__": "First Hand",
  "Created By": "Me",
  "Tags": [
    "three headed dog",
    "devils snare",
    "pholosophers stone"
  ],
  "Importance": "High",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "After finishing their exams, Harry realises the suspicious coincidence in Hagrid wanting a dragon more than anything else, only to meet a stranger who had one to give him. He, Ron, and Hermione run to ask him about the man who gave Norbert to him, and he says he never saw his face because he kept his hood up. Hagrid also mentions that they talked about Hogwarts and Fluffy the three-headed dog. He also mentions that the stranger gave him drinks while getting information out of him. Hagrid lets it slip how to get past Fluffy, which sends Harry, Ron and Hermione off. They head for Dumbledore's office, only to see McGonagall, who tells them he has left for London. After Harry reveals that they know about the Stone, McGonagall insists no one could steal the Stone. The trio realise that Dumbledore has been lured away and that Snape's going after the Stone that night so they decide to head out that night to try to get it themselves. After Hermione curses Neville in a Full Body-Bind Curse for refusing to allow them to leave, they head up to the third-floor room and start their intense trip into the seven Philosopher's Stone Chambers. They find the door ajar, and a harp in the room. Harry plays the flute Hagrid got him for Christmas, and Fluffy goes back to sleep. They head down through the trapdoor. They land in Professor Sprout's room, full of Devil's Snare, which almost smothers them before Hermione lights a fire and drives it off.",
  "Brief Summary": "After discovering that Hagrid let slip how to get past Fluffy, Harry, Ron, and Hermione decide to stop Voldemort themselves. They lull the three headed dog to sleep by playing the flute, and pass through the trap door. They get tangled in Devil Snare, but Hermione's knowledge allows them to escape unharmed.",
  "Location": [
    "Hogwarts"
  ],
  "Characters Present": [
    "Harry",
    "Ron",
    "Hermione",
    "Fluffy"
  ],
  "Emotional State": [
    "determined",
    "surprised",
    "tense"
  ],
  "Chronological Placement": 22
}