{
  "memory_id": "Philosopher's Stone 23",
  "template_used": "HP Memory Template",
  "__perspective__": "First Hand",
  "Created By": "Me",
  "Tags": [
    "Pholosophers stone challenges",
    "teamwork",
    "flying keys",
    "wizards chess",
    "logic puzzle"
  ],
  "Importance": "High",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "The next room, Professor Flitwick's, holds a bunch of flying keys and some broomsticks. Harry finds a silver one with a broken wing that is different from the others and uses a nearby broom and skills as a Seeker to catch it, unlocking the next door with it. The next room is Professor McGonagall's, and has a large chessboard, for a game of Wizard's Chess that requires Harry, Ron, and Hermione to play as pieces. Ron uses his skill at chess to help them win, at the cost of having to sacrifice himself and getting knocked out. Harry and Hermione continue to the next room, Professor Quirrell's, where they find an unconscious troll laying on the floor. Lastly, they enter Professor Snape's room and find seven potions in bottles along with a roll of paper giving clues on which one to drink to continue, noting that three bottles have poison, two have nettle wine, one will send the drinker back, and the other will let the drinker move forward into the next room. Hermione tells Harry that it is a test of logic and not magic wherein most wizards fail. She solves the puzzle, and at Harry's instruction, drinks the one that will allow her to head back through the purple flame, while Harry drinks the one to head into the black flame and into the final room.",
  "Brief Summary": "Harry, Ron, and Hermione work their way through the obstacles keeping them from the philosophers stone. Harry uses his skills flying a broom to catch a flying key, Ron uses his skills at Wizard chess, sacrificing himself, and Hermione completes a logic puzzle. Harry continues on alone.",
  "Location": [
    "Hogwarts"
  ],
  "Characters Present": [
    "Ron",
    "Hermione"
  ],
  "Emotional State": [
    "Determined"
  ],
  "Chronological Placement": 23
}