{
  "memory_id": "Philosopher's Stone 24",
  "template_used": "HP Memory Template",
  "__perspective__": "First Hand",
  "Created By": "Me",
  "Tags": [
    "Confronting Voldemort",
    "fight for the pholosophers stone"
  ],
  "Importance": "High",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "As Harry enters the final chamber, where the philosophers stone is kept, it is Quirrell whom Harry sees in the room, not Snape. Harry, astonished, hears Quirrell tell him that, next to Snape, no one would expect him to try to steal the Stone and that Snape was actually protecting Harry. Harry notices the Mirror of Erised, and Quirrell stops to examine it, saying it is the key to getting the Stone. Harry questions Quirrell, who says he is serving Lord Voldemort, and although Snape hated Harry because of his father, he never wanted Harry dead. He explains how Snape and Harry's father went to school together when they were younger, and how it was there where their hatred against each other started. Quirrell asks for help from his master to get the Stone, and a snake-like voice tells him to use the boy. Harry is told to look into the Mirror. He sees his reflection pull the Stone out of his pocket and put it back in, and Harry feels it drop into his own pocket. He tells Quirrell that he sees himself shaking hands with Dumbledore, after winning the House Cup for Gryffindor. The snake-like voice tells Quirrell Harry is lying and Quirrell takes his turban off to show Harry what lies on the back of his head. Harry is shocked to see another face where the back of Quirrell's head should be. The face has red eyes and a snake-like slit where the nose should be. Harry realises this is the face of Voldemort and Voldemort demands Harry give him the Stone. Harry refuses and runs, but Quirrell seizes him. However, the contact with Harry's skin burns Quirrell and causes him to have boils all over the area in which Harry touched him. Harry grabs Quirrell's face, then his arm, and holds on, with the blinding pain in his scar building, until he feels the arm wrenched away before he blacks out.",
  "Brief Summary": "Upon entering the final chamber where the philosophers stone is kept, Harry is shocked to discover it is Quirrell helping Voldemort, and that Snape has been trying to pretect Harry the whole time. Voldemort is revealed to be attached to the back of Querrill's head, and as Quirrell tries to take the stone, Harry passes out.",
  "Location": [
    "Hogwarts"
  ],
  "Characters Present": [
    "Harry",
    "Quirrell"
  ],
  "Emotional State": [
    "shock",
    "brave",
    "determined"
  ],
  "Chronological Placement": 24
}