{
  "memory_id": "Philosopher's Stone 20",
  "template_used": "HP Memory Template",
  "__perspective__": "First Hand",
  "Created By": "Me",
  "Tags": [
    "Norbert the dragon",
    "Norwegian Ridgeback",
    "getting in trouble"
  ],
  "Importance": "Low",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Harry, Ron and Hermione meet with Hagrid, who confirms the Stone is being kept at Hogwarts. Hermione charms him into talking about the enchantments used to guard it: Fluffy, the three-headed dog, is Hagrid's, along with enchantments from Professors Sprout, Flitwick, McGonagall, Quirrell, and Snape. After this, Harry complains about the high temperature in Hagrid's hut, only to discover he has a Norwegian Ridgeback dragon egg, which he names Norbert once it has hatched. Malfoy, who has been spying on them, discovers the dragon. To solve the problem, they convince Hagrid to send the dragon off to Ron's brother Charlie. Ron's hand is bitten by the dragon, and he is sent off to Madam Pomfrey. Harry and Hermione smuggle Norbert in a crate up to the tallest tower under Harry's Invisibility cloak and on the way they see Professor McGonagall hauling Malfoy away to detention for being out of bed at night and speaking \"lies\" about Harry and a dragon. They pass the crate off to Charlie's friends, and head back down the stairs, where they meet up with Filch, realising too late they have left the Invisibility Cloak behind. Filch takes Harry and Hermione to McGonagall's office, where they meet Neville. McGonagall, very disappointed, takes 50 points each from the three of them and gives them all detention, which they will serve with Malfoy. Their popularity with the other students suffers because of this.",
  "Brief Summary": "Harry learns more about the protections guarding the philosophers stone, and discovers Hagrid has an illegal dragons egg. After the egg hatches they convince Hagrid to let them send it to Ron's brother Charlie. After successfully getting rid of the dragon, Harry and Hermione are caught and punished.",
  "Location": [
    "Hogwarts",
    "Hagrids Hut"
  ],
  "Characters Present": [
    "Harry",
    "Ron",
    "Hermione",
    "McGonagall",
    "Hagrid"
  ],
  "Emotional State": [
    "surprised",
    "guilty"
  ],
  "Chronological Placement": 20
}