{
  "memory_id": "Philosopher's Stone 13",
  "template_used": "HP Memory Template",
  "__perspective__": "First Hand",
  "Created By": "Me",
  "Tags": [
    "three headed dog",
    "magic duel"
  ],
  "Importance": "Medium",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Malfoy comes over with his cronies Vincent Crabbe and Gregory Goyle and teases Harry about getting in trouble during flying practice. The tension grows and Malfoy challenges Harry to a wizard's duel. Harry accepts, in spite of Hermione's attempt to dissuade them from breaking the school rules. As Harry and Ron sneak out later that night, Hermione tries to stop them but gets locked out of the dorm (the Fat Lady has gone for an evening stroll) and must tag along. Neville also joins them, as he has forgotten the password to the common room and ended up sleeping on the floor outside. They arrive at the Trophy Room, the site of the duel, but Malfoy is nowhere to be found. Suddenly, they hear Argus Filch and his cat, Mrs Norris, enter the room. With it obvious that Malfoy tricked them, they begin to hide and then run away. Not sure where they are going, they accidentally end up in the forbidden area on the third floor, staring at a large and scary three-headed dog (named Fluffy). The children manage to get back to their dorm safely, though they are terrified. Hermione reprimands Harry, saying they could have ended up dead, or worse, expelled. Hermione stirs Harry's curiosity by pointing out that the dog was standing on a trapdoor.",
  "Brief Summary": "Harry is challenged to a duel by Malfoy, which Harry accepts. Sneaking out to attend the duel Hermione tries to talk them out of breaking the rules, but gets locked out and tags along. Malfoy doesn't show up to the duel, tipping of Filch. Trying to escape Filch they run into a giant, three headed dog (named Fluffy). The three return to Gryffindor tower without getting caught.",
  "Location": [
    "Hogwarts",
    "Gryffindor Tower"
  ],
  "Characters Present": [
    "Harry",
    "Ron",
    "Hermione",
    "Malfoy",
    "Filch",
    "Fluffy"
  ],
  "Emotional State": [
    "tense",
    "scared"
  ],
  "Chronological Placement": 13
}