{
  "memory_id": "Philosopher's Stone 7",
  "template_used": "HP Memory Template",
  "__perspective__": "First Hand",
  "Created By": "Me",
  "Tags": [
    "Harry gets his wand",
    "shopping in Diagon Alley",
    "Voldemorts wand",
    "purchasing Hedwig"
  ],
  "Importance": "High",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Harry and Hagrid travel around Diagon Alley, picking up various things Harry will need for school. They continue shopping until all Harry needs is his wand and (Hagrid insists) a birthday present. \n\nIn Ollivanders, the wand shop, Mr Ollivander puts Harry off with his creepy demeanour while discussing the wands purchased by Hagrid, Harry's parents, and Voldemort. Ollivander touches Harry's scar and apologises for the fact that he sold the wand that caused it. Ollivander gives Harry a wand and tells him to give it a wave. Harry does so, but it isn't suitable for him, so Ollivander takes it back. Harry tries many wands, but none work well enough for him. Eventually, he picks up a wand and feels warmth in his fingers. Ollivander states that it is very curious that Harry should be destined for that wand when its brother gave Harry his scar. \n\nFor Harry's birthday, Hagrid buys Harry a snowy owl named Hedwig. Hagrid provides Harry with a train ticket, giving him the date, time, and location to catch the Hogwarts Express and tells Harry that if he ever needs anything, he is to write a letter, and Hedwig will know where to find him. Harry catches a train back to the Dursleys.",
  "Brief Summary": "Harry and Hagrid shop for school supplies, eventually reaching Ollivander's wand shop. After trying many wands Harry finds one that responds well to him, and Ollivander informs him that his wand is a \"brother\" of Voldemorts. Hagrid buys Harry an owl named Hedwig.",
  "Location": [
    "Diagon Alley",
    "Ollivander's wand shop"
  ],
  "Characters Present": [
    "Ollivander",
    "Hagrid",
    "Harry"
  ],
  "Emotional State": [
    "amazed",
    "happy"
  ],
  "Chronological Placement": 7
}