{
  "memory_id": "Philosopher's Stone 18",
  "template_used": "HP Memory Template",
  "__perspective__": "First Hand",
  "Created By": "Me",
  "Tags": [
    "Mirror of Erised"
  ],
  "Importance": "Low",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Harry tries on his Invisibility Cloak. Unseen, he is able to go to the library's restricted-books section. But one of the books starts screaming when he opens it, so he quickly leaves. Harry wonders into an empty classroom, and inside stands an old mirror in a gold frame with the inscription \"Erised stra ehru oyt ube cafru oyt on wohsi\" (\"I show not your face, but your heart's desire\"). Harry looks in the mirror and sees many people standing behind him, but when he turns around in the room, he sees no one. Suddenly, he recognises that two of the people in the mirror are his dead mother and father. He tries to speak to them, but they can only communicate by waving.\n\nThe next night, Harry brings Ron with him to the mirror. Ron does not see Harry's parents in the mirror but instead sees himself holding the Quidditch Cup. On the third night, Harry returns to the mirror alone. There he finds Albus Dumbledore. Dumbledore explains to Harry that the mirror, which is known as the Mirror of Erised, displays the deepest desires of whoever looks into it. Harry is relieved to find that Dumbledore is not angry. However, he warns Harry that men have wasted away and been driven mad before the mirror and informs Harry that the mirror will be moved to a new location and tells him not to go looking for it. When Harry asks what Dumbledore sees in the mirror, his answer is \"himself holding a pair of socks.\"",
  "Brief Summary": "Late one night Harry comes across a strange mirror that, instead of displaying his reflection, shows his parents. He tries to show Ron, but Ron only sees himself holding the Quidditch Cup. Later, Dumbledore explains to Harry that the mirror shows you what you most desire.",
  "Location": [
    "Hogwarts"
  ],
  "Characters Present": [
    "Ron",
    "Dumbledore"
  ],
  "Emotional State": [
    "amazed"
  ],
  "Chronological Placement": 18
}