{
  "memory_id": "Philosopher's Stone 10",
  "template_used": "HP Memory Template",
  "__perspective__": "First Hand",
  "Created By": "Me",
  "Tags": [
    "Welcoming feast",
    "school rules"
  ],
  "Importance": "Low",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Everyone sits down to a grand feast to begin the year. Harry is overwhelmed by the variety of luscious food served. Sir Nicholas de Mimsy-Porpington, the resident ghost of Gryffindor (popularly known as Nearly Headless Nick because of a botched decapitation), introduces himself to the first-year students and tells them he hopes they will win the house championship this year. Over dessert, the discussion turns to the students' upbringings. A student named Neville Longbottom tells how his family thought he was a Squib until he survived a fall from a window. Another student, Seamus Finnigan, talks about how his father, a Muggle, was shocked when he found out his wife (Seamus' mother) was a witch. Harry glances around the room and notices a few of the teachers talking to one another. One of them, while speaking to Quirrell, stares malevolently at Harry, who immediately feels a sharp pain in his forehead scar. Harry asks Percy the prefect who he is, and finds out that this man is Professor Severus Snape, who teaches Potions. After dessert, Dumbledore gets up to make his welcome speech. He adds a few warnings about staying away from the Forbidden Forest and avoiding the 3rd-floor corridor on the right side of the school before sending everyone off to bed in their Common rooms.",
  "Brief Summary": "Harry attends the welcoming feast at Hogwarts, talking to fellow Gryffindor students. He notices professor Snape glaring at him, and feels a pain in his scar. Dumbledore gives a welcome speech, warning that students aren't allowed in the forbidden forest, or a corridor on the third floor. They then go to their common room for the night.",
  "Location": [
    "Hogwarts",
    "Great Hall",
    "Gryffindor Tower"
  ],
  "Characters Present": [
    "Dumbledore",
    "Snape"
  ],
  "Emotional State": [
    "happy"
  ],
  "Chronological Placement": 10
}