{
  "memory_id": "Philosopher's Stone 21",
  "template_used": "HP Memory Template",
  "__perspective__": "First Hand",
  "Created By": "Me",
  "Tags": [
    "Meeting Voldemort",
    "centaurs",
    "detention",
    "unicorn"
  ],
  "Importance": "High",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Filch takes Harry, Hermione, Neville, and Malfoy out to the Forbidden Forest to serve their detention, where Hagrid awaits to take them in to do a bit of investigating. Hagrid shows them some silver unicorn blood and says they need to find the unicorn that is hurt. They split up, with Hagrid taking Harry and Hermione, and Neville and Malfoy going with Fang. Hagrid encounters a few centaurs, named Ronan and Bane, but gets no useful information from them. Suddenly, Hagrid sees red sparks in the air, signalling the other party is in trouble. He runs for them and returns, scolding Malfoy for startling Neville into sending up the sparks. Hagrid switches Harry and Neville, sending Harry off with Malfoy instead. They eventually find the dead unicorn and see something drinking its blood. Malfoy screams and runs with Fang, leaving Harry, who is saved from the figure by a centaur, named Firenze, who tells Harry that unicorn blood can keep you alive, even if you are an inch from death, but curses you with a half-life in the process. He then reveals that the person who was drinking it was doing so to remain alive until they were able to drink the Elixir of Life and wants the Stone. He also asks Harry if he would not know anyone who has been waiting for years to regain power and Harry realises that the mysterious figure was a weakened but still alive Voldemort.\nBack in the common room, Harry tells Hermione and Ron Voldemort's in the forest and that Snape wants the Stone to help Voldemort restore his powers. Afterwards, going into his bed, Harry finds that his Invisibility Cloak has been returned to him.",
  "Brief Summary": "Harry and Hermione have to spend their detention with Hagrid, who is looking for a wounded unicorn in the forbidden forest. Harry finds the unicorn, with a shadowy cloaked figure drinking its blood. Harry is saved from the figure by centaurs, and told that unicorn blood can prolong a persons life. Harry believes the figure to have been Voldemort.",
  "Location": [
    "Hogwarts",
    "Forbidden Forest"
  ],
  "Characters Present": [
    "Harry",
    "Hermione",
    "Hagrid",
    "Voldemort",
    "Firenze"
  ],
  "Emotional State": [
    "scared",
    "disturbed"
  ],
  "Chronological Placement": 21
}