{
  "memory_id": "Philosopher's Stone 3",
  "template_used": "HP Memory Template",
  "__perspective__": "First Hand",
  "Created By": "Me",
  "Tags": [
    "Letters from Hogwarts"
  ],
  "Importance": "Medium",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "One day during the summer, Harry is told to get the post for Uncle Vernon. When Harry goes to get the mail, there are three letters: a postcard, a letter that looks like a bill, and a letter for Harry.\n\nHarry can't believe it. He has never had a letter in his life. Harry returns to the kitchen and starts to open his letter. Dudley soon sees that Harry has a letter, and Uncle Vernon snatches it from him to read it with Aunt Petunia. Uncle Vernon tells Harry and Dudley to get out of the kitchen, so they both go and stand in the hall.\n\nLater, when Harry is in his cupboard, Uncle Vernon comes in and says that he has burned the letter and that they are moving him up to Dudley's second bedroom. The next morning at breakfast, Dudley is asked to get the post by Uncle Vernon. Dudley calls out that another letter is addressed to Harry, this time in '''The Smallest Bedroom''' rather than '''The Cupboard Under the Stairs'''. Both Harry and Uncle Vernon rush to the hallway in an attempt to get the letter. After a minute of confused fighting, Uncle Vernon emerges, clutching the letter in his hand.\n\nEvery day, letters appear addressed to Harry, doubling in number. But they begin to appear in the strangest places, with Aunt Petunia even finds some while cracking open eggs. Finally, they get attacked by thirty or forty letters being fired out of the fireplace. Harry still does not manage to get his hands on one of the letters long enough to read it, and a furious Uncle Vernon states that they are leaving the house. They get into their car and leave ten minutes later.",
  "Brief Summary": "Harry is surprised to recieve a mysterious letter in the mail, but before he can read it, Vernon destroys it. However, more and more letters keep arriving, to the point where Vernon decides the only was to escape them is to leave the house entirely.",
  "Location": [
    "Privet Drive"
  ],
  "Characters Present": [
    "Vernon"
  ],
  "Emotional State": [
    "Curious",
    "disappointed",
    "determined."
  ],
  "Chronological Placement": 3
}