{
  "memory_id": "Philosopher's Stone 25",
  "template_used": "HP Memory Template",
  "__perspective__": "First Hand",
  "Created By": "Me",
  "Tags": [
    "End of year feast",
    "Gryffindor wins the house cup",
    "saying goodbye to friends."
  ],
  "Importance": "Medium",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Harry awakes in the hospital wing with Dumbledore there, telling him Quirrell did not succeed at getting the Stone, and indeed the Stone has been destroyed. In spite of this, there are other ways in which Voldemort can return. He cannot be killed, and he left Quirrell to die. Dumbledore explains the reason why Quirrell could not touch Harry was because Harry's mother had died to save him, protecting him with her love. Harry also told Dumbledore about what Quirrell mentioned to him earlier regarding Snape hating Harry due to hatred for his father. Dumbledore responds that Snape was only grudgingly protecting Harry this year to pay off a debt he owed due to James Potter saving his life during their Hogwarts years. Harry then receives a visit from Ron and Hermione. Hagrid shows up later and gives Harry a book of photos of his parents and family.\n\nThe following day, at the end of term feast, Dumbledore awards some last-minute points for the recent events. He gives Ron and Hermione fifty points each, and Harry sixty, which places them in a tie with Slytherin for first place. Dumbledore then recognises that while it is hard to stand up to enemies, it is even harder to stand up to friends as Neville did, and he awards Neville 10 more points. This puts Gryffindor in the lead and the winners of the House Cup, to much rejoicing from everyone but the Slytherins. Not only were Gryffindor students happy, but Hufflepuff and Ravenclaw were happy to see Slytherins downfall. Soon, their trunks are all packed, and they take the Hogwarts Express back towards the muggle world. Harry, Ron and Hermione all say their goodbyes before heading home.",
  "Brief Summary": "Harry wakes up in the hospital wing of Hogwarts, where Dumbledore informs Harry that Voldemort was defeated, but that he is likely to return. Harry attends the end of year feast, in which Gryffindor is awarded enough house points to win the house cup. Harry then says goodbye to Hermione and Ron before returning home.",
  "Location": [
    "Hogwarts",
    "Hospital Wing"
  ],
  "Characters Present": [
    "Dumbledore",
    "Ron",
    "Hermione"
  ],
  "Emotional State": [
    "relieved",
    "celebratory"
  ],
  "Chronological Placement": 25
}