{
  "memory_id": "Philosopher's Stone 9",
  "template_used": "HP Memory Template",
  "__perspective__": "First Hand",
  "Created By": "Me",
  "Tags": [
    "Welcome to Hogwarts",
    "the sorting hat",
    "Gryffindor"
  ],
  "Importance": "High",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "The Hogwarts Express arrives at Hogsmeade Station, and Hagrid escorts the first years across the Lake in boats, where they catch their first glimpse of Hogwarts.\n\nThe new students are greeted at the castle door by Professor Minerva McGonagall, who tells them they will soon be sorted into their houses. All Hogwarts students live in one of four residences: Gryffindor, Hufflepuff, Ravenclaw, or Slytherin, with each house having its own team for Quidditch. The houses are in a yearlong competition with one another to acquire the most points, which are earned by success in Quidditch games and given by teachers for academic achievement and lost for student infractions, in order to win the House Cup awarded at the end of the year.\n\nThe first-years wait in an antechamber while McGonagall checks to see whether it is time yet. The Hogwarts ghosts glide into the room by mistake while debating whether to offer Peeves another chance.\n\nThe students are led to the Great Hall, where the entire school and a battered old hat on a stool are waiting for them. When the students try on the Sorting Hat, it announces the house in which they are placed. Harry becomes very nervous. He has learned that he does not care for Slytherin house, as the students in it are unpleasant and Voldemort once belonged to Slytherin. Hermione is Sorted into Gryffindor, much to Ron's displeasure. Finally, it is Harry's turn to wear the hat. He quietly says to himself \"not Slytherin, not Slytherin!\" The Hat is intrigued by this. \n\nAfter a brief mental discussion with the hat in which it tries to suggest Slytherin to him, the hat places Harry in Gryffindor. Harry is pleased to find that Ron joins in Gryffindor with him. Draco Malfoy is placed in Slytherin.",
  "Brief Summary": "Harry and the other first years are welcomed to Hogwarts, and are informed they are to be sorted into the four houses of Hogwarts. The sorting hat is placed on their head, and after some deliberation, the hat sorts Harry, Ron, and Hermione into Gryffindor, and Malfoy into Slytherin.",
  "Location": [
    "Hogwarts",
    "Great Hall"
  ],
  "Characters Present": [
    "Ron",
    "Hermione",
    "Malfoy"
  ],
  "Emotional State": [
    "excited",
    "nervous",
    "celebratory"
  ],
  "Chronological Placement": 9
}