{
  "memory_id": "Philosopher's Stone 1",
  "template_used": "HP Memory Template",
  "__perspective__": "First Hand",
  "Created By": "Me",
  "Tags": [
    "Harry's life with the Dursleys",
    "Dudley's birthday"
  ],
  "Importance": "High",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "There is no sign that Harry Potter lives at the Dursleys, with no pictures of him on the walls. He is forced to live in the cupboard under the stairs, a very cramped space with many spiders. Petunia comes to Harry's door one morning and wakes him with a shrill voice, tells him to make some bacon; she wants everything perfect for Dudley's 11th birthday. Harry dresses into a pair of Dudley's old clothes and enters the kitchen, where the table is covered in Dudley's presents.\n\nHarry is forced to wear Dudley’s ill fitting hand me downs, as the Dursleys avoid spending money on him whenever possible. Tape holds his glasses together because Dudley has smashed them many times. What distinguishes Harry from others the most is the lightning-shaped scar on his forehead. He often wonders how he got it, and the Dursleys have told him it was from the car crash that killed Harry's parents. Harry doesn't know much more about this accident because the Dursleys' first rule is not to ask questions. Dudley comes into the kitchen and begins to count his presents, only to find 36, which he angrily recalls is one fewer than the year before. Aunt Petunia states that they will buy him two new gifts while they are out. Vernon tells Petunia that their neighbour, Arabella Figg, has broken her leg and cannot take care of Harry while they are at the zoo. They can't think of anyone else who can take care of him, so Harry has to go with them.",
  "Brief Summary": "Harry is treated poorly be his adoptive parents the Dursleys, forced to live in a small cupboard under the stairs and wear Dudley's hand me downs. Dudley complains about his gifts, and Vernon informs Harry that since his babysitter is unavailable, he will be coming with them for Dudley's birthday trip to the zoo.",
  "Location": [
    "Privet Drive"
  ],
  "Characters Present": [
    "Vernon",
    "Dudley",
    "Petunia"
  ],
  "Emotional State": [
    "indifferent"
  ],
  "Chronological Placement": 1
}