{
  "memory_id": "Prisoner of Azkaban 65",
  "template_used": "HP Memory Template",
  "Tags": [
    "winning house cup",
    "winning Quidditch cup",
    "goodby to Lupin"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Harry and Hermione make it back to the hospital wing just in time for Dumbledore to magically lock the door. Shortly afterwards, Snape bursts in, followed by Fudge and Dumbledore, and accuses Harry of freeing Black. Fudge assumes Snape is simply delirious because his chances of receiving the Order of Merlin have gone up in smoke. Fudge leaves to inform the Daily Prophet of the news and agrees to remove the Dementors from Hogwarts, since the Dementors' attempt to perform the Dementor's Kiss on Harry proves them to be more harmful than helpful. Shortly after they leave, Ron wakes up from his unconscious state.\nThe next day, while most of the other students are at Hogsmeade, the trio learns that Lupin is resigning because Snape told the Slytherin house Lupin's secret. Harry goes to see Lupin and is unable to sway Lupin's mind, since Lupin does not want to risk endangering the students again. Lupin confirms Harry's suspicions that James' Animagus form was indeed a stag. Lupin then gives Harry his Invisibility Cloak back, along with the Marauder's Map, and leaves with Dumbledore to catch his carriage.\nLater, while talking with Dumbledore, Harry confesses that he feels bad for not letting Lupin and Black kill Pettigrew, realising that he was the servant that would aid with Voldemort's return from Trelawney's prophecy. Dumbledore reminds Harry that he saved Black, an innocent man, from a terrible fate. Furthermore, Pettigrew owes a life debt to Harry for saving him, which Dumbledore is sure will prove useful later on. Before he leaves, Dumbledore mentions that Harry has some of his father's qualities, which is why his Patronus took the form of Prongs. At the end-of-the-year feast, Gryffindor wins both the Quidditch Cup and the House Cup.",
  "Brief Summary": "Harry and Hermione return to the hospital wing. Snape accuses them of freeing Black, but Fudge dismisses it and removes the Dementors from Hogwarts. Lupin resigns after his secret is revealed, returning Harry’s cloak and map. Dumbledore reassures Harry about saving Pettigrew. Gryffindor wins both the Quidditch and House Cups.",
  "Location": [
    "Hogwarts",
    "Hospital Wing",
    "Great Hall"
  ],
  "Characters Present": [
    "Dumbledore",
    "Lupin",
    "Snape",
    "Fudge"
  ],
  "Emotional State": [
    "concern",
    "celebratory"
  ],
  "Chronological Placement": 65,
  "Created By": "Me",
  "Importance": "Low"
}