{
  "memory_id": "Prisoner of Azkaban 58",
  "template_used": "HP Memory Template",
  "Tags": [
    "Sirius Black attack",
    "Neville's punishment"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "As March arrives, a new Quidditch match approaches: Gryffindor vs. Ravenclaw. During the game, just as Harry is about to catch the Snitch, Cho Chang, a fourth year Seeker for the Ravenclaw team, screams. Harry looks around and sees three Dementors in the stands. He reacts instantly, sending a full-fledged Patronus at the Dementors. Harry catches the Snitch before Cho Chang, winning the match.\nLupin compliments Harry on his Patronus and shows Harry that the \"Dementors\" were really Draco Malfoy, Vincent Crabbe, Gregory Goyle, and Marcus Flint, the Slytherin team captain, trying to sabotage Harry. A furious McGonagall takes fifty points away from Slytherin and sentences all four of them to detention as punishment. The Gryffindors celebrate until Professor McGonagall tells them to go to bed.\nThat night, Ron wakes up to Sirius Black slashing his bed curtains in the boys' dormitory. Everyone thinks it might be a nightmare but the curtains are indeed ripped and Sir Cadogan proves Ron right when he happily admits he let Sirius Black into Gryffindor Tower. Black apparently had the whole week's passwords on a piece of paper. A furious Professor McGonagall demands to know who wrote down the passwords and lost them, to which Neville admits responsibility. Another search of the castle takes place, but Black evades capture again. Tighter security is put in place, and Sir Cadogan is fired and the Fat Lady resumes her duty guarding Gryffindor Tower on the condition her portrait is to be guarded. Ron becomes an instant celebrity, which he enjoys. Neville, on the other hand, is in complete disgrace: Professor McGonagall is so furious with him that she strips him of his visitation rights to Hogsmeade for the rest of the school year, gives him a detention and forbids the other Gryffindors to tell him the password.",
  "Brief Summary": "During the Gryffindor–Ravenclaw match, Harry drives off fake Dementors—Malfoy, Crabbe, Goyle, and Flint in disguise—before winning the game. That night, Sirius Black slashes Ron’s bed curtains after Sir Cadogan let him in using lost passwords from Neville. Security tightens, Sir Cadogan is replaced, and Neville is heavily punished.",
  "Location": [
    "Hogwarts",
    "Gryffindor Tower"
  ],
  "Characters Present": [
    "Sirius",
    "Ron",
    "Neville"
  ],
  "Emotional State": [
    "distressed",
    "ashamed"
  ],
  "Chronological Placement": 59,
  "Created By": "Me",
  "Importance": "Low"
}