{
  "memory_id": "Prisoner of Azkaban 57",
  "template_used": "HP Memory Template",
  "Tags": [
    "Patronus lessons",
    "Dementor's Kiss",
    "friendship troubles"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Harry starts his lessons with Lupin. Lupin tells Harry that the spell to drive off Dementors is called the Patronus Charm, instructs him in how to cast one, and lets him practise on a Boggart. Harry fails to produce a Patronus at first. This, however, is to be expected; the Patronus Charm is well beyond O.W.L. standard. During his first lesson, Harry learns that Lupin was a friend of his father James back during their days at Hogwarts, and also knew Sirius Black as well.\n\nBy February, Harry becomes quite good at producing a Patronus after a few lessons, but doesn't master it entirely. At the end of a lesson, Lupin explains the concept of a Dementor's Kiss and reveals that it will be Black's punishment if they find him. While thinking about the horror of the punishment, Harry runs into McGonagall on his way back to Gryffindor Tower. McGonagall gives Harry back the Firebolt, which has been proven not to be jinxed, and suggests that he practise with it before the match. Harry meets up with Ron and they decide to go make up with Hermione. Outside Gryffindor Tower, they bump into Neville who's in trouble because he lost a list. After the pair let him in, Neville tells Harry and Ron that he made a list of the passwords for Gryffindor Tower because Sir Cadogan is still changing them twice a day but somehow they got lost. Harry attempts to patch things up with Hermione but Scabbers disappears after they arrive at Gryffindor Tower, ruining any chance for Ron and Hermione's reconciliation.",
  "Brief Summary": "Harry trains with Lupin to cast the Patronus Charm, improving but not mastering it. Lupin warns Black will face the Dementor’s Kiss if caught. McGonagall returns Harry’s cleared Firebolt. Harry tries reconciling with Hermione, but Scabbers’ disappearance reignites tensions, especially after Neville loses the Gryffindor Tower password list.",
  "Location": [
    "Hogwarts",
    "Gryffindor Tower"
  ],
  "Characters Present": [
    "Harry",
    "Ron",
    "Hermione",
    "Lupin"
  ],
  "Emotional State": [
    "determined"
  ],
  "Chronological Placement": 57,
  "Created By": "Me",
  "Importance": "Low"
}