{
  "memory_id": "Prisoner of Azkaban 49",
  "template_used": "HP Memory Template",
  "Tags": [
    "inflating Aunt Marge",
    "running from home"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "When Harry awakes the next morning, he goes downstairs hoping to watch TV. Unfortunately for him, he finds his Uncle Vernon and Dudley already watching the news and sits down with them unnoticed as the channel's anchorman is halfway through the report on word from the Muggle Prime Minister out on the London streets of an escaped convict, Sirius Black, who Uncle Vernon comments looks like he came from an asylum rather than a prison. This is obviously because the mental state of Black's gaunt face and elbow-length hair is almost like comparing him to Harry, who luckily feels well groomed. The reporter then transitions to his report on the Ministry of Agriculture and Fisheries' announcement without implying beforehand which prison or asylum Black has escaped from, much to Uncle Vernon's confusion.\nNonetheless, Vernon announces to the family that his sister, Marjorie \"Marge\" Dursley, is coming to visit for a week. Harry agrees to behave normally during her visit, if his uncle will sign his permission form and has to send Hedwig to the Weasleys for the week due to Marge not knowing that Harry is a wizard. On the final night, when she calls his father, James Potter, a lazy good for nothing drunk, Harry loses his temper and accidentally inflates her with magic. Harry decides to take his school things and run away, fearing he will almost certainly be expelled from Hogwarts, after using magic outside school.",
  "Brief Summary": "Harry hears a news report about escaped convict Sirius Black before learning Aunt Marge will visit. Hoping for a signed Hogsmeade form, he agrees to behave, but loses control when she insults his father, accidentally inflating her. Fearing expulsion for using magic, Harry packs and runs away.",
  "Location": [
    "Privet Drive"
  ],
  "Characters Present": [
    "Harry",
    "Vernon",
    "Petunia",
    "Marge"
  ],
  "Emotional State": [
    "Furious"
  ],
  "Chronological Placement": 49,
  "Created By": "Me",
  "Importance": "Medium"
}