{
  "memory_id": "Prisoner of Azkaban 51",
  "template_used": "HP Memory Template",
  "Tags": [
    "new teachers",
    "Dementor attack"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Harry meets up with Ron, Hermione and the rest of the Weasleys who are also staying at the Leaky Cauldron. Much to Ron's displeasure, Hermione purchases a cat named Crookshanks, who harasses Ron's pet rat Scabbers. At some point during the night, Harry overhears a conversation between Ron's parents, Arthur and Molly Weasley. From what he hears, he learns that when Voldemort met his downfall, Black lost everything, and is now trying to kill Harry. He is unconcerned about Black, doubting that the escapee could harm him at Hogwarts with Dumbledore around.\n\nThe next day, Arthur tries to warn Harry about Black and Harry tells him that he already knows because he heard Mr and Mrs Weasley talking about it earlier. On the train, Harry, Ron, and Hermione share a compartment with Professor Remus Lupin, the new Defence Against the Dark Arts teacher. After several hours, the train stops and a sinister, cloaked figure enters. It sucks the happiness out of Harry, who faints. The creature then approaches Harry, possibly to kiss him, until Lupin drives it off with a spell.\nAfter Harry recovers, Lupin hands him and the others some chocolate and explains that the creature was a Dementor, one of the Azkaban Guards, and that they were searching the train for Sirius Black. At Hogwarts, Draco Malfoy taunts Harry over his reaction to the Dementor. After McGonagall speaks with Hermione about her school schedule, they return to the Great Hall to find that they missed the sorting ceremony. Dumbledore announces the two changes in staffing during the year: Lupin, and Hagrid, who has been made the Care of Magical Creatures teacher due to the retirement of Professor Kettleburn. Dumbledore also announces that Dementors are to be stationed around the school as a precaution against Black.",
  "Brief Summary": "Hermione buys a cat, Crookshanks, who targets Ron’s rat, Scabbers. Harry overhears the Weasleys saying Sirius Black wants to kill him. On the train to Hogwarts, a Dementor attacks, causing Harry to faint until Lupin drives it off. At school, Dumbledore announces Dementor security.",
  "Location": [
    "Hogwarts Express",
    "Hogwarts"
  ],
  "Characters Present": [
    "Hermione",
    "Lupin",
    "Ron",
    "McGonagall"
  ],
  "Emotional State": [
    "Happy",
    "distressed"
  ],
  "Chronological Placement": 51,
  "Created By": "Me",
  "Importance": "Medium"
}