{
  "memory_id": "Prisoner of Azkaban 62",
  "template_used": "HP Memory Template",
  "Tags": [
    "Scabbers is Pettigrew",
    "Sirius is innocent",
    "Lupin's a werewolf"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Scabbers escapes from Ron. Harry, Ron, and Hermione chase him and spot the black dog and Crookshanks. Ron catches Scabbers, but the dog grabs him, dragging him into a passage under the Whomping Willow and breaking his leg. Harry, Hermione, and Crookshanks follow to the Shrieking Shack, finding Ron, Scabbers, and Sirius Black — the black dog’s true form.\n\nLupin arrives, accused by Hermione of aiding Black and being a werewolf. Lupin admits to the latter, denies helping Black, and explains he tracked them via the Marauder’s Map, where he also saw Peter Pettigrew alive. Pettigrew, an Animagus, has lived for years as Scabbers.\n\nThe trio doubt him, citing Pettigrew’s supposed murder by Black. Lupin urges Black to explain. Lupin recounts being bitten as a child and how Dumbledore arranged the Shrieking Shack and Whomping Willow to contain him during transformations. Eventually, Sirius, Pettigrew, and James Potter discovered the truth and became Animagi to accompany him. Lupin never told Dumbledore Sirius was one, fearing punishment for enabling them. Snape suddenly arrives, using Harry’s Invisibility Cloak.\n\nSnape tries to arrest Lupin and Black, but Harry, Ron, and Hermione disarm him. Black says he escaped Azkaban after seeing Scabbers in the paper and recognizing Pettigrew. He suspected Pettigrew intended to capture Harry for Voldemort. Black reveals Pettigrew had been the Potters’ Secret-Keeper — chosen at the last moment instead of Sirius, a change even Dumbledore didn’t know. Sirius hadn’t realized Pettigrew was already a spy for Voldemort, who betrayed the Potters immediately. After their deaths, Sirius confronted Pettigrew, who killed twelve Muggles, cut off his finger, transformed into a rat, and escaped, framing Black.\n\nBlack and Lupin force Scabbers to transform, revealing Pettigrew. Black says Pettigrew stayed with the Weasleys to monitor news until it was safe to return to Voldemort. Learning Pettigrew might soon act against Harry, Black escaped Azkaban in Animagus form to find him. He swears to Harry he’d have died before betraying his parents. Harry believes him.\n\nThe group takes Pettigrew back toward the castle, intending to deliver him to the Dementors.",
  "Brief Summary": "Scabbers escapes but is caught by Ron before a black dog drags him into the Whomping Willow tunnel. In the Shrieking Shack, the dog is revealed as Sirius Black. With Lupin’s help, they expose Scabbers as Peter Pettigrew, the Potters’ true betrayer. Sirius’s name cleared to Harry, they take Pettigrew to the castle.",
  "Location": [
    "Shreaking Shack"
  ],
  "Characters Present": [
    "Pettigrew",
    "Harry",
    "Ron",
    "Hermione",
    "Sirius",
    "Lupin"
  ],
  "Emotional State": [
    "tense"
  ],
  "Chronological Placement": 62,
  "Created By": "Me",
  "Importance": "High"
}