{
  "memory_id": "Prisoner of Azkaban 53",
  "template_used": "HP Memory Template",
  "Tags": [
    "Fat Lady attacked",
    "Halloween"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "In October, the Gryffindor Quidditch team practises hard for the upcoming Quidditch season, especially since this is their team captain Oliver Wood's final year at Hogwarts. Oliver believes that their team should be able to win the Quidditch Cup before he graduates. Third years are also visiting Hogsmeade on Hallowe'en, and only Harry is not allowed, because his uncle did not sign his permission form. Harry spends the day in Lupin's office, drinking tea with him. Lupin tells him that he did not let Harry face the Boggart because he mistakenly believed the Boggart would become Lord Voldemort. Harry believes it would have become a Dementor. Shortly afterwards, Snape appears with a mysterious potion for Lupin. Lupin claims to simply have an illness, and that he is aided by the potion.\n\nA few hours later, Ron and Hermione return. They reach the portrait of the Fat Lady and see it slashed and that the Fat Lady is gone. Peeves reveals that he saw her fleeing through another portrait after Sirius Black attacked her for not letting him into Gryffindor Tower. Dumbledore, Argus Filch, and Percy seek her out.\n\nEvery student is moved in the Great Hall to sleep while teachers search the castle. They fail to find any sign of Black. Nobody talks about anything but Sirius Black for the next few days. The Fat Lady refuses to return to work until Black is caught. Because of this, Dumbledore is forced to replace her with Sir Cadogan the Mad Knight. Nobody in Gryffindor House is happy about this both because he changes the password (which are ridiculously complicated) twice a day and because he's extremely annoying, but none of the other pictures wanted the job because of what happened to the Fat Lady.",
  "Brief Summary": "On Hallowe’en, Harry skips the Hogsmeade trip and spends time with Lupin, who explains why he stopped Harry facing the Boggart. That night, Sirius Black slashes the Fat Lady’s portrait trying to enter Gryffindor Tower. Students sleep in the Great Hall, and Sir Cadogan replaces her.",
  "Location": [
    "Hogwarts",
    "Great Hall"
  ],
  "Characters Present": [
    "Harry",
    "Oliver",
    "Sirius",
    "Lupin",
    "Dumbledore"
  ],
  "Emotional State": [
    "concerned",
    "annoyed"
  ],
  "Chronological Placement": 53,
  "Created By": "Me",
  "Importance": "Medium"
}