{
  "memory_id": "Prisoner of Azkaban 48",
  "template_used": "HP Memory Template",
  "Tags": [
    "Living with the Dursleys",
    "Harry's birthday"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Harry Potter spends another summer holiday with the Dursleys. Over the summer, the Dursleys have forbidden him to talk to any of the neighbours or accessing his magic supplies, which was a real problem for Harry, because his teachers at Hogwarts School of Witchcraft and Wizardry have given him a lot of summer homework. He has to sneak some of his books into his room to study in secret. The only improvement in his relationship to the Dursleys that gets changed is that they have given him permission to let his pet snowy owl Hedwig out at night with a promise not to use her to send letter to Ron or Hermione, since Uncle Vernon couldn't take the screeching racket the owl makes while bored if she gets locked in her cage all the time.\n\nOn Harry's thirteenth birthday, after midnight, Harry receives gifts and letters from Ron, Hermione, and Rubeus Hagrid, each wishing him a happy birthday and sending him a gift. Both Ron and Hermione mention in their letters they will be in London on the last week before term to pick up their school supplies and want Harry to join them. Hagrid hints in his letter the book he sent Harry will come in handy next term but he wants the reason for it to be a surprise until the term starts. Another letter from Professor Minerva McGonagall arrives, saying that third years are allowed to visit the village of Hogsmeade and that their guardian needs to sign the permission form in order for them to do so.",
  "Brief Summary": "During summer with the Dursleys, Harry secretly studies since they forbid him access to his magic supplies. On his 13th birthday, he receives gifts and letters from Ron, Hermione, and Hagrid, plus a Hogsmeade permission slip from McGonagall requiring his guardian’s signature.",
  "Location": [
    "Previt Drive"
  ],
  "Characters Present": [
    "Harry",
    "Vernon",
    "Petunia"
  ],
  "Emotional State": [
    "bored"
  ],
  "Chronological Placement": 48,
  "Created By": "Me",
  "Importance": "Low"
}