{
  "memory_id": "Prisoner of Azkaban 50",
  "template_used": "HP Memory Template",
  "Tags": [
    "Knight Bus",
    "avoiding trouble"
  ],
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "He reaches Magnolia Crescent and sees a black dog staring at him. In his shock, Harry falls and the Knight Bus, a triple-decker bus designed for wizard transportation, arrives. The dog vanishes and is nowhere in sight. Harry meets the Knight Bus's conductor, Stan Shunpike and the driver, Ernie Prang. Harry departs on the Knight Bus to the Leaky Cauldron in London. He learns from the Daily Prophet, Sirius Black, the same convict and a follower of Lord Voldemort, broke out of Azkaban, the first person to ever do so. Sirius was imprisoned for murdering thirteen people with a single curse in 1981, right after the Potters' murder. At the Leaky Cauldron, he meets the Minister for Magic, Cornelius Fudge, in person, though Harry has to pretend that he doesn't know him since Harry and Ron were technically breaking school rules during their previous school year when they saw him in Hagrid's Hut. After explaining that Marge has been restored to normal and her memory modified, to Harry's surprise, Fudge doesn't take any action against him stating that accidental uses of magic don't count as violations of the Decree for the Reasonable Restriction of Underage Sorcery. Fudge books a room for Harry, where he will stay for the rest of the summer, but refuses to sign Harry's Hogsmeade permission slip.",
  "Brief Summary": "After seeing a black dog, Harry accidentally summons the Knight Bus to the Leaky Cauldron. There, he learns Sirius Black escaped Azkaban after killing thirteen people in 1981. Minister Fudge excuses Harry’s magic use, arranges his stay for the summer, but refuses to sign his Hogsmeade permission slip.",
  "Location": [
    "Leaky Cauldron"
  ],
  "Characters Present": [
    "Fudge",
    "Harry",
    "Sirius"
  ],
  "Emotional State": [
    "shock",
    "relief"
  ],
  "Chronological Placement": 50,
  "Created By": "Me",
  "Importance": "Low"
}