{
  "memory_id": "Philosopher's Stone 15",
  "template_used": "HP Memory Template",
  "Created By": "Me",
  "Tags": [
    "Wingardium Leviosa",
    "hurting Hermione's feelings",
    "troll battle",
    "Hermione becomes a friend."
  ],
  "Importance": "High",
  "Perspective": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "On Halloween, Flitwick begins teaching his students how to make things fly, using the Wingardium Leviosa spell. Hermione is the first to succeed; Ron, offended by her air of superiority, utters a nasty comment about Hermione not having any friends that Hermione overhears. Harry notices her running off in tears.\n\nHarry and Ron arrive at the Halloween feast to hear Professor Quirrell, the teacher of Defence Against the Dark Arts, burst in and give a terrifying announcement about a twelve-foot troll in the building. As the prefects lead the students back to their dorms, Harry realises that Hermione does not know about the troll. They head off to warn her and come upon the troll. Unwittingly, they lock it in the girls' bathroom only to realise that Hermione is trapped in there with the troll. Rushing into the bathroom they first try to distract the troll by throwing things. Harry jumps on its back and inadvertently jams his wand up its nose. Ron casts Wingardium Leviosa on the trolls club, dropping it on the trolls head, knocking it out. Professor McGonagall finds them and begins to scold the boys. Hermione interjects that Harry and Ron were looking for her. She then lies, saying that she went to face the troll herself and that Ron and Harry had been trying to save her from it. At this point, Hermione befriends them.",
  "Brief Summary": "After Hermione corrects Ron during charms class he insults her, causing Hermione to run and cry in the girls bathroom. Later, when a troll shows up, Harry and Ron work together to rescue Hermione. Hermione becomes their friend.",
  "Location": [
    "Hogwarts",
    "Girls Washroom"
  ],
  "Characters Pesent": [
    "Harry",
    "Ron",
    "Hermione",
    "Troll"
  ],
  "Emotional State": [
    "scared",
    "triumphant"
  ],
  "Chronological Placement": 15
}