{
  "memory_id": "Philosopher's Stone 11",
  "template_used": "HP Memory Template",
  "__perspective__": "First Hand",
  "Created By": "Me",
  "Tags": [
    "first magic classes",
    "Snape's grudge",
    "potions and transfiguration"
  ],
  "Importance": "Medium",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "All of Harry’s classes are very interesting to Harry, with the only exception being History of Magic, taught by Professor Binns. In his first Transfiguration class on Thursday, Professor McGonagall transfigures her desk into a pig and then back again while explaining how Transfiguration itself is some of the most complex and dangerous magic to be learned, and anyone who will get caught messing around with it will have to be banned from the class. Only Hermione is able to make any progress at turning a match into a needle, for which McGonagall gives her a rare smile, but Harry is relieved to see that most of his peers are just as lost as he is. When the time comes to transition to Defence Against the Dark Arts class every morning, the lesson turns into more of a joke, as Quirrell keeps going on with stories about his travels in the year prior, such as when he had ward off a vampire in Romania, and when he had earned his turban from an African prince for saving him from a troublesome zombie. \n\nDuring breakfast on the first Friday, Hedwig arrives with a tea invitation from Hagrid. Later, in his Potions class, Harry discovers that Professor Snape hates him, mocking Harry as \"our new celebrity\" and then humiliating Harry for his ignorance of potion-making materials, asking him a series of questions he doesn’t know the answer to, all why Hermione is raising her hand, being completely ignored by Snape, much to her frustration.",
  "Brief Summary": "Harry experiences his first classes at Hogwarts, and is pleased to see most other students (except for Hermione) are just as clueless as he is. In his first potions class, Snape makes it a point to embarrass Harry as much as possible. Snape clearly has a grudge against Harry.",
  "Location": [
    "Hogwarts",
    "Transfiguration Classroom",
    "Potions Classroom"
  ],
  "Characters Pesent": [
    "Harry",
    "McGonagall",
    "Snape",
    "Hermione"
  ],
  "Emotional State": [
    "interested",
    "embarrassed"
  ],
  "Chronological Placement": 11
}