{
  "memory_id": "Philosopher's Stone 5",
  "template_used": "HP Memory Template",
  "__perspective__": "First Hand",
  "Created By": "Me",
  "Tags": [
    "meeting professor Quirrell",
    "entering the magical world"
  ],
  "Importance": "Medium",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "When Harry wakes the following day, he hears a tapping noise coming from the window and lets in an owl. The owl drops a newspaper on Hagrid's lap and begins to claw Hagrid's coat. Hagrid tells Harry to pay the owl, so Harry does what he says, and the owl leaves. Hagrid tells him they have to go and buy his things, but Harry worries because he hasn't got any money. Hagrid tells him his parents didn't leave him without money and that their first stop is Gringotts, the wizard's bank. Hagrid says Dumbledore also needs something from Gringotts, so Hagrid has to go get it.\n\nAs they pass through London, people often stare at Hagrid due to his size and his pointing out things that Muggles are brilliant at inventing. Harry asks if there are Dragons guarding Gringotts. Hagrid says yes and mutters that he would like a dragon. Harry takes out his list and reads it out. It says he needs a set of robes, a pointed hat, dragon hide gloves, and a winter coat. There is a list of his books and stationary equipment. Hagrid leads them both into a pub called the Leaky Cauldron Harry did not notice was there. A man with a turban approaches them, and Hagrid introduces Harry to Quirinus Quirrell, the Defence Against the Dark Arts professor at Hogwarts. They talk for a bit then Hagrid steers them out a back door into a small enclosed area with a few barrels. Hagrid takes out his umbrella and taps bricks with it, counting an order. Once he is done, a hole appears in the brick wall, slowly getting bigger, until the wall disappears entirely, revealing a crowded street with people wearing robes everywhere with shops left and right. Hagrid tells Harry the street is called Diagon Alley.",
  "Brief Summary": "Hagrid takes Harry to Diagon Alley to shop for school supplies. Harry expresses concern that he doesn't have money for school supplies, only for Hagrid to inform him that his parents left him plenty of money, and they are going to Gringotts bank to get some.",
  "Location": [
    "Diagon Alley"
  ],
  "Characters Pesent": [
    "Hagrid",
    "Harry",
    "Quirrell"
  ],
  "Emotional State": [
    "awe",
    "excitement"
  ],
  "Chronological Placement": 5
}