{
  "memory_id": "Philosopher's Stone 19",
  "template_used": "HP Memory Template",
  "__perspective__": "First Hand",
  "Created By": "Me",
  "Tags": [
    "Philosophers stone",
    "Nicolas Flamel"
  ],
  "Importance": "Low",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Harry suddenly remembers that he read the name Nicolas Flamel on a chocolate frog card, which reminds Hermione that she had seen the name in a book she picked up from the library, and the team discover that he was a famous alchemist who is the only known maker of the Philosopher's Stone, whose powers include turning any metal to gold and producing the Elixir of Life, a potion that can make the drinker immortal.\n\nThe Gryffindor versus Hufflepuff Quidditch match arrives and Snape, who referees the match, is predictably biased, while on the stands Ron and Neville get into a scuffle with Malfoy, Crabbe, and Goyle after Malfoy made some rude comments towards the players of their house's team as well as both of them. Harry catches the snitch and wins the match under five minutes, though Ron did not see this due to fighting Draco Malfoy, and Neville is sent to the hospital wing due to the injuries he sustained from fighting both Crabbe and Goyle. Later, Harry notices and follows Snape into the Forbidden Forest by broomstick where he meets Quirrell and they speak of the Philosopher's Stone. Harry thinks that Snape is trying to force Quirrell to help him get the stone so he can get rich, to the alarm of both Ron and Hermione who fear Quirrell will talk.",
  "Brief Summary": "Harry discovers Nicolas Flamel is an alchemist who created the Philosophers Stone, which can make a person immortal. Later, Harry sees Snape talk about the Philosophers Stone, causing Harry to think Snape intends to steal it.",
  "Location": [
    "Hogwarts"
  ],
  "Characters Pesent": [
    "Harry",
    "Snape",
    "Quirrell"
  ],
  "Emotional State": [
    "suspicious"
  ],
  "Chronological Placement": 19
}