{
  "memory_id": "Philosopher's Stone 2",
  "template_used": "HP Memory Template",
  "__perspective__": "First Hand",
  "Created By": "Me",
  "Tags": [
    "talking to snakes",
    "Dudley's birthday"
  ],
  "Importance": "Medium",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Dudley is allowed to take a friend to the zoo and chooses his friend Piers Polkiss. Piers comes to the house with his mother. A half-hour later, Harry sits in the car with Dudley, Piers, Vernon, and Petunia. On the way, a motorbike overtakes them, and Vernon complains about them. Harry remarks that he has dreamed about a flying motorbike, and Vernon snappily reminds him that motorbikes do not fly. Harry thinks about all the strange things that have happened to him: he once jumped onto the school chimney and mysteriously grew all of his hair back the morning after a haircut. At the zoo, Dudley and Piers find the animals boring. Harry is left to watch a Boa constrictor as it sleeps, and when Dudley tries to make it move, it wakes up but still doesn't move. The snake begins to move after Dudley and Piers slink away. Moments later, Harry speaks to the snake and finds it miraculously understands him. Upon realising that it is now moving, Piers calls Dudley and Vernon back to the snake's exhibit. Dudley pushes Harry out of the way and he lands hard on the concrete floor Dudley presses his face against the glass. Harry becomes angry, and somehow the glass vanishes, and the snake gets out, scaring Dudley and Piers. As the snake slithers away, Harry thinks he hears it speak back to him. Piers tattletales on Harry that he had been talking to the snake, and Uncle Vernon sends him to his cupboard –with no meals for a week as cruel punishment.",
  "Brief Summary": "Harry goes to the zoo with the Dursleys, but the animals aren't very active. Harry discovers he can talk to one of the snakes, but as soon as the snake shows interest, Dudley pushes Harry aside to look at it. Harry gets mad, and the glass in the enclosure vanishes, allowing Dudley to fall in.",
  "Location": [
    "Zoo"
  ],
  "Characters Pesent": [
    "Harry",
    "Dudley"
  ],
  "Emotional State": [
    "bored",
    "intrigued",
    "angry"
  ],
  "Chronological Placement": 2
}