{
  "memory_id": "Philosopher's Stone 4",
  "template_used": "HP Memory Template",
  "__perspective__": "First Hand",
  "Created By": "Me",
  "Tags": [
    "Meeting Hagrid",
    "Harry discovers he's a wizard",
    "secrets revealed"
  ],
  "Importance": "High",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "In an attempt to escape the letters arriving for Harry, the Dursleys head to a remote cabin on a small rock island. Harry remembers that the next day will be his eleventh birthday. There is a loud knocking at the door.\n\nUncle Vernon comes through with Aunt Petunia cowering behind him. The door is blasted off its hinges and hits the floor. The giant turns his eyes to Harry and greets him, saying he hasn't seen him since he was a baby. The giant presents Harry with a birthday cake. Harry asks the giant who he is, and he says he is Rubeus Hagrid, the Keeper of Keys and Grounds at Hogwarts School of Witchcraft and Wizardry. He is shocked to discover that Harry knows nothing about Hogwarts. He gets angry at the Dursleys for not telling him anything about his parents' world, his world. Hagrid tells Harry his parents are famous and that he's a wizard. Hagrid gives Harry the letter that he has been craving. It tells him that he has been accepted into Hogwarts School of Witchcraft and Wizardry.\n\nUncle Vernon tells Hagrid that Harry won't be going, but the giant knows that a Muggle like him can't stop Harry from going to Hogwarts. Uncle Vernon reveals he knew that Harry's a wizard, and Aunt Petunia tells Harry that her sister, Harry's mother, was a witch. Petunia said another wizard killed them, and Harry screams that Petunia said they got killed in a car crash. Hagrid is as outraged as Harry is that the Dursleys have lied that much. He sits down and tells Harry that a Dark wizard named Lord Voldemort killed Harry's parents and tried to kill Harry too. But the spell he used backfired, only leaving Harry his scar. Voldemort vanished and hasn't been seen since.\n\nHarry doubts he is a wizard until Hagrid asks if he ever made anything he couldn't explain happen when he was angry or scared. When Uncle Vernon makes the mistake of mocking Dumbledore, Hagrid swishes the umbrella in Dudley's direction, and Dudley sprouts a curly pig's tail. Hagrid asks Harry not to mention it at Hogwarts.",
  "Brief Summary": "When the Dursleys go to a remote cabin to hide from the unending letters, Hagrid arrives to deliver one in person. He tells Harry he is a wizard and about his family history, and that he will be attending Hogwarts School of Witchcraft and Wizardry, despite Vernon's protests.",
  "Location": [
    "Island Cabin"
  ],
  "Characters Pesent": [
    "Harry",
    "Hagrid",
    "Vernon",
    "Petunia"
  ],
  "Emotional State": [
    "Surprise",
    "wonder"
  ],
  "Chronological Placement": 4
}