{
  "memory_id": "Chamber of Secrets 45",
  "template_used": "HP Memory Template",
  "Tags": [
    "Facing Voldemort",
    "The truth about Riddle"
  ],
  "__perspective__": "Second Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Harry finds himself standing in the chamber of secrets. At the far end by the foot of Slytherin's statue, he finds Ginny lying on the ground, pale and cold. He drops his wand and runs to her. Tom Riddle approaches them, holding Harry's wand, and remarks that his presence in the present is because he is a memory, preserved in his own diary for 50 years. He then reveals what has happened: Riddle had opened the Chamber of Secrets fifty years earlier and intended to purge the school of Muggle-borns; however, when he discovered that the school was going to close down because of the attacks and that Dumbledore was keeping a closer watch on him, he was left to abandon the attacks and frame Hagrid for doing it. He left behind a diary containing the memory of his 16-year-old self in hopes that it would fall into the hands of an unsuspecting victim.\n\nThe diary ended up in Ginny's possession. Riddle had written back sympathetically, and Ginny grew to confess her fears. He gradually grew more powerful and eventually managed to pour some of his soul into her, possessing her and using to open the Chamber of Secrets, releasing the Basilisk. However, Ginny became suspicious of the diary and tried to dispose of it by flushing it down a toilet. This is when Harry found it, and when Ginny saw Harry with the diary on Valentine's Day, she panicked and worried that Riddle had told Harry about her role in the attacks, so she stole it from his dormitory. It began taking control of her again, with the intention of killing Harry. He had Ginny write her own farewell on the wall and come down to wait, luring Harry to his doom. Riddle remarks that \"Voldemort is his past, present and future.\" He then writes the air with Harry's wand his full name, TOM MARVOLO RIDDLE, then waves the wand and the letters form an anagram: I AM LORD VOLDEMORT.",
  "Brief Summary": "In the Chamber, Harry finds Ginny unconscious and meets Tom Riddle, who reveals he is a memory preserved in the diary. Riddle confesses to opening the Chamber 50 years ago, framing Hagrid, and possessing Ginny to do it again. He reveals his true identity: Tom Marvolo Riddle—Lord Voldemort.",
  "Location": [
    "Hogwarts",
    "Chamber of Secrets"
  ],
  "Characters Present": [
    "Voldemort",
    "Harry",
    "Ginny"
  ],
  "Emotional State": [
    "concerned",
    "determined"
  ],
  "Chronological Placement": 45,
  "Created By": "Me",
  "Importance": "High"
}