{
  "memory_id": "Chamber of Secrets 47",
  "template_used": "HP Memory Template",
  "Tags": [
    "freeing Dobby",
    "Lucius exposed",
    "happy ending"
  ],
  "__perspective__": "Second Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "At McGonagall's office, Harry, Ron, and Ginny find Dumbledore, McGonagall, Arthur and Molly Weasley, who are delighted to see them alive. Harry worries that Ginny will get blamed for being the person behind the attacks, but to his great relief Dumbledore rightly deduces that Voldemort is the culprit and only used Ginny's body. Harry and Ron both receive two hundred house points each for Gryffindor and both get an Award for special services to the school, and then Dumbledore asks to speak with Harry alone. Dumbledore reveals that Voldemort transferred some of his powers to Harry when he gave him his scar, explaining his ability to speak Parseltongue.\n\nLucius Malfoy then barges into McGonagall's office, outraged that Dumbledore has returned to the school after being dismissed. Dumbledore calmly responds that the governors had asked him to return once they discovered that Arthur Weasley's daughter was attacked. Apparently, they had been blackmailed by Malfoy to vote for Dumbledore's dismissal in the first place under Malfoy's threat of cursing their families. Dobby follows Lucius into the room, thus showing that his masters are the Malfoys. Dumbledore and Malfoy have a calm but venomous interchange (respectively), during which Dumbledore and Harry(with the help of Dobby's unspoken hints) essentially expose Lucius for sneaking Riddle's diary (one of his illegal artefacts) into Ginny's school things during the fight with Arthur at Flourish and Blotts. Malfoy dares Dumbledore to prove his accusation.\n\nKnowing that a master can release his house-elf by giving them some clothes, Harry tricks Malfoy into freeing Dobby by giving Malfoy one of his own socks, which he promptly passes to Dobby as rubbish to get rid of him. Malfoy's retribution is thwarted by the now free Dobby, who then thanks Harry profusely and disappears.",
  "Brief Summary": "Dumbledore clears Ginny of blame, praising Harry and Ron with awards and house points. Dumbledore explains Voldemort transferred powers to Harry. Lucius Malfoy storms in, but is exposed for planting the diary. Harry tricks him into freeing Dobby, who stops Malfoy’s retaliation and gratefully thanks Harry.",
  "Location": [
    "Hogwarts"
  ],
  "Characters Present": [
    "Harry",
    "Dumbledore",
    "Lucius",
    "Dobby"
  ],
  "Emotional State": [
    "concern",
    "relief",
    "satisfaction"
  ],
  "Chronological Placement": 47,
  "Created By": "Me",
  "Importance": "Low"
}