{
  "memory_id": "Chamber of Secrets 40",
  "template_used": "HP Memory Template",
  "Tags": [
    "petrified",
    "Tom Riddle's diary"
  ],
  "__template_name__": "",
  "__perspective__": "First Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Harry, Ron and Hermione hope that the mysterious petrification attacks have stopped-and indeed, almost four months after the attack on Justin and Nearly-Headless Nick, the disembodied voice keeps quiet and the attacks seem to have ceased. Harry returns to his dormitory one day to find it a mess, and Harry eventually notices that Tom Riddle's Diary is gone. This greatly befuddles him, knowing that only a Gryffindor student or a staff member could know the password to enter the dormitory. The next day, there is another attack and Harry hears the voice again. McGonagall calls for Harry and Ron personally, and leads them to the Hospital Wing, where they see Hermione petrified. She was found near the library with a Ravenclaw prefect, holding a small circular mirror. This proves that Harry is not the Heir of Slytherin, since he would never attack one of his friends. Harry and Ron decide they now must talk to Hagrid. They sneak out using Harry's invisibility cloak. When they reach Rubeus Hagrid's cabin Harry and Ron manage to hide just before Cornelius Fudge, who is the Minister for Magic, and Dumbledore arrive at the scene. Fudge announces that Hagrid, who he believes opened the Chamber of Secrets the last time, will be sent to Azkaban prison as a precaution. They are shortly joined by Lucius Malfoy, who declares that he and the other governors of Hogwarts have unanimously voted to suspend Dumbledore, despite the obvious logic that this would only worsen the situation. Both Hagrid and Dumbledore give last words to Harry and Ron: Hagrid says that if anybody wants the truth they should \"follow the spiders\" and Dumbledore says that he will only truly have left the school when none there remain loyal to him, and he will always be there for those who need help.",
  "Brief Summary": "Four months pass without attacks until Hermione is found petrified, clutching a mirror. Riddle’s diary vanishes, and suspicion shifts. Harry and Ron visit Hagrid, but Fudge arrests him and Lucius has Dumbledore suspended. Before leaving, Hagrid cryptically says to “follow the spiders,”.",
  "Location": [
    "Hogwarts",
    "Hagrid's Hut"
  ],
  "Characters Present": [
    "Harry",
    "Hagrid",
    "Lucius",
    "Dumbledore"
  ],
  "Emotional State": [
    "confused",
    "suspicious",
    "outraged"
  ],
  "Chronological Placement": 40,
  "Created By": "Me",
  "Importance": "High"
}