{
  "memory_id": "Chamber of Secrets 46",
  "template_used": "HP Memory Template",
  "Tags": [
    "battling the Basilisk",
    "healed by Fawkes"
  ],
  "__perspective__": "Second Hand",
  "Source": "https://harrypotter.fandom.com/wiki/Main_Page",
  "Full Memory": "Riddle remarks that he couldn't bear to use the name of a Muggle father who abandoned him when he found out that his wife was a witch. Instead he scrambled that name to create a new one which he knew people would fear when he became the \"greatest sorcerer in the world\". Harry remarks that he must be mistaken, because, as everybody knows, Albus Dumbledore is the greatest sorcerer in the world. Riddle replies that Dumbledore has been driven out the castle by the mere memory of him. Harry declares that Dumbledore is not as gone as Riddle seems to think. In this display of loyalty, he summons Fawkes the phoenix to him, who also brings with it the Sorting Hat, both assets that Riddle claims to be extremely useless.\n\nRiddle then summons the Basilisk and commands it to kill Harry. However, Fawkes is not defenceless, and pecks out the Basilisk's eyes, preventing its gaze from killing. The basilisk is still able to hear and smell Harry, however, and remains very dangerous, so Harry, in desperation, puts on the Sorting Hat, wishing against hope for help. Instead of an answer, a heavy sword with a hilt embedded with rubies falls on Harry's head from inside the hat. After several missed strikes from the blinded Basilisk, it strikes again, right at him this time, but Harry thrusts the sword into the roof of the Basilisk's mouth, killing it. However, one of its poisonous fangs falls into his arm, injecting a deadly poison. While Riddle gloats over his \"win\", Harry takes Riddle's diary and thrusts the Basilisk fang into the diary. Ink begins pouring out of the book like blood as Riddle is destroyed. Ginny instantly stirs and wakes up as Harry is now moments from death, when Fawkes cries on the wound, and since phoenix tears have healing powers, Harry is instantly cured. Harry and Ginny travel back through the Chamber to find Ron and Lockhart; Lockhart has no idea of who or where he is. They return to Moaning Myrtle's bathroom, and head to McGonagall's office.",
  "Brief Summary": "Riddle reveals he renamed himself Voldemort to reject his Muggle heritage. Fawkes and the Sorting Hat arrive to aid Harry. Riddle summons the Basilisk, but Fawkes blinds it. Harry receives Gryffindor’s sword from the hat and kills the beast, though he’s poisoned. He destroys the diary, saving Ginny, and Fawkes heals him.",
  "Location": [
    "Hogwarts",
    "Chamber of Secrets"
  ],
  "Characters Present": [
    "Voldemort",
    "Harry",
    "Ginny"
  ],
  "Emotional State": [
    "determined",
    "distressed",
    "victorious"
  ],
  "Chronological Placement": 46,
  "Created By": "Me",
  "Importance": "High"
}